class _PMD	size(12):
	+---
 0	| mdisp
 4	| pdisp
 8	| vdisp
	+---

class _TypeDescriptor	size(8):
	+---
 0	| pVFTable
 4	| spare
 8	| name
	+---

class _s__CatchableType	size(28):
	+---
 0	| properties
 4	| pType
 8	| _PMD thisDisplacement
20	| sizeOrOffset
24	| copyFunction
	+---

class _s__CatchableTypeArray	size(4):
	+---
 0	| nCatchableTypes
 4	| arrayOfCatchableTypes
	+---

class _s__ThrowInfo	size(16):
	+---
 0	| attributes
 4	| pmfnUnwind
 8	| pForwardCompat
12	| pCatchableTypeArray
	+---

class _s__RTTIBaseClassDescriptor	size(28):
	+---
 0	| pTypeDescriptor
 4	| numContainedBases
 8	| _PMD where
20	| attributes
24	| pClassDescriptor
	+---

class _s__RTTIBaseClassArray	size(1):
	+---
 0	| arrayOfBaseClassDescriptors
	+---

class _s__RTTIClassHierarchyDescriptor	size(16):
	+---
 0	| signature
 4	| attributes
 8	| numBaseClasses
12	| pBaseClassArray
	+---

class _s__RTTICompleteObjectLocator	size(20):
	+---
 0	| signature
 4	| offset
 8	| cdOffset
12	| pTypeDescriptor
16	| pClassDescriptor
	+---

class __s_GUID	size(16):
	+---
 0	| Data1
 4	| Data2
 6	| Data3
 8	| Data4
	+---

class __vc_attributes::helper_attributes::default_valueAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helper_attributes::attributeAttribute	size(8):
	+---
 0	| ValidOn
 4	| AllowMultiple
 5	| Inherited
  	| <alignment member> (size=2)
	+---

class __vc_attributes::helper_attributes::source_annotation_attributeAttribute	size(8):
	+---
 0	| ValidOn
 4	| AllowMultiple
  	| <alignment member> (size=3)
	+---

class __vc_attributes::helper_attributes::v1_earlyAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::v1_nameAttribute	size(4):
	+---
 0	| name
	+---

class __vc_attributes::helper_attributes::v1_alttypeAttribute	size(4):
	+---
 0	| type_e type
	+---

class __vc_attributes::helper_attributes::usageAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helper_attributes::repeatableAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::as_stringAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::process_earlyAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::notify_atlprovAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::help_stringAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helper_attributes::requires_valueAttribute	size(1):
	+---
	+---

class __vc_attributes::helper_attributes::multi_valueAttribute	size(1):
	+---
	+---

class __vc_attributes::event_receiverAttribute	size(8):
	+---
 0	| type_e type
 4	| layout_dependent
  	| <alignment member> (size=3)
	+---

class __vc_attributes::no_injected_textAttribute	size(1):
	+---
 0	| value
	+---

class __vc_attributes::emitidlAttribute	size(8):
	+---
 0	| value
 4	| defaultimports
  	| <alignment member> (size=3)
	+---

class __vc_attributes::exportAttribute	size(1):
	+---
	+---

class __vc_attributes::idl_moduleAttribute	size(32):
	+---
 0	| name
 4	| dllname
 8	| version
12	| uuid
16	| helpstring
20	| helpstringcontext
24	| helpcontext
28	| hidden
29	| restricted
  	| <alignment member> (size=2)
	+---

class __vc_attributes::idl_quoteAttribute	size(4):
	+---
 0	| text
	+---

class __vc_attributes::implementsAttribute	size(8):
	+---
 0	| interfaces
 4	| dispinterfaces
	+---

class __vc_attributes::importidlAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::includelibAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::library_blockAttribute	size(1):
	+---
	+---

class __vc_attributes::satypeAttribute	size(4):
	+---
 0	| type
	+---

class __vc_attributes::propgetAttribute	size(1):
	+---
	+---

class __vc_attributes::propputAttribute	size(1):
	+---
	+---

class __vc_attributes::propputrefAttribute	size(1):
	+---
	+---

class __vc_attributes::providerAttribute	size(12):
	+---
 0	| name
 4	| uuid
 8	| cookies
	+---

class __vc_attributes::coclassAttribute	size(1):
	+---
	+---

class __vc_attributes::controlAttribute	size(1):
	+---
	+---

class __vc_attributes::customAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::dispinterfaceAttribute	size(1):
	+---
	+---

class __vc_attributes::dualAttribute	size(1):
	+---
	+---

class __vc_attributes::lcidAttribute	size(1):
	+---
	+---

class __vc_attributes::objectAttribute	size(1):
	+---
	+---

class __vc_attributes::progidAttribute	size(4):
	+---
 0	| name
	+---

class __vc_attributes::threadingAttribute	size(4):
	+---
 0	| threading_e value
	+---

class __vc_attributes::uuidAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::versionAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::vi_progidAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::moduleAttribute	size(56):
	+---
 0	| type_e type
 4	| name
 8	| version
12	| uuid
16	| lcid
20	| control
  	| <alignment member> (size=3)
24	| helpstring
28	| helpstringcontext
32	| helpstringdll
36	| helpfile
40	| helpcontext
44	| hidden
45	| restricted
  	| <alignment member> (size=2)
48	| custom
52	| resource_name
	+---

class __vc_attributes::aggregatableAttribute	size(4):
	+---
 0	| type_e type
	+---

class __vc_attributes::appobjectAttribute	size(1):
	+---
	+---

class __vc_attributes::async_uuidAttribute	size(4):
	+---
 0	| uuid
	+---

class __vc_attributes::bindableAttribute	size(1):
	+---
	+---

class __vc_attributes::call_asAttribute	size(4):
	+---
 0	| local_proc
	+---

class __vc_attributes::caseAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::cpp_quoteAttribute	size(4):
	+---
 0	| string
	+---

class __vc_attributes::defaultAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::defaultbindAttribute	size(1):
	+---
	+---

class __vc_attributes::defaultcollelemAttribute	size(1):
	+---
	+---

class __vc_attributes::defaultvalueAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::defaultvtableAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::displaybindAttribute	size(1):
	+---
	+---

class __vc_attributes::entryAttribute	size(4):
	+---
 0	| entry_id
	+---

class __vc_attributes::first_isAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::helpcontextAttribute	size(4):
	+---
 0	| helpcontext_value
	+---

class __vc_attributes::helpfileAttribute	size(4):
	+---
 0	| filename
	+---

class __vc_attributes::helpstringAttribute	size(4):
	+---
 0	| help_text_string
	+---

class __vc_attributes::helpstringcontextAttribute	size(4):
	+---
 0	| contextid
	+---

class __vc_attributes::helpstringdllAttribute	size(4):
	+---
 0	| dllname
	+---

class __vc_attributes::hiddenAttribute	size(1):
	+---
	+---

class __vc_attributes::idAttribute	size(4):
	+---
 0	| id_num
	+---

class __vc_attributes::iid_isAttribute	size(4):
	+---
 0	| limited_expression
	+---

class __vc_attributes::immediatebindAttribute	size(1):
	+---
	+---

class __vc_attributes::importAttribute	size(4):
	+---
 0	| idl_file
	+---

class __vc_attributes::importlibAttribute	size(4):
	+---
 0	| tlb_file
	+---

class __vc_attributes::inAttribute	size(1):
	+---
	+---

class __vc_attributes::includeAttribute	size(4):
	+---
 0	| include_file
	+---

class __vc_attributes::last_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::length_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::licensedAttribute	size(1):
	+---
	+---

class __vc_attributes::localAttribute	size(1):
	+---
	+---

class __vc_attributes::max_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::ms_unionAttribute	size(1):
	+---
	+---

class __vc_attributes::nonbrowsableAttribute	size(1):
	+---
	+---

class __vc_attributes::noncreatableAttribute	size(1):
	+---
	+---

class __vc_attributes::nonextensibleAttribute	size(1):
	+---
	+---

class __vc_attributes::odlAttribute	size(1):
	+---
	+---

class __vc_attributes::oleautomationAttribute	size(1):
	+---
	+---

class __vc_attributes::optionalAttribute	size(1):
	+---
	+---

class __vc_attributes::outAttribute	size(1):
	+---
	+---

class __vc_attributes::pointer_defaultAttribute	size(4):
	+---
 0	| type_e type
	+---

class __vc_attributes::pragmaAttribute	size(4):
	+---
 0	| token_sequence
	+---

class __vc_attributes::ptrAttribute	size(1):
	+---
	+---

class __vc_attributes::publicAttribute	size(1):
	+---
	+---

class __vc_attributes::rangeAttribute	size(8):
	+---
 0	| low_val
 4	| high_val
	+---

class __vc_attributes::readonlyAttribute	size(1):
	+---
	+---

class __vc_attributes::refAttribute	size(1):
	+---
	+---

class __vc_attributes::requesteditAttribute	size(1):
	+---
	+---

class __vc_attributes::restrictedAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::retvalAttribute	size(1):
	+---
	+---

class __vc_attributes::size_isAttribute	size(4):
	+---
 0	| expression
	+---

class __vc_attributes::stringAttribute	size(1):
	+---
	+---

class __vc_attributes::sourceAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::switch_isAttribute	size(4):
	+---
 0	| limited_expression
	+---

class __vc_attributes::switch_typeAttribute	size(4):
	+---
 0	| switch_type_specifier
	+---

class __vc_attributes::transmit_asAttribute	size(4):
	+---
 0	| xmit_type
	+---

class __vc_attributes::uidefaultAttribute	size(1):
	+---
	+---

class __vc_attributes::uniqueAttribute	size(1):
	+---
	+---

class __vc_attributes::usesgetlasterrorAttribute	size(1):
	+---
	+---

class __vc_attributes::v1_enumAttribute	size(1):
	+---
	+---

class __vc_attributes::varargAttribute	size(1):
	+---
	+---

class __vc_attributes::wire_marshalAttribute	size(4):
	+---
 0	| wire_type
	+---

class __vc_attributes::event_sourceAttribute	size(12):
	+---
 0	| type_e type
 4	| optimize_e optimize
 8	| decorate
  	| <alignment member> (size=3)
	+---

class __vc_attributes::hookAttribute	size(16):
	+---
 0	| event
 4	| source
 8	| handler
12	| receiver
	+---

class __vc_attributes::unhookAttribute	size(16):
	+---
 0	| event
 4	| source
 8	| handler
12	| receiver
	+---

class __vc_attributes::atl::synchronizeAttribute	size(1):
	+---
	+---

class __vc_attributes::atl::soap_handlerAttribute	size(20):
	+---
 0	| name
 4	| namespace
 8	| protocol
12	| style
16	| use
	+---

class __vc_attributes::atl::soap_methodAttribute	size(4):
	+---
 0	| name
	+---

class __vc_attributes::atl::soap_headerAttribute	size(8):
	+---
 0	| value
 4	| required
 5	| in
 6	| out
  	| <alignment member> (size=1)
	+---

class __vc_attributes::atl::soap_namespaceAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::com_interface_entryAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::support_error_infoAttribute	size(4):
	+---
 0	| error_interface
	+---

class __vc_attributes::atl::aggregatesAttribute	size(4):
	+---
 0	| clsid
	+---

class __vc_attributes::atl::implements_categoryAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::requires_categoryAttribute	size(4):
	+---
 0	| value
	+---

class __vc_attributes::atl::rdxAttribute	size(12):
	+---
 0	| key
 4	| valuename
 8	| regtype
	+---

class __vc_attributes::atl::registration_scriptAttribute	size(4):
	+---
 0	| script
	+---

class __vc_attributes::atl::db_sourceAttribute	size(12):
	+---
 0	| source
 4	| name
 8	| hresult
	+---

class __vc_attributes::atl::db_commandAttribute	size(24):
	+---
 0	| command
 4	| name
 8	| source_name
12	| hresult
16	| bindings
20	| bulk_fetch
	+---

class __vc_attributes::atl::db_tableAttribute	size(20):
	+---
 0	| table
 4	| name
 8	| source_name
12	| hresult
16	| bulk_fetch
	+---

class __vc_attributes::atl::db_accessorAttribute	size(8):
	+---
 0	| id
 4	| auto_
  	| <alignment member> (size=3)
	+---

class __vc_attributes::atl::db_columnAttribute	size(24):
	+---
 0	| ordinal
 4	| dbtype
 8	| precision
12	| scale
16	| status
20	| length
	+---

class __vc_attributes::atl::db_paramAttribute	size(28):
	+---
 0	| ordinal
 4	| paramtype
 8	| dbtype
12	| precision
16	| scale
20	| status
24	| length
	+---

class __vc_attributes::atl::tag_nameAttribute	size(8):
	+---
 0	| name
 4	| parse_func
	+---

class __vc_attributes::atl::request_handlerAttribute	size(8):
	+---
 0	| name
 4	| sdl
	+---

class __vc_attributes::atl::perfmonAttribute	size(8):
	+---
 0	| name
 4	| register
  	| <alignment member> (size=3)
	+---

class __vc_attributes::atl::perf_objectAttribute	size(32):
	+---
 0	| name_res
 4	| help_res
 8	| namestring
12	| helpstring
16	| detail
20	| no_instances
  	| <alignment member> (size=3)
24	| class_
28	| maxinstnamelen
	+---

class __vc_attributes::atl::perf_counterAttribute	size(40):
	+---
 0	| namestring
 4	| helpstring
 8	| name_res
12	| help_res
16	| countertype
20	| defscale
24	| default_counter
  	| <alignment member> (size=3)
28	| detail
32	| max_counter_size
36	| countertype_string
	+---

class __crt_locale_data_public	size(12):
	+---
 0	| _locale_pctype
 4	| _locale_mb_cur_max
 8	| _locale_lc_codepage
	+---

class __crt_locale_pointers	size(8):
	+---
 0	| locinfo
 4	| mbcinfo
	+---

class _Mbstatet	size(8):
	+---
 0	| _Wchar
 4	| _Byte
 6	| _State
	+---

class lconv	size(80):
	+---
 0	| decimal_point
 4	| thousands_sep
 8	| grouping
12	| int_curr_symbol
16	| currency_symbol
20	| mon_decimal_point
24	| mon_thousands_sep
28	| mon_grouping
32	| positive_sign
36	| negative_sign
40	| int_frac_digits
41	| frac_digits
42	| p_cs_precedes
43	| p_sep_by_space
44	| n_cs_precedes
45	| n_sep_by_space
46	| p_sign_posn
47	| n_sign_posn
48	| _W_decimal_point
52	| _W_thousands_sep
56	| _W_int_curr_symbol
60	| _W_currency_symbol
64	| _W_mon_decimal_point
68	| _W_mon_thousands_sep
72	| _W_positive_sign
76	| _W_negative_sign
	+---

class _diskfree_t	size(16):
	+---
 0	| total_clusters
 4	| avail_clusters
 8	| sectors_per_cluster
12	| bytes_per_sector
	+---

class std::nothrow_t	size(1):
	+---
	+---

class _CrtMemState	size(52):
	+---
 0	| pBlockHeader
 4	| lCounts
24	| lSizes
44	| lHighWaterCount
48	| lTotalCount
	+---

class std::_Lockit	size(4):
	+---
 0	| _Locktype
	+---

class std::_Init_locks	size(1):
	+---
	+---

class _div_t	size(8):
	+---
 0	| quot
 4	| rem
	+---

class _ldiv_t	size(8):
	+---
 0	| quot
 4	| rem
	+---

class _lldiv_t	size(16):
	+---
 0	| quot
 8	| rem
	+---

class <anonymous-tag>	size(10):
	+---
 0	| ld
	+---

class <anonymous-tag>	size(8):
	+---
 0	| x
	+---

class <anonymous-tag>	size(4):
	+---
 0	| f
	+---

class <anonymous-tag>	size(8):
	+---
 0	| x
	+---

class <anonymous-tag>	size(12):
	+---
 0	| ld12
	+---

class _exception	size(32):
	+---
 0	| type
 4	| name
 8	| arg1
16	| arg2
24	| retval
	+---

class _complex	size(16):
	+---
 0	| x
 8	| y
	+---

class <anonymous-tag>	size(8):
	+---
 0	| _Sh
 0	| _Val
	+---

class <anonymous-tag>	size(4):
	+---
 0	| _Sh
 0	| _Val
	+---

class <anonymous-tag>	size(8):
	+---
 0	| _Sh
 0	| _Val
	+---

class <anonymous-tag>	size(8):
	+---
 0	| _Word
 0	| _Float
 0	| _Double
 0	| _Long_double
	+---

class _Combined_type<float,double>	size(1):
	+---
	+---

class _Combined_type<float,long double>	size(1):
	+---
	+---

class _Real_widened<float,float>	size(1):
	+---
	+---

class _Real_widened<float,double>	size(1):
	+---
	+---

class _Real_widened<double,float>	size(1):
	+---
	+---

class _Real_widened<double,double>	size(1):
	+---
	+---

class _Real_type<float>	size(1):
	+---
	+---

class _Real_type<long double>	size(1):
	+---
	+---

class <anonymous-tag>	size(16):
	+---
 0	| _Word
 0	| _Float
 0	| _Double
 0	| _Long_double
	+---

class std::integral_constant<bool,0>	size(1):
	+---
	+---

class std::integral_constant<bool,	size(1):
	+---
	+---

class std::_Is_integral<bool>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<signed char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<wchar_t>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<char16_t>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<char32_t>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<unsigned short>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<short>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<unsigned int>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<int>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<unsigned long>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<long>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<unsigned __int64>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_integral<__int64>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_floating_point<float>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_floating_point<double>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_floating_point<long double>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class __vcrt_va_list_is_reference<struct __crt_locale_pointers * const>	size(1):
	+---
	+---

class __vcrt_assert_va_start_is_not_reference<struct __crt_locale_pointers * const>	size(1):
	+---
	+---

class __vcrt_va_list_is_reference<wchar_t const * const>	size(1):
	+---
	+---

class __vcrt_assert_va_start_is_not_reference<wchar_t const * const>	size(1):
	+---
	+---

class _wfinddata32_t	size(540):
	+---
 0	| attrib
 4	| time_create
 8	| time_access
12	| time_write
16	| size
20	| name
	+---

class _wfinddata32i64_t	size(544):
	+---
 0	| attrib
 4	| time_create
 8	| time_access
12	| time_write
16	| size
24	| name
	+---

class _wfinddata64i32_t	size(560):
	+---
 0	| attrib
  	| <alignment member> (size=4)
 8	| time_create
16	| time_access
24	| time_write
32	| size
36	| name
  	| <alignment member> (size=4)
	+---

class _wfinddata64_t	size(560):
	+---
 0	| attrib
  	| <alignment member> (size=4)
 8	| time_create
16	| time_access
24	| time_write
32	| size
40	| name
	+---

class _iobuf	size(4):
	+---
 0	| _Placeholder
	+---

class __vcrt_va_list_is_reference<wchar_t const *>	size(1):
	+---
	+---

class __vcrt_assert_va_start_is_not_reference<wchar_t const *>	size(1):
	+---
	+---

class __vcrt_va_list_is_reference<struct __crt_locale_pointers *>	size(1):
	+---
	+---

class __vcrt_assert_va_start_is_not_reference<struct __crt_locale_pointers *>	size(1):
	+---
	+---

class tm	size(36):
	+---
 0	| tm_sec
 4	| tm_min
 8	| tm_hour
12	| tm_mday
16	| tm_mon
20	| tm_year
24	| tm_wday
28	| tm_yday
32	| tm_isdst
	+---

class _stat32	size(36):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
20	| st_size
24	| st_atime
28	| st_mtime
32	| st_ctime
	+---

class _stat32i64	size(48):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
  	| <alignment member> (size=4)
24	| st_size
32	| st_atime
36	| st_mtime
40	| st_ctime
  	| <alignment member> (size=4)
	+---

class _stat64i32	size(48):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
20	| st_size
24	| st_atime
32	| st_mtime
40	| st_ctime
	+---

class _stat64	size(56):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
  	| <alignment member> (size=4)
24	| st_size
32	| st_atime
40	| st_mtime
48	| st_ctime
	+---

class stat	size(48):
	+---
 0	| st_dev
 4	| st_ino
 6	| st_mode
 8	| st_nlink
10	| st_uid
12	| st_gid
  	| <alignment member> (size=2)
16	| st_rdev
20	| st_size
24	| st_atime
32	| st_mtime
40	| st_ctime
	+---

class std::plus<void>	size(1):
	+---
	+---

class std::minus<void>	size(1):
	+---
	+---

class std::multiplies<void>	size(1):
	+---
	+---

class std::equal_to<void>	size(1):
	+---
	+---

class std::not_equal_to<void>	size(1):
	+---
	+---

class std::greater<void>	size(1):
	+---
	+---

class std::less<void>	size(1):
	+---
	+---

class std::greater_equal<void>	size(1):
	+---
	+---

class std::less_equal<void>	size(1):
	+---
	+---

class std::_Num_base	size(1):
	+---
	+---

class std::_Num_int_base	size(1):
	+---
 0	| +--- (base class std::_Num_base)
	| +---
	+---

class std::_Num_float_base	size(1):
	+---
 0	| +--- (base class std::_Num_base)
	| +---
	+---

class std::numeric_limits<char>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<wchar_t>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<bool>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<signed char>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned char>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<short>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned short>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<char16_t>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<int>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned int>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<long>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned long>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<char32_t>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<__int64>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<unsigned __int64>	size(1):
	+---
 0	| +--- (base class std::_Num_int_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<float>	size(1):
	+---
 0	| +--- (base class std::_Num_float_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<double>	size(1):
	+---
 0	| +--- (base class std::_Num_float_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::numeric_limits<long double>	size(1):
	+---
 0	| +--- (base class std::_Num_float_base)
 0	| | +--- (base class std::_Num_base)
	| | +---
	| +---
	+---

class std::is_void<void>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::is_void<void const >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::is_void<void volatile >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::is_void<void const volatile >	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::integral_constant<unsigned int,0>	size(1):
	+---
	+---

class std::_Maximum<>	size(1):
	+---
 0	| +--- (base class std::integral_constant<unsigned int,0>)
	| +---
	+---

class std::common_type<>	size(1):
	+---
	+---

class std::_Unforced	size(1):
	+---
	+---

class std::_Unique_tag_refwrap_has_ctor_from	size(1):
	+---
	+---

class std::hash<float>	size(1):
	+---
	+---

class std::hash<double>	size(1):
	+---
	+---

class std::hash<long double>	size(1):
	+---
	+---

class std::hash<std::nullptr_t>	size(1):
	+---
	+---

class std::_Invoker_pmf_object	size(1):
	+---
	+---

class std::_Invoker_pmf_refwrap	size(1):
	+---
	+---

class std::_Invoker_pmf_pointer	size(1):
	+---
	+---

class std::_Invoker_pmd_object	size(1):
	+---
	+---

class std::_Invoker_pmd_refwrap	size(1):
	+---
	+---

class std::_Invoker_pmd_pointer	size(1):
	+---
	+---

class std::_Invoker_functor	size(1):
	+---
	+---

class std::_Invoker_ret<struct std::_Unforced,0>	size(1):
	+---
	+---

class _heapinfo	size(12):
	+---
 0	| _pentry
 4	| _size
 8	| _useflag
	+---

class __std_exception_data	size(8):
	+---
 0	| _What
 4	| _DoFree
  	| <alignment member> (size=3)
	+---

class std::exception	size(12):
	+---
 0	| {vfptr}
 4	| __std_exception_data _Data
	+---

std::exception::$vftable@:
	| &exception_meta
	|  0
 0	| &std::exception::{dtor}
 1	| &std::exception::what

std::exception::{dtor} this adjustor: 0
std::exception::what this adjustor: 0
std::exception::__delDtor this adjustor: 0
std::exception::__vecDelDtor this adjustor: 0

class std::bad_exception	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::bad_exception::$vftable@:
	| &bad_exception_meta
	|  0
 0	| &std::bad_exception::{dtor}
 1	| &std::exception::what

std::bad_exception::{dtor} this adjustor: 0
std::bad_exception::__delDtor this adjustor: 0
std::bad_exception::__vecDelDtor this adjustor: 0

class std::bad_alloc	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::bad_alloc::$vftable@:
	| &bad_alloc_meta
	|  0
 0	| &std::bad_alloc::{dtor}
 1	| &std::exception::what

std::bad_alloc::{dtor} this adjustor: 0
std::bad_alloc::__delDtor this adjustor: 0
std::bad_alloc::__vecDelDtor this adjustor: 0

class std::bad_array_new_length	size(12):
	+---
 0	| +--- (base class std::bad_alloc)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::bad_array_new_length::$vftable@:
	| &bad_array_new_length_meta
	|  0
 0	| &std::bad_array_new_length::{dtor}
 1	| &std::exception::what

std::bad_array_new_length::{dtor} this adjustor: 0
std::bad_array_new_length::__delDtor this adjustor: 0
std::bad_array_new_length::__vecDelDtor this adjustor: 0

class std::exception_ptr	size(8):
	+---
 0	| _Data1
 4	| _Data2
	+---

class std::nested_exception	size(12):
	+---
 0	| {vfptr}
 4	| exception_ptr _Exc
	+---

std::nested_exception::$vftable@:
	| &nested_exception_meta
	|  0
 0	| &std::nested_exception::{dtor}

std::nested_exception::{dtor} this adjustor: 0
std::nested_exception::__delDtor this adjustor: 0
std::nested_exception::__vecDelDtor this adjustor: 0

class __vcrt_va_list_is_reference<char const * const>	size(1):
	+---
	+---

class __vcrt_assert_va_start_is_not_reference<char const * const>	size(1):
	+---
	+---

class std::_WChar_traits<char16_t>	size(1):
	+---
	+---

class std::char_traits<char16_t>	size(1):
	+---
 0	| +--- (base class std::_WChar_traits<char16_t>)
	| +---
	+---

class std::_Char_traits<char32_t,unsigned int>	size(1):
	+---
	+---

class std::char_traits<char32_t>	size(1):
	+---
 0	| +--- (base class std::_Char_traits<char32_t,unsigned int>)
	| +---
	+---

class std::_WChar_traits<wchar_t>	size(1):
	+---
	+---

class std::char_traits<wchar_t>	size(1):
	+---
 0	| +--- (base class std::_WChar_traits<wchar_t>)
	| +---
	+---

class std::_WChar_traits<unsigned short>	size(1):
	+---
	+---

class std::char_traits<unsigned short>	size(1):
	+---
 0	| +--- (base class std::_WChar_traits<unsigned short>)
	| +---
	+---

class std::char_traits<char>	size(1):
	+---
	+---

class std::piecewise_construct_t	size(1):
	+---
	+---

class std::integral_constant<unsigned int,2>	size(1):
	+---
	+---

class std::_Container_base0	size(1):
	+---
	+---

class std::_Iterator_base0	size(1):
	+---
	+---

class std::_Container_proxy	size(8):
	+---
 0	| _Mycont
 4	| _Myfirstiter
	+---

class std::_Container_base12	size(4):
	+---
 0	| _Myproxy
	+---

class std::_Iterator_base12	size(8):
	+---
 0	| _Myproxy
 4	| _Mynextiter
	+---

class std::_Zero_then_variadic_args_t	size(1):
	+---
	+---

class std::_One_then_variadic_args_t	size(1):
	+---
	+---

class std::input_iterator_tag	size(1):
	+---
	+---

class std::output_iterator_tag	size(1):
	+---
	+---

class std::forward_iterator_tag	size(1):
	+---
 0	| +--- (base class std::input_iterator_tag)
	| +---
	+---

class std::bidirectional_iterator_tag	size(1):
	+---
 0	| +--- (base class std::forward_iterator_tag)
 0	| | +--- (base class std::input_iterator_tag)
	| | +---
	| +---
	+---

class std::random_access_iterator_tag	size(1):
	+---
 0	| +--- (base class std::bidirectional_iterator_tag)
 0	| | +--- (base class std::forward_iterator_tag)
 0	| | | +--- (base class std::input_iterator_tag)
	| | | +---
	| | +---
	| +---
	+---

class std::_General_ptr_iterator_tag	size(1):
	+---
	+---

class std::_Trivially_copyable_ptr_iterator_tag	size(1):
	+---
 0	| +--- (base class std::_General_ptr_iterator_tag)
	| +---
	+---

class std::_Really_trivial_ptr_iterator_tag	size(1):
	+---
 0	| +--- (base class std::_Trivially_copyable_ptr_iterator_tag)
 0	| | +--- (base class std::_General_ptr_iterator_tag)
	| | +---
	| +---
	+---

class std::_Unused_parameter	size(1):
	+---
	+---

class std::_Distance_unknown	size(1):
	+---
	+---

class std::_Priority_tag<0>	size(1):
	+---
	+---

class std::_Is_character<char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_character<signed char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Is_character<unsigned char>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::allocator_arg_t	size(1):
	+---
	+---

class std::_Default_allocate_traits	size(1):
	+---
	+---

class std::allocator<void>	size(1):
	+---
	+---

class std::_Not_a_node_tag	size(1):
	+---
	+---

class std::_String_val<`template-type-parameter-1'>::_Bxty	size(0):
	+---
 0	| _Buf
 0	| _Ptr
 0	| _Alias
	+---

class std::logic_error	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::logic_error::$vftable@:
	| &logic_error_meta
	|  0
 0	| &std::logic_error::{dtor}
 1	| &std::exception::what

std::logic_error::{dtor} this adjustor: 0
std::logic_error::__delDtor this adjustor: 0
std::logic_error::__vecDelDtor this adjustor: 0

class std::allocator<char>	size(1):
	+---
	+---

class std::_Is_default_allocator<class std::allocator<char>,void>	size(1):
	+---
 0	| +--- (base class std::integral_constant<bool,)
	| +---
	+---

class std::_Default_allocator_traits<class std::allocator<char> >	size(1):
	+---
	+---

class std::allocator_traits<class std::allocator<char> >	size(1):
	+---
 0	| +--- (base class std::_Default_allocator_traits<class std::allocator<char> >)
	| +---
	+---

class std::_String_base_types<char,class std::allocator<char> >	size(1):
	+---
	+---

class std::_Simple_types<char>	size(1):
	+---
	+---

class std::_String_val<struct std::_Simple_types<char> >::_Bxty	size(16):
	+---
 0	| _Buf
 0	| _Ptr
 0	| _Alias
	+---

class std::_String_val<struct std::_Simple_types<char> >	size(24):
	+---
 0	| +--- (base class std::_Container_base0)
	| +---
 0	| _Bxty _Bx
16	| _Mysize
20	| _Myres
	+---

class std::_Compressed_pair<class std::allocator<char>,class std::_String_val<struct std::_Simple_types<char> >,	size(24):
	+---
 0	| +--- (base class std::allocator<char>)
	| +---
 0	| ?$_String_val@U?$_Simple_types@D@std@@ _Myval2
	+---

class std::_String_alloc<struct std::_String_base_types<char,class std::allocator<char> > >	size(24):
	+---
 0	| ?$_Compressed_pair@V?$allocator@D@std@@V?$_String_val@U?$_Simple_types@D@std@@@2@$00 _Mypair
	+---

class std::basic_string<char,struct std::char_traits<char>,class std::allocator<char> >	size(24):
	+---
 0	| +--- (base class std::_String_alloc<struct std::_String_base_types<char,class std::allocator<char> > >)
 0	| | ?$_Compressed_pair@V?$allocator@D@std@@V?$_String_val@U?$_Simple_types@D@std@@@2@$00 _Mypair
	| +---
	+---

class std::domain_error	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::domain_error::$vftable@:
	| &domain_error_meta
	|  0
 0	| &std::domain_error::{dtor}
 1	| &std::exception::what

std::domain_error::{dtor} this adjustor: 0
std::domain_error::__delDtor this adjustor: 0
std::domain_error::__vecDelDtor this adjustor: 0

class std::invalid_argument	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::invalid_argument::$vftable@:
	| &invalid_argument_meta
	|  0
 0	| &std::invalid_argument::{dtor}
 1	| &std::exception::what

std::invalid_argument::{dtor} this adjustor: 0
std::invalid_argument::__delDtor this adjustor: 0
std::invalid_argument::__vecDelDtor this adjustor: 0

class std::length_error	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::length_error::$vftable@:
	| &length_error_meta
	|  0
 0	| &std::length_error::{dtor}
 1	| &std::exception::what

std::length_error::{dtor} this adjustor: 0
std::length_error::__delDtor this adjustor: 0
std::length_error::__vecDelDtor this adjustor: 0

class std::out_of_range	size(12):
	+---
 0	| +--- (base class std::logic_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::out_of_range::$vftable@:
	| &out_of_range_meta
	|  0
 0	| &std::out_of_range::{dtor}
 1	| &std::exception::what

std::out_of_range::{dtor} this adjustor: 0
std::out_of_range::__delDtor this adjustor: 0
std::out_of_range::__vecDelDtor this adjustor: 0

class std::runtime_error	size(12):
	+---
 0	| +--- (base class std::exception)
 0	| | {vfptr}
 4	| | __std_exception_data _Data
	| +---
	+---

std::runtime_error::$vftable@:
	| &runtime_error_meta
	|  0
 0	| &std::runtime_error::{dtor}
 1	| &std::exception::what

std::runtime_error::{dtor} this adjustor: 0
std::runtime_error::__delDtor this adjustor: 0
std::runtime_error::__vecDelDtor this adjustor: 0

class std::overflow_error	size(12):
	+---
 0	| +--- (base class std::runtime_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::overflow_error::$vftable@:
	| &overflow_error_meta
	|  0
 0	| &std::overflow_error::{dtor}
 1	| &std::exception::what

std::overflow_error::{dtor} this adjustor: 0
std::overflow_error::__delDtor this adjustor: 0
std::overflow_error::__vecDelDtor this adjustor: 0

class std::underflow_error	size(12):
	+---
 0	| +--- (base class std::runtime_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::underflow_error::$vftable@:
	| &underflow_error_meta
	|  0
 0	| &std::underflow_error::{dtor}
 1	| &std::exception::what

std::underflow_error::{dtor} this adjustor: 0
std::underflow_error::__delDtor this adjustor: 0
std::underflow_error::__vecDelDtor this adjustor: 0

class std::range_error	size(12):
	+---
 0	| +--- (base class std::runtime_error)
 0	| | +--- (base class std::exception)
 0	| | | {vfptr}
 4	| | | __std_exception_data _Data
	| | +---
	| +---
	+---

std::range_error::$vftable@:
	| &range_error_meta
	|  0
 0	| &std::range_error::{dtor}
 1	| &std::exception::what

std::range_error::{dtor} this adjustor: 0
std::range_error::__delDtor this adjustor: 0
std::range_error::__vecDelDtor this adjustor: 0

class std::_Ignore	size(1):
	+---
	+---

class std::_Exact_args_t	size(1):
	+---
	+---

class std::_Unpack_tuple_t	size(1):
	+---
	+---

class std::_Alloc_exact_args_t	size(1):
	+---
	+---

class std::_Alloc_unpack_tuple_t	size(1):
	+---
	+---

class std::tuple<>	size(1):
	+---
	+---

class std::_Umap_traits<`template-type-parameter-1',`template-type-parameter-2',`template-type-parameter-3',`template-type-parameter-4',bool, ?? >::value_compare	size(0):
	+---
 0	| _Keycompobj
	+---

class std::_Rand_urng_from_func	size(1):
	+---
	+---

class _PROCESSOR_NUMBER	size(4):
	+---
 0	| Group
 2	| Number
 3	| Reserved
	+---

class _GROUP_AFFINITY	size(12):
	+---
 0	| Mask
 4	| Group
 6	| Reserved
	+---

class _FLOAT128	size(16):
	+---
 0	| LowPart
 8	| HighPart
	+---

class _LARGE_INTEGER::<anonymous-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _LARGE_INTEGER::<anonymous-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _LARGE_INTEGER	size(8):
	+---
 0	| LowPart
 4	| HighPart
 0	| <unnamed-type-u> u
 0	| QuadPart
	+---

class _ULARGE_INTEGER::<anonymous-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _ULARGE_INTEGER::<anonymous-tag>	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _ULARGE_INTEGER	size(8):
	+---
 0	| LowPart
 4	| HighPart
 0	| <unnamed-type-u> u
 0	| QuadPart
	+---

class _LUID	size(8):
	+---
 0	| LowPart
 4	| HighPart
	+---

class _LIST_ENTRY	size(8):
	+---
 0	| Flink
 4	| Blink
	+---

class _SINGLE_LIST_ENTRY	size(4):
	+---
 0	| Next
	+---

class LIST_ENTRY32	size(8):
	+---
 0	| Flink
 4	| Blink
	+---

class LIST_ENTRY64	size(16):
	+---
 0	| Flink
 8	| Blink
	+---

class _GUID	size(16):
	+---
 0	| Data1
 4	| Data2
 6	| Data3
 8	| Data4
	+---

class _OBJECTID	size(20):
	+---
 0	| _GUID Lineage
16	| Uniquifier
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<	size(1):
	+---
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<2>	size(1):
	+---
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<4>	size(1):
	+---
	+---

class _ENUM_FLAG_INTEGER_FOR_SIZE<8>	size(1):
	+---
	+---

class _M128A	size(16):
	+---
 0	| Low
 8	| High
	+---

class _XSAVE_FORMAT	size(512):
	+---
 0	| ControlWord
 2	| StatusWord
 4	| TagWord
 5	| Reserved1
 6	| ErrorOpcode
 8	| ErrorOffset
12	| ErrorSelector
14	| Reserved2
16	| DataOffset
20	| DataSelector
22	| Reserved3
24	| MxCsr
28	| MxCsr_Mask
32	| FloatRegisters
160	| XmmRegisters
288	| Reserved4
	+---

class _XSAVE_CET_U_FORMAT	size(16):
	+---
 0	| Ia32CetUMsr
 8	| Ia32Pl3SspMsr
	+---

class _XSAVE_AREA_HEADER	size(64):
	+---
 0	| Mask
 8	| CompactionMask
16	| Reserved2
	+---

class _XSAVE_AREA	size(576):
	+---
 0	| _XSAVE_FORMAT LegacyState
512	| _XSAVE_AREA_HEADER Header
	+---

class _XSTATE_CONTEXT	size(32):
	+---
 0	| Mask
 8	| Length
12	| Reserved1
16	| Area
20	| Reserved2
24	| Buffer
28	| Reserved3
	+---

class _SCOPE_TABLE_AMD64::<anonymous-tag>	size(16):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| HandlerAddress
12	| JumpTarget
	+---

class _SCOPE_TABLE_AMD64	size(20):
	+---
 0	| Count
 4	| ScopeRecord
	+---

class _SCOPE_TABLE_ARM::<anonymous-tag>	size(16):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| HandlerAddress
12	| JumpTarget
	+---

class _SCOPE_TABLE_ARM	size(20):
	+---
 0	| Count
 4	| ScopeRecord
	+---

class _SCOPE_TABLE_ARM64::<anonymous-tag>	size(16):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| HandlerAddress
12	| JumpTarget
	+---

class _SCOPE_TABLE_ARM64	size(20):
	+---
 0	| Count
 4	| ScopeRecord
	+---

class _KNONVOLATILE_CONTEXT_POINTERS_ARM64	size(80):
	+---
 0	| X19
 4	| X20
 8	| X21
12	| X22
16	| X23
20	| X24
24	| X25
28	| X26
32	| X27
36	| X28
40	| Fp
44	| Lr
48	| D8
52	| D9
56	| D10
60	| D11
64	| D12
68	| D13
72	| D14
76	| D15
	+---

class _FLOATING_SAVE_AREA	size(112):
	+---
 0	| ControlWord
 4	| StatusWord
 8	| TagWord
12	| ErrorOffset
16	| ErrorSelector
20	| DataOffset
24	| DataSelector
28	| RegisterArea
108	| Spare0
	+---

class _CONTEXT	size(716):
	+---
 0	| ContextFlags
 4	| Dr0
 8	| Dr1
12	| Dr2
16	| Dr3
20	| Dr6
24	| Dr7
28	| _FLOATING_SAVE_AREA FloatSave
140	| SegGs
144	| SegFs
148	| SegEs
152	| SegDs
156	| Edi
160	| Esi
164	| Ebx
168	| Edx
172	| Ecx
176	| Eax
180	| Ebp
184	| Eip
188	| SegCs
192	| EFlags
196	| Esp
200	| SegSs
204	| ExtendedRegisters
	+---

class _LDT_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| BaseMid
 1	| Flags1
 2	| Flags2
 3	| BaseHi
	+---

class _LDT_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| BaseMid (bitstart=0,nbits=8)
 0.	| Type (bitstart=8,nbits=5)
 0.	| Dpl (bitstart=13,nbits=2)
 0.	| Pres (bitstart=15,nbits=1)
 0.	| LimitHi (bitstart=16,nbits=4)
 0.	| Sys (bitstart=20,nbits=1)
 0.	| Reserved_0 (bitstart=21,nbits=1)
 0.	| Default_Big (bitstart=22,nbits=1)
 0.	| Granularity (bitstart=23,nbits=1)
 0.	| BaseHi (bitstart=24,nbits=8)
	+---

class _LDT_ENTRY::<anonymous-tag>	size(4):
	+---
 0	| <unnamed-type-Bytes> Bytes
 0	| <unnamed-type-Bits> Bits
	+---

class _LDT_ENTRY	size(8):
	+---
 0	| LimitLow
 2	| BaseLow
 4	| <unnamed-type-HighWord> HighWord
	+---

class _WOW64_FLOATING_SAVE_AREA	size(112):
	+---
 0	| ControlWord
 4	| StatusWord
 8	| TagWord
12	| ErrorOffset
16	| ErrorSelector
20	| DataOffset
24	| DataSelector
28	| RegisterArea
108	| Cr0NpxState
	+---

class _WOW64_CONTEXT	size(716):
	+---
 0	| ContextFlags
 4	| Dr0
 8	| Dr1
12	| Dr2
16	| Dr3
20	| Dr6
24	| Dr7
28	| _WOW64_FLOATING_SAVE_AREA FloatSave
140	| SegGs
144	| SegFs
148	| SegEs
152	| SegDs
156	| Edi
160	| Esi
164	| Ebx
168	| Edx
172	| Ecx
176	| Eax
180	| Ebp
184	| Eip
188	| SegCs
192	| EFlags
196	| Esp
200	| SegSs
204	| ExtendedRegisters
	+---

class _WOW64_LDT_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| BaseMid
 1	| Flags1
 2	| Flags2
 3	| BaseHi
	+---

class _WOW64_LDT_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| BaseMid (bitstart=0,nbits=8)
 0.	| Type (bitstart=8,nbits=5)
 0.	| Dpl (bitstart=13,nbits=2)
 0.	| Pres (bitstart=15,nbits=1)
 0.	| LimitHi (bitstart=16,nbits=4)
 0.	| Sys (bitstart=20,nbits=1)
 0.	| Reserved_0 (bitstart=21,nbits=1)
 0.	| Default_Big (bitstart=22,nbits=1)
 0.	| Granularity (bitstart=23,nbits=1)
 0.	| BaseHi (bitstart=24,nbits=8)
	+---

class _WOW64_LDT_ENTRY::<anonymous-tag>	size(4):
	+---
 0	| <unnamed-type-Bytes> Bytes
 0	| <unnamed-type-Bits> Bits
	+---

class _WOW64_LDT_ENTRY	size(8):
	+---
 0	| LimitLow
 2	| BaseLow
 4	| <unnamed-type-HighWord> HighWord
	+---

class _WOW64_DESCRIPTOR_TABLE_ENTRY	size(12):
	+---
 0	| Selector
 4	| _WOW64_LDT_ENTRY Descriptor
	+---

class _EXCEPTION_RECORD	size(80):
	+---
 0	| ExceptionCode
 4	| ExceptionFlags
 8	| ExceptionRecord
12	| ExceptionAddress
16	| NumberParameters
20	| ExceptionInformation
	+---

class _EXCEPTION_RECORD32	size(80):
	+---
 0	| ExceptionCode
 4	| ExceptionFlags
 8	| ExceptionRecord
12	| ExceptionAddress
16	| NumberParameters
20	| ExceptionInformation
	+---

class _EXCEPTION_RECORD64	size(152):
	+---
 0	| ExceptionCode
 4	| ExceptionFlags
 8	| ExceptionRecord
16	| ExceptionAddress
24	| NumberParameters
28	| __unusedAlignment
32	| ExceptionInformation
	+---

class _EXCEPTION_POINTERS	size(8):
	+---
 0	| ExceptionRecord
 4	| ContextRecord
	+---

class _GENERIC_MAPPING	size(16):
	+---
 0	| GenericRead
 4	| GenericWrite
 8	| GenericExecute
12	| GenericAll
	+---

class _LUID_AND_ATTRIBUTES	size(12):
	+---
 0	| _LUID Luid
 8	| Attributes
	+---

class _SID_IDENTIFIER_AUTHORITY	size(6):
	+---
 0	| Value
	+---

class _SID	size(12):
	+---
 0	| Revision
 1	| SubAuthorityCount
 2	| _SID_IDENTIFIER_AUTHORITY IdentifierAuthority
 8	| SubAuthority
	+---

class _SE_SID	size(68):
	+---
 0	| _SID Sid
 0	| Buffer
	+---

class _SID_AND_ATTRIBUTES	size(8):
	+---
 0	| Sid
 4	| Attributes
	+---

class _SID_AND_ATTRIBUTES_HASH	size(136):
	+---
 0	| SidCount
 4	| SidAttr
 8	| Hash
	+---

class _ACL	size(8):
	+---
 0	| AclRevision
 1	| Sbz1
 2	| AclSize
 4	| AceCount
 6	| Sbz2
	+---

class _ACE_HEADER	size(4):
	+---
 0	| AceType
 1	| AceFlags
 2	| AceSize
	+---

class _ACCESS_ALLOWED_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_DENIED_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_AUDIT_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_ALARM_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_RESOURCE_ATTRIBUTE_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_SCOPED_POLICY_ID_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_MANDATORY_LABEL_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_PROCESS_TRUST_LABEL_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_ACCESS_FILTER_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_ALLOWED_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACCESS_DENIED_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_AUDIT_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_ALARM_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACCESS_ALLOWED_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_DENIED_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_AUDIT_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _SYSTEM_ALARM_CALLBACK_ACE	size(12):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| SidStart
	+---

class _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACCESS_DENIED_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _SYSTEM_ALARM_CALLBACK_OBJECT_ACE	size(48):
	+---
 0	| _ACE_HEADER Header
 4	| Mask
 8	| Flags
12	| _GUID ObjectType
28	| _GUID InheritedObjectType
44	| SidStart
	+---

class _ACL_REVISION_INFORMATION	size(4):
	+---
 0	| AclRevision
	+---

class _ACL_SIZE_INFORMATION	size(12):
	+---
 0	| AceCount
 4	| AclBytesInUse
 8	| AclBytesFree
	+---

class _SECURITY_DESCRIPTOR_RELATIVE	size(20):
	+---
 0	| Revision
 1	| Sbz1
 2	| Control
 4	| Owner
 8	| Group
12	| Sacl
16	| Dacl
	+---

class _SECURITY_DESCRIPTOR	size(20):
	+---
 0	| Revision
 1	| Sbz1
 2	| Control
 4	| Owner
 8	| Group
12	| Sacl
16	| Dacl
	+---

class _SECURITY_OBJECT_AI_PARAMS	size(8):
	+---
 0	| Size
 4	| ConstraintMask
	+---

class _OBJECT_TYPE_LIST	size(8):
	+---
 0	| Level
 2	| Sbz
 4	| ObjectType
	+---

class _PRIVILEGE_SET	size(20):
	+---
 0	| PrivilegeCount
 4	| Control
 8	| Privilege
	+---

class _ACCESS_REASONS	size(128):
	+---
 0	| Data
	+---

class _SE_SECURITY_DESCRIPTOR	size(12):
	+---
 0	| Size
 4	| Flags
 8	| SecurityDescriptor
	+---

class _SE_ACCESS_REQUEST	size(32):
	+---
 0	| Size
 4	| SeSecurityDescriptor
 8	| DesiredAccess
12	| PreviouslyGrantedAccess
16	| PrincipalSelfSid
20	| GenericMapping
24	| ObjectTypeListCount
28	| ObjectTypeList
	+---

class _SE_ACCESS_REPLY	size(24):
	+---
 0	| Size
 4	| ResultListCount
 8	| GrantedAccess
12	| AccessStatus
16	| AccessReason
20	| Privileges
	+---

class _TOKEN_USER	size(8):
	+---
 0	| _SID_AND_ATTRIBUTES User
	+---

class _SE_TOKEN_USER::<anonymous-tag>	size(8):
	+---
 0	| _TOKEN_USER TokenUser
 0	| _SID_AND_ATTRIBUTES User
	+---

class _SE_TOKEN_USER::<anonymous-tag>	size(68):
	+---
 0	| _SID Sid
 0	| Buffer
	+---

class _SE_TOKEN_USER	size(76):
	+---
 0	| _TOKEN_USER TokenUser
 0	| _SID_AND_ATTRIBUTES User
  	| <anonymous-tag> <alignment member> (size=8)
 8	| _SID Sid
 8	| Buffer
	+---

class _TOKEN_GROUPS	size(12):
	+---
 0	| GroupCount
 4	| Groups
	+---

class _TOKEN_PRIVILEGES	size(16):
	+---
 0	| PrivilegeCount
 4	| Privileges
	+---

class _TOKEN_OWNER	size(4):
	+---
 0	| Owner
	+---

class _TOKEN_PRIMARY_GROUP	size(4):
	+---
 0	| PrimaryGroup
	+---

class _TOKEN_DEFAULT_DACL	size(4):
	+---
 0	| DefaultDacl
	+---

class _TOKEN_USER_CLAIMS	size(4):
	+---
 0	| UserClaims
	+---

class _TOKEN_DEVICE_CLAIMS	size(4):
	+---
 0	| DeviceClaims
	+---

class _TOKEN_GROUPS_AND_PRIVILEGES	size(44):
	+---
 0	| SidCount
 4	| SidLength
 8	| Sids
12	| RestrictedSidCount
16	| RestrictedSidLength
20	| RestrictedSids
24	| PrivilegeCount
28	| PrivilegeLength
32	| Privileges
36	| _LUID AuthenticationId
	+---

class _TOKEN_LINKED_TOKEN	size(4):
	+---
 0	| LinkedToken
	+---

class _TOKEN_ELEVATION	size(4):
	+---
 0	| TokenIsElevated
	+---

class _TOKEN_MANDATORY_LABEL	size(8):
	+---
 0	| _SID_AND_ATTRIBUTES Label
	+---

class _TOKEN_MANDATORY_POLICY	size(4):
	+---
 0	| Policy
	+---

class _TOKEN_ACCESS_INFORMATION	size(56):
	+---
 0	| SidHash
 4	| RestrictedSidHash
 8	| Privileges
12	| _LUID AuthenticationId
20	| _TOKEN_TYPE TokenType
24	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
28	| _TOKEN_MANDATORY_POLICY MandatoryPolicy
32	| Flags
36	| AppContainerNumber
40	| PackageSid
44	| CapabilitiesHash
48	| TrustLevelSid
52	| SecurityAttributes
	+---

class _TOKEN_AUDIT_POLICY	size(30):
	+---
 0	| PerUserPolicy
	+---

class _TOKEN_SOURCE	size(16):
	+---
 0	| SourceName
 8	| _LUID SourceIdentifier
	+---

class _TOKEN_STATISTICS	size(56):
	+---
 0	| _LUID TokenId
 8	| _LUID AuthenticationId
16	| _LARGE_INTEGER ExpirationTime
24	| _TOKEN_TYPE TokenType
28	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
32	| DynamicCharged
36	| DynamicAvailable
40	| GroupCount
44	| PrivilegeCount
48	| _LUID ModifiedId
	+---

class _TOKEN_CONTROL	size(40):
	+---
 0	| _LUID TokenId
 8	| _LUID AuthenticationId
16	| _LUID ModifiedId
24	| _TOKEN_SOURCE TokenSource
	+---

class _TOKEN_ORIGIN	size(8):
	+---
 0	| _LUID OriginatingLogonSession
	+---

class _TOKEN_APPCONTAINER_INFORMATION	size(4):
	+---
 0	| TokenAppContainer
	+---

class _TOKEN_SID_INFORMATION	size(4):
	+---
 0	| Sid
	+---

class _TOKEN_BNO_ISOLATION_INFORMATION	size(8):
	+---
 0	| IsolationPrefix
 4	| IsolationEnabled
  	| <alignment member> (size=3)
	+---

class _CLAIM_SECURITY_ATTRIBUTE_FQBN_VALUE	size(16):
	+---
 0	| Version
 8	| Name
  	| <alignment member> (size=4)
	+---

class _CLAIM_SECURITY_ATTRIBUTE_OCTET_STRING_VALUE	size(8):
	+---
 0	| pValue
 4	| ValueLength
	+---

class _CLAIM_SECURITY_ATTRIBUTE_V1::<anonymous-tag>	size(4):
	+---
 0	| pInt64
 0	| pUint64
 0	| ppString
 0	| pFqbn
 0	| pOctetString
	+---

class _CLAIM_SECURITY_ATTRIBUTE_V1	size(20):
	+---
 0	| Name
 4	| ValueType
 6	| Reserved
 8	| Flags
12	| ValueCount
16	| <unnamed-type-Values> Values
	+---

class _CLAIM_SECURITY_ATTRIBUTE_RELATIVE_V1::<anonymous-tag>	size(4):
	+---
 0	| pInt64
 0	| pUint64
 0	| ppString
 0	| pFqbn
 0	| pOctetString
	+---

class _CLAIM_SECURITY_ATTRIBUTE_RELATIVE_V1	size(20):
	+---
 0	| Name
 4	| ValueType
 6	| Reserved
 8	| Flags
12	| ValueCount
16	| <unnamed-type-Values> Values
	+---

class _CLAIM_SECURITY_ATTRIBUTES_INFORMATION::<anonymous-tag>	size(4):
	+---
 0	| pAttributeV1
	+---

class _CLAIM_SECURITY_ATTRIBUTES_INFORMATION	size(12):
	+---
 0	| Version
 2	| Reserved
 4	| AttributeCount
 8	| <unnamed-type-Attribute> Attribute
	+---

class _SECURITY_QUALITY_OF_SERVICE	size(12):
	+---
 0	| Length
 4	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
 8	| ContextTrackingMode
 9	| EffectiveOnly
  	| <alignment member> (size=2)
	+---

class _SE_IMPERSONATION_STATE	size(12):
	+---
 0	| Token
 4	| CopyOnOpen
 5	| EffectiveOnly
  	| <alignment member> (size=2)
 8	| _SECURITY_IMPERSONATION_LEVEL Level
	+---

class _SECURITY_CAPABILITIES	size(16):
	+---
 0	| AppContainerSid
 4	| Capabilities
 8	| CapabilityCount
12	| Reserved
	+---

class _JOB_SET_ARRAY	size(12):
	+---
 0	| JobHandle
 4	| MemberLevel
 8	| Flags
	+---

class _EXCEPTION_REGISTRATION_RECORD	size(8):
	+---
 0	| Next
 4	| Handler
	+---

class _NT_TIB::<anonymous-tag>	size(4):
	+---
 0	| FiberData
 0	| Version
	+---

class _NT_TIB	size(28):
	+---
 0	| ExceptionList
 4	| StackBase
 8	| StackLimit
12	| SubSystemTib
  	| <anonymous-tag> <alignment member> (size=16)
16	| FiberData
16	| Version
20	| ArbitraryUserPointer
24	| Self
	+---

class _NT_TIB32::<anonymous-tag>	size(4):
	+---
 0	| FiberData
 0	| Version
	+---

class _NT_TIB32	size(28):
	+---
 0	| ExceptionList
 4	| StackBase
 8	| StackLimit
12	| SubSystemTib
  	| <anonymous-tag> <alignment member> (size=16)
16	| FiberData
16	| Version
20	| ArbitraryUserPointer
24	| Self
	+---

class _NT_TIB64::<anonymous-tag>	size(8):
	+---
 0	| FiberData
 0	| Version
	+---

class _NT_TIB64	size(56):
	+---
 0	| ExceptionList
 8	| StackBase
16	| StackLimit
24	| SubSystemTib
  	| <anonymous-tag> <alignment member> (size=32)
32	| FiberData
32	| Version
40	| ArbitraryUserPointer
48	| Self
	+---

class _UMS_CREATE_THREAD_ATTRIBUTES	size(12):
	+---
 0	| UmsVersion
 4	| UmsContext
 8	| UmsCompletionList
	+---

class _WOW64_ARCHITECTURE_INFORMATION	size(4):
	+---
 0.	| Machine (bitstart=0,nbits=16)
 0.	| KernelMode (bitstart=16,nbits=1)
 0.	| UserMode (bitstart=17,nbits=1)
 0.	| Native (bitstart=18,nbits=1)
 0.	| Process (bitstart=19,nbits=1)
 0.	| ReservedZero0 (bitstart=20,nbits=12)
	+---

class _QUOTA_LIMITS	size(32):
	+---
 0	| PagedPoolLimit
 4	| NonPagedPoolLimit
 8	| MinimumWorkingSetSize
12	| MaximumWorkingSetSize
16	| PagefileLimit
  	| <alignment member> (size=4)
24	| _LARGE_INTEGER TimeLimit
	+---

class _RATE_QUOTA_LIMIT::<anonymous-tag>	size(4):
	+---
 0.	| RatePercent (bitstart=0,nbits=7)
 0.	| Reserved0 (bitstart=7,nbits=25)
	+---

class _RATE_QUOTA_LIMIT	size(4):
	+---
 0	| RateData
 0.	| RatePercent (bitstart=0,nbits=7)
 0.	| Reserved0 (bitstart=7,nbits=25)
	+---

class _QUOTA_LIMITS_EX	size(56):
	+---
 0	| PagedPoolLimit
 4	| NonPagedPoolLimit
 8	| MinimumWorkingSetSize
12	| MaximumWorkingSetSize
16	| PagefileLimit
  	| <alignment member> (size=4)
24	| _LARGE_INTEGER TimeLimit
32	| WorkingSetLimit
36	| Reserved2
40	| Reserved3
44	| Reserved4
48	| Flags
52	| _RATE_QUOTA_LIMIT CpuRateLimit
	+---

class _IO_COUNTERS	size(48):
	+---
 0	| ReadOperationCount
 8	| WriteOperationCount
16	| OtherOperationCount
24	| ReadTransferCount
32	| WriteTransferCount
40	| OtherTransferCount
	+---

class _PROCESS_MITIGATION_ASLR_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
 0.	| EnableHighEntropy (bitstart=2,nbits=1)
 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_ASLR_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
 0.	| EnableHighEntropy (bitstart=2,nbits=1)
 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_ASLR_POLICY	size(4):
	+---
 0	| Flags
 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
 0.	| EnableHighEntropy (bitstart=2,nbits=1)
 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_DEP_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| Enable (bitstart=0,nbits=1)
 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_DEP_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| Enable (bitstart=0,nbits=1)
 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_DEP_POLICY	size(8):
	+---
 0	| Flags
 0.	| Enable (bitstart=0,nbits=1)
 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
 4	| Permanent
  	| <alignment member> (size=3)
	+---

class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY	size(4):
	+---
 0	| Flags
 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
 0.	| AuditDisallowWin32kSystemCalls (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
 0.	| AuditDisallowWin32kSystemCalls (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY	size(4):
	+---
 0	| Flags
 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
 0.	| AuditDisallowWin32kSystemCalls (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY	size(4):
	+---
 0	| Flags
 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
 0.	| ReservedFlags (bitstart=1,nbits=31)
	+---

class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
 0.	| AllowThreadOptOut (bitstart=1,nbits=1)
 0.	| AllowRemoteDowngrade (bitstart=2,nbits=1)
 0.	| AuditProhibitDynamicCode (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
 0.	| AllowThreadOptOut (bitstart=1,nbits=1)
 0.	| AllowRemoteDowngrade (bitstart=2,nbits=1)
 0.	| AuditProhibitDynamicCode (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY	size(4):
	+---
 0	| Flags
 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
 0.	| AllowThreadOptOut (bitstart=1,nbits=1)
 0.	| AllowRemoteDowngrade (bitstart=2,nbits=1)
 0.	| AuditProhibitDynamicCode (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
 0.	| EnableExportSuppression (bitstart=1,nbits=1)
 0.	| StrictMode (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
 0.	| EnableExportSuppression (bitstart=1,nbits=1)
 0.	| StrictMode (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY	size(4):
	+---
 0	| Flags
 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
 0.	| EnableExportSuppression (bitstart=1,nbits=1)
 0.	| StrictMode (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
 0.	| StoreSignedOnly (bitstart=1,nbits=1)
 0.	| MitigationOptIn (bitstart=2,nbits=1)
 0.	| AuditMicrosoftSignedOnly (bitstart=3,nbits=1)
 0.	| AuditStoreSignedOnly (bitstart=4,nbits=1)
 0.	| ReservedFlags (bitstart=5,nbits=27)
	+---

class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
 0.	| StoreSignedOnly (bitstart=1,nbits=1)
 0.	| MitigationOptIn (bitstart=2,nbits=1)
 0.	| AuditMicrosoftSignedOnly (bitstart=3,nbits=1)
 0.	| AuditStoreSignedOnly (bitstart=4,nbits=1)
 0.	| ReservedFlags (bitstart=5,nbits=27)
	+---

class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY	size(4):
	+---
 0	| Flags
 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
 0.	| StoreSignedOnly (bitstart=1,nbits=1)
 0.	| MitigationOptIn (bitstart=2,nbits=1)
 0.	| AuditMicrosoftSignedOnly (bitstart=3,nbits=1)
 0.	| AuditStoreSignedOnly (bitstart=4,nbits=1)
 0.	| ReservedFlags (bitstart=5,nbits=27)
	+---

class _PROCESS_MITIGATION_FONT_DISABLE_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_FONT_DISABLE_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_FONT_DISABLE_POLICY	size(4):
	+---
 0	| Flags
 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
 0.	| ReservedFlags (bitstart=2,nbits=30)
	+---

class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| NoRemoteImages (bitstart=0,nbits=1)
 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
 0.	| PreferSystem32Images (bitstart=2,nbits=1)
 0.	| AuditNoRemoteImages (bitstart=3,nbits=1)
 0.	| AuditNoLowMandatoryLabelImages (bitstart=4,nbits=1)
 0.	| ReservedFlags (bitstart=5,nbits=27)
	+---

class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| NoRemoteImages (bitstart=0,nbits=1)
 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
 0.	| PreferSystem32Images (bitstart=2,nbits=1)
 0.	| AuditNoRemoteImages (bitstart=3,nbits=1)
 0.	| AuditNoLowMandatoryLabelImages (bitstart=4,nbits=1)
 0.	| ReservedFlags (bitstart=5,nbits=27)
	+---

class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY	size(4):
	+---
 0	| Flags
 0.	| NoRemoteImages (bitstart=0,nbits=1)
 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
 0.	| PreferSystem32Images (bitstart=2,nbits=1)
 0.	| AuditNoRemoteImages (bitstart=3,nbits=1)
 0.	| AuditNoLowMandatoryLabelImages (bitstart=4,nbits=1)
 0.	| ReservedFlags (bitstart=5,nbits=27)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_FILTER_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| FilterId (bitstart=0,nbits=4)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_FILTER_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| FilterId (bitstart=0,nbits=4)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_SYSTEM_CALL_FILTER_POLICY	size(4):
	+---
 0	| Flags
 0.	| FilterId (bitstart=0,nbits=4)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_PAYLOAD_RESTRICTION_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| EnableExportAddressFilter (bitstart=0,nbits=1)
 0.	| AuditExportAddressFilter (bitstart=1,nbits=1)
 0.	| EnableExportAddressFilterPlus (bitstart=2,nbits=1)
 0.	| AuditExportAddressFilterPlus (bitstart=3,nbits=1)
 0.	| EnableImportAddressFilter (bitstart=4,nbits=1)
 0.	| AuditImportAddressFilter (bitstart=5,nbits=1)
 0.	| EnableRopStackPivot (bitstart=6,nbits=1)
 0.	| AuditRopStackPivot (bitstart=7,nbits=1)
 0.	| EnableRopCallerCheck (bitstart=8,nbits=1)
 0.	| AuditRopCallerCheck (bitstart=9,nbits=1)
 0.	| EnableRopSimExec (bitstart=10,nbits=1)
 0.	| AuditRopSimExec (bitstart=11,nbits=1)
 0.	| ReservedFlags (bitstart=12,nbits=20)
	+---

class _PROCESS_MITIGATION_PAYLOAD_RESTRICTION_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| EnableExportAddressFilter (bitstart=0,nbits=1)
 0.	| AuditExportAddressFilter (bitstart=1,nbits=1)
 0.	| EnableExportAddressFilterPlus (bitstart=2,nbits=1)
 0.	| AuditExportAddressFilterPlus (bitstart=3,nbits=1)
 0.	| EnableImportAddressFilter (bitstart=4,nbits=1)
 0.	| AuditImportAddressFilter (bitstart=5,nbits=1)
 0.	| EnableRopStackPivot (bitstart=6,nbits=1)
 0.	| AuditRopStackPivot (bitstart=7,nbits=1)
 0.	| EnableRopCallerCheck (bitstart=8,nbits=1)
 0.	| AuditRopCallerCheck (bitstart=9,nbits=1)
 0.	| EnableRopSimExec (bitstart=10,nbits=1)
 0.	| AuditRopSimExec (bitstart=11,nbits=1)
 0.	| ReservedFlags (bitstart=12,nbits=20)
	+---

class _PROCESS_MITIGATION_PAYLOAD_RESTRICTION_POLICY	size(4):
	+---
 0	| Flags
 0.	| EnableExportAddressFilter (bitstart=0,nbits=1)
 0.	| AuditExportAddressFilter (bitstart=1,nbits=1)
 0.	| EnableExportAddressFilterPlus (bitstart=2,nbits=1)
 0.	| AuditExportAddressFilterPlus (bitstart=3,nbits=1)
 0.	| EnableImportAddressFilter (bitstart=4,nbits=1)
 0.	| AuditImportAddressFilter (bitstart=5,nbits=1)
 0.	| EnableRopStackPivot (bitstart=6,nbits=1)
 0.	| AuditRopStackPivot (bitstart=7,nbits=1)
 0.	| EnableRopCallerCheck (bitstart=8,nbits=1)
 0.	| AuditRopCallerCheck (bitstart=9,nbits=1)
 0.	| EnableRopSimExec (bitstart=10,nbits=1)
 0.	| AuditRopSimExec (bitstart=11,nbits=1)
 0.	| ReservedFlags (bitstart=12,nbits=20)
	+---

class _PROCESS_MITIGATION_CHILD_PROCESS_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| NoChildProcessCreation (bitstart=0,nbits=1)
 0.	| AuditNoChildProcessCreation (bitstart=1,nbits=1)
 0.	| AllowSecureProcessCreation (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_CHILD_PROCESS_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| NoChildProcessCreation (bitstart=0,nbits=1)
 0.	| AuditNoChildProcessCreation (bitstart=1,nbits=1)
 0.	| AllowSecureProcessCreation (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_CHILD_PROCESS_POLICY	size(4):
	+---
 0	| Flags
 0.	| NoChildProcessCreation (bitstart=0,nbits=1)
 0.	| AuditNoChildProcessCreation (bitstart=1,nbits=1)
 0.	| AllowSecureProcessCreation (bitstart=2,nbits=1)
 0.	| ReservedFlags (bitstart=3,nbits=29)
	+---

class _PROCESS_MITIGATION_SIDE_CHANNEL_ISOLATION_POLICY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| SmtBranchTargetIsolation (bitstart=0,nbits=1)
 0.	| IsolateSecurityDomain (bitstart=1,nbits=1)
 0.	| DisablePageCombine (bitstart=2,nbits=1)
 0.	| SpeculativeStoreBypassDisable (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_SIDE_CHANNEL_ISOLATION_POLICY::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0.	| SmtBranchTargetIsolation (bitstart=0,nbits=1)
 0.	| IsolateSecurityDomain (bitstart=1,nbits=1)
 0.	| DisablePageCombine (bitstart=2,nbits=1)
 0.	| SpeculativeStoreBypassDisable (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _PROCESS_MITIGATION_SIDE_CHANNEL_ISOLATION_POLICY	size(4):
	+---
 0	| Flags
 0.	| SmtBranchTargetIsolation (bitstart=0,nbits=1)
 0.	| IsolateSecurityDomain (bitstart=1,nbits=1)
 0.	| DisablePageCombine (bitstart=2,nbits=1)
 0.	| SpeculativeStoreBypassDisable (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=28)
	+---

class _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION	size(48):
	+---
 0	| _LARGE_INTEGER TotalUserTime
 8	| _LARGE_INTEGER TotalKernelTime
16	| _LARGE_INTEGER ThisPeriodTotalUserTime
24	| _LARGE_INTEGER ThisPeriodTotalKernelTime
32	| TotalPageFaultCount
36	| TotalProcesses
40	| ActiveProcesses
44	| TotalTerminatedProcesses
	+---

class _JOBOBJECT_BASIC_LIMIT_INFORMATION	size(48):
	+---
 0	| _LARGE_INTEGER PerProcessUserTimeLimit
 8	| _LARGE_INTEGER PerJobUserTimeLimit
16	| LimitFlags
20	| MinimumWorkingSetSize
24	| MaximumWorkingSetSize
28	| ActiveProcessLimit
32	| Affinity
36	| PriorityClass
40	| SchedulingClass
  	| <alignment member> (size=4)
	+---

class _JOBOBJECT_EXTENDED_LIMIT_INFORMATION	size(112):
	+---
 0	| _JOBOBJECT_BASIC_LIMIT_INFORMATION BasicLimitInformation
48	| _IO_COUNTERS IoInfo
96	| ProcessMemoryLimit
100	| JobMemoryLimit
104	| PeakProcessMemoryUsed
108	| PeakJobMemoryUsed
	+---

class _JOBOBJECT_BASIC_PROCESS_ID_LIST	size(12):
	+---
 0	| NumberOfAssignedProcesses
 4	| NumberOfProcessIdsInList
 8	| ProcessIdList
	+---

class _JOBOBJECT_BASIC_UI_RESTRICTIONS	size(4):
	+---
 0	| UIRestrictionsClass
	+---

class _JOBOBJECT_SECURITY_LIMIT_INFORMATION	size(20):
	+---
 0	| SecurityLimitFlags
 4	| JobToken
 8	| SidsToDisable
12	| PrivilegesToDelete
16	| RestrictedSids
	+---

class _JOBOBJECT_END_OF_JOB_TIME_INFORMATION	size(4):
	+---
 0	| EndOfJobTimeAction
	+---

class _JOBOBJECT_ASSOCIATE_COMPLETION_PORT	size(8):
	+---
 0	| CompletionKey
 4	| CompletionPort
	+---

class _JOBOBJECT_BASIC_AND_IO_ACCOUNTING_INFORMATION	size(96):
	+---
 0	| _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION BasicInfo
48	| _IO_COUNTERS IoInfo
	+---

class _JOBOBJECT_JOBSET_INFORMATION	size(4):
	+---
 0	| MemberLevel
	+---

class _JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION	size(48):
	+---
 0	| IoReadBytesLimit
 8	| IoWriteBytesLimit
16	| _LARGE_INTEGER PerJobUserTimeLimit
24	| JobMemoryLimit
32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
40	| LimitFlags
  	| <alignment member> (size=4)
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<anonymous-tag>	size(8):
	+---
 0	| JobHighMemoryLimit
 0	| JobMemoryLimit
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<anonymous-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<anonymous-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL CpuRateControlToleranceInterval
	+---

class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2	size(72):
	+---
 0	| IoReadBytesLimit
 8	| IoWriteBytesLimit
16	| _LARGE_INTEGER PerJobUserTimeLimit
  	| <anonymous-tag> <alignment member> (size=24)
24	| JobHighMemoryLimit
24	| JobMemoryLimit
  	| <anonymous-tag> <alignment member> (size=32)
32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
  	| <anonymous-tag> <alignment member> (size=36)
36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL CpuRateControlToleranceInterval
40	| LimitFlags
44	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlTolerance
48	| JobLowMemoryLimit
56	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL IoRateControlToleranceInterval
60	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlTolerance
64	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL NetRateControlToleranceInterval
  	| <alignment member> (size=4)
	+---

class _JOBOBJECT_LIMIT_VIOLATION_INFORMATION	size(80):
	+---
 0	| LimitFlags
 4	| ViolationLimitFlags
 8	| IoReadBytes
16	| IoReadBytesLimit
24	| IoWriteBytes
32	| IoWriteBytesLimit
40	| _LARGE_INTEGER PerJobUserTime
48	| _LARGE_INTEGER PerJobUserTimeLimit
56	| JobMemory
64	| JobMemoryLimit
72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<anonymous-tag>	size(8):
	+---
 0	| JobHighMemoryLimit
 0	| JobMemoryLimit
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<anonymous-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<anonymous-tag>	size(4):
	+---
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlToleranceLimit
	+---

class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2	size(104):
	+---
 0	| LimitFlags
 4	| ViolationLimitFlags
 8	| IoReadBytes
16	| IoReadBytesLimit
24	| IoWriteBytes
32	| IoWriteBytesLimit
40	| _LARGE_INTEGER PerJobUserTime
48	| _LARGE_INTEGER PerJobUserTimeLimit
56	| JobMemory
  	| <anonymous-tag> <alignment member> (size=64)
64	| JobHighMemoryLimit
64	| JobMemoryLimit
  	| <anonymous-tag> <alignment member> (size=72)
72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
  	| <anonymous-tag> <alignment member> (size=76)
76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlToleranceLimit
80	| JobLowMemoryLimit
88	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlTolerance
92	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlToleranceLimit
96	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlTolerance
100	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlToleranceLimit
	+---

class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| MinRate
 2	| MaxRate
	+---

class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION::<anonymous-tag>	size(4):
	+---
 0	| CpuRate
 0	| Weight
 0	| MinRate
 2	| MaxRate
	+---

class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION	size(8):
	+---
 0	| ControlFlags
  	| <anonymous-tag> <alignment member> (size=4)
 4	| CpuRate
 4	| Weight
  	| <anonymous-tag> <alignment member> (size=4)
 4	| MinRate
 6	| MaxRate
  	| <anonymous-tag> <alignment member> (size=4)
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS>	size(1):
	+---
	+---

class JOBOBJECT_NET_RATE_CONTROL_INFORMATION	size(16):
	+---
 0	| MaxBandwidth
 8	| JOB_OBJECT_NET_RATE_CONTROL_FLAGS ControlFlags
12	| DscpTag
  	| <alignment member> (size=3)
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS>	size(1):
	+---
	+---

class JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE	size(40):
	+---
 0	| MaxIops
 8	| MaxBandwidth
16	| ReservationIops
24	| VolumeName
28	| BaseIoSize
32	| JOB_OBJECT_IO_RATE_CONTROL_FLAGS ControlFlags
36	| VolumeNameLength
  	| <alignment member> (size=2)
	+---

class JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE_V2	size(88):
	+---
 0	| MaxIops
 8	| MaxBandwidth
16	| ReservationIops
24	| VolumeName
28	| BaseIoSize
32	| JOB_OBJECT_IO_RATE_CONTROL_FLAGS ControlFlags
36	| VolumeNameLength
  	| <alignment member> (size=2)
40	| CriticalReservationIops
48	| ReservationBandwidth
56	| CriticalReservationBandwidth
64	| MaxTimePercent
72	| ReservationTimePercent
80	| CriticalReservationTimePercent
	+---

class JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE_V3	size(136):
	+---
 0	| MaxIops
 8	| MaxBandwidth
16	| ReservationIops
24	| VolumeName
28	| BaseIoSize
32	| JOB_OBJECT_IO_RATE_CONTROL_FLAGS ControlFlags
36	| VolumeNameLength
  	| <alignment member> (size=2)
40	| CriticalReservationIops
48	| ReservationBandwidth
56	| CriticalReservationBandwidth
64	| MaxTimePercent
72	| ReservationTimePercent
80	| CriticalReservationTimePercent
88	| SoftMaxIops
96	| SoftMaxBandwidth
104	| SoftMaxTimePercent
112	| LimitExcessNotifyIops
120	| LimitExcessNotifyBandwidth
128	| LimitExcessNotifyTimePercent
	+---

class _JOBOBJECT_IO_ATTRIBUTION_STATS	size(32):
	+---
 0	| IoCount
  	| <alignment member> (size=4)
 8	| TotalNonOverlappedQueueTime
16	| TotalNonOverlappedServiceTime
24	| TotalSize
	+---

class _JOBOBJECT_IO_ATTRIBUTION_INFORMATION	size(72):
	+---
 0	| ControlFlags
  	| <alignment member> (size=4)
 8	| _JOBOBJECT_IO_ATTRIBUTION_STATS ReadStats
40	| _JOBOBJECT_IO_ATTRIBUTION_STATS WriteStats
	+---

class _SILOOBJECT_BASIC_INFORMATION	size(16):
	+---
 0	| SiloId
 4	| SiloParentId
 8	| NumberOfProcesses
12	| IsInServerSilo
13	| Reserved
	+---

class _SERVERSILO_BASIC_INFORMATION	size(12):
	+---
 0	| ServiceSessionId
 4	| _SERVERSILO_STATE State
 8	| ExitStatus
	+---

class _CACHE_DESCRIPTOR	size(12):
	+---
 0	| Level
 1	| Associativity
 2	| LineSize
 4	| Size
 8	| _PROCESSOR_CACHE_TYPE Type
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<anonymous-tag>::<anonymous-tag>	size(1):
	+---
 0	| Flags
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| NodeNumber
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<anonymous-tag>	size(16):
	+---
 0	| <unnamed-type-ProcessorCore> ProcessorCore
  	| <alignment member> (size=3)
 0	| <unnamed-type-NumaNode> NumaNode
 0	| _CACHE_DESCRIPTOR Cache
  	| <alignment member> (size=4)
 0	| Reserved
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION	size(24):
	+---
 0	| ProcessorMask
 4	| _LOGICAL_PROCESSOR_RELATIONSHIP Relationship
  	| <anonymous-tag> <alignment member> (size=8)
 8	| <unnamed-type-ProcessorCore> ProcessorCore
  	| <alignment member> (size=3)
 8	| <unnamed-type-NumaNode> NumaNode
 8	| _CACHE_DESCRIPTOR Cache
  	| <alignment member> (size=4)
 8	| Reserved
	+---

class _PROCESSOR_RELATIONSHIP	size(36):
	+---
 0	| Flags
 1	| EfficiencyClass
 2	| Reserved
22	| GroupCount
24	| GroupMask
	+---

class _NUMA_NODE_RELATIONSHIP	size(36):
	+---
 0	| NodeNumber
 4	| Reserved
24	| _GROUP_AFFINITY GroupMask
	+---

class _CACHE_RELATIONSHIP	size(44):
	+---
 0	| Level
 1	| Associativity
 2	| LineSize
 4	| CacheSize
 8	| _PROCESSOR_CACHE_TYPE Type
12	| Reserved
32	| _GROUP_AFFINITY GroupMask
	+---

class _PROCESSOR_GROUP_INFO	size(44):
	+---
 0	| MaximumProcessorCount
 1	| ActiveProcessorCount
 2	| Reserved
40	| ActiveProcessorMask
	+---

class _GROUP_RELATIONSHIP	size(68):
	+---
 0	| MaximumGroupCount
 2	| ActiveGroupCount
 4	| Reserved
24	| GroupInfo
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX::<anonymous-tag>	size(68):
	+---
 0	| _PROCESSOR_RELATIONSHIP Processor
 0	| _NUMA_NODE_RELATIONSHIP NumaNode
 0	| _CACHE_RELATIONSHIP Cache
 0	| _GROUP_RELATIONSHIP Group
	+---

class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX	size(76):
	+---
 0	| _LOGICAL_PROCESSOR_RELATIONSHIP Relationship
 4	| Size
  	| <anonymous-tag> <alignment member> (size=8)
 8	| _PROCESSOR_RELATIONSHIP Processor
 8	| _NUMA_NODE_RELATIONSHIP NumaNode
 8	| _CACHE_RELATIONSHIP Cache
 8	| _GROUP_RELATIONSHIP Group
	+---

class _SYSTEM_CPU_SET_INFORMATION::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(1):
	+---
 0.	| Parked (bitstart=0,nbits=1)
 0.	| Allocated (bitstart=1,nbits=1)
 0.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
 0.	| RealTime (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=4)
	+---

class _SYSTEM_CPU_SET_INFORMATION::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(1):
	+---
 0	| AllFlags
 0.	| Parked (bitstart=0,nbits=1)
 0.	| Allocated (bitstart=1,nbits=1)
 0.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
 0.	| RealTime (bitstart=3,nbits=1)
 0.	| ReservedFlags (bitstart=4,nbits=4)
	+---

class _SYSTEM_CPU_SET_INFORMATION::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| Reserved
 0	| SchedulingClass
	+---

class _SYSTEM_CPU_SET_INFORMATION::<anonymous-tag>::<anonymous-tag>	size(24):
	+---
 0	| Id
 4	| Group
 6	| LogicalProcessorIndex
 7	| CoreIndex
 8	| LastLevelCacheIndex
 9	| NumaNodeIndex
10	| EfficiencyClass
  	| <anonymous-tag> <alignment member> (size=11)
11	| AllFlags
  	| <anonymous-tag> <alignment member> (size=11)
11.	| Parked (bitstart=0,nbits=1)
11.	| Allocated (bitstart=1,nbits=1)
11.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
11.	| RealTime (bitstart=3,nbits=1)
11.	| ReservedFlags (bitstart=4,nbits=4)
  	| <anonymous-tag> <alignment member> (size=11)
  	| <anonymous-tag> <alignment member> (size=12)
12	| Reserved
12	| SchedulingClass
16	| AllocationTag
	+---

class _SYSTEM_CPU_SET_INFORMATION::<anonymous-tag>	size(24):
	+---
 0	| <unnamed-type-CpuSet> CpuSet
	+---

class _SYSTEM_CPU_SET_INFORMATION	size(32):
	+---
 0	| Size
 4	| _CPU_SET_INFORMATION_TYPE Type
  	| <anonymous-tag> <alignment member> (size=8)
 8	| <unnamed-type-CpuSet> CpuSet
	+---

class _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION	size(8):
	+---
 0	| CycleTime
	+---

class _XSTATE_FEATURE	size(8):
	+---
 0	| Offset
 4	| Size
	+---

class _XSTATE_CONFIGURATION::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| OptimizedSave (bitstart=0,nbits=1)
 0.	| CompactionEnabled (bitstart=1,nbits=1)
	+---

class _XSTATE_CONFIGURATION::<anonymous-tag>	size(4):
	+---
 0	| ControlFlags
 0.	| OptimizedSave (bitstart=0,nbits=1)
 0.	| CompactionEnabled (bitstart=1,nbits=1)
	+---

class _XSTATE_CONFIGURATION	size(824):
	+---
 0	| EnabledFeatures
 8	| EnabledVolatileFeatures
16	| Size
  	| <anonymous-tag> <alignment member> (size=20)
20	| ControlFlags
  	| <anonymous-tag> <alignment member> (size=20)
20.	| OptimizedSave (bitstart=0,nbits=1)
20.	| CompactionEnabled (bitstart=1,nbits=1)
  	| <anonymous-tag> <alignment member> (size=20)
24	| Features
536	| EnabledSupervisorFeatures
544	| AlignedFeatures
552	| AllFeatureSize
556	| AllFeatures
  	| <alignment member> (size=4)
816	| EnabledUserVisibleSupervisorFeatures
	+---

class _MEMORY_BASIC_INFORMATION	size(28):
	+---
 0	| BaseAddress
 4	| AllocationBase
 8	| AllocationProtect
12	| RegionSize
16	| State
20	| Protect
24	| Type
	+---

class _MEMORY_BASIC_INFORMATION32	size(28):
	+---
 0	| BaseAddress
 4	| AllocationBase
 8	| AllocationProtect
12	| RegionSize
16	| State
20	| Protect
24	| Type
	+---

class _MEMORY_BASIC_INFORMATION64	size(48):
	+---
 0	| BaseAddress
 8	| AllocationBase
16	| AllocationProtect
20	| __alignment1
24	| RegionSize
32	| State
36	| Protect
40	| Type
44	| __alignment2
	+---

class _CFG_CALL_TARGET_INFO	size(8):
	+---
 0	| Offset
 4	| Flags
	+---

class _MEM_ADDRESS_REQUIREMENTS	size(12):
	+---
 0	| LowestStartingAddress
 4	| HighestEndingAddress
 8	| Alignment
	+---

class MEM_EXTENDED_PARAMETER::<anonymous-tag>	size(8):
	+---
 0.	| Type (bitstart=0,nbits=8)
 0.	| Reserved (bitstart=8,nbits=56)
	+---

class MEM_EXTENDED_PARAMETER::<anonymous-tag>	size(8):
	+---
 0	| ULong64
 0	| Pointer
 0	| Size
 0	| Handle
 0	| ULong
	+---

class MEM_EXTENDED_PARAMETER	size(16):
	+---
 0.	| Type (bitstart=0,nbits=8)
 0.	| Reserved (bitstart=8,nbits=56)
  	| <anonymous-tag> <alignment member> (size=8)
 8	| ULong64
 8	| Pointer
 8	| Size
 8	| Handle
 8	| ULong
	+---

class _ENCLAVE_CREATE_INFO_SGX	size(4096):
	+---
 0	| Secs
	+---

class _ENCLAVE_INIT_INFO_SGX	size(4096):
	+---
 0	| SigStruct
1808	| Reserved1
2048	| EInitToken
2352	| Reserved2
	+---

class _ENCLAVE_CREATE_INFO_VBS	size(36):
	+---
 0	| Flags
 4	| OwnerID
	+---

class _ENCLAVE_INIT_INFO_VBS	size(8):
	+---
 0	| Length
 4	| ThreadCount
	+---

class _FILE_ID_128	size(16):
	+---
 0	| Identifier
	+---

class _FILE_NOTIFY_INFORMATION	size(16):
	+---
 0	| NextEntryOffset
 4	| Action
 8	| FileNameLength
12	| FileName
  	| <alignment member> (size=2)
	+---

class _FILE_NOTIFY_EXTENDED_INFORMATION	size(88):
	+---
 0	| NextEntryOffset
 4	| Action
 8	| _LARGE_INTEGER CreationTime
16	| _LARGE_INTEGER LastModificationTime
24	| _LARGE_INTEGER LastChangeTime
32	| _LARGE_INTEGER LastAccessTime
40	| _LARGE_INTEGER AllocatedLength
48	| _LARGE_INTEGER FileSize
56	| FileAttributes
60	| ReparsePointTag
64	| _LARGE_INTEGER FileId
72	| _LARGE_INTEGER ParentFileId
80	| FileNameLength
84	| FileName
  	| <alignment member> (size=2)
	+---

class _FILE_SEGMENT_ELEMENT	size(8):
	+---
 0	| Buffer
 0	| Alignment
	+---

class _REPARSE_GUID_DATA_BUFFER::<anonymous-tag>	size(1):
	+---
 0	| DataBuffer
	+---

class _REPARSE_GUID_DATA_BUFFER	size(28):
	+---
 0	| ReparseTag
 4	| ReparseDataLength
 6	| Reserved
 8	| _GUID ReparseGuid
24	| <unnamed-type-GenericReparseBuffer> GenericReparseBuffer
  	| <alignment member> (size=3)
	+---

class _REARRANGE_FILE_DATA	size(32):
	+---
 0	| SourceStartingOffset
 8	| TargetOffset
16	| SourceFileHandle
20	| Length
24	| Flags
  	| <alignment member> (size=4)
	+---

class _POWER_USER_PRESENCE	size(4):
	+---
 0	| POWER_USER_PRESENCE_TYPE UserPresence
	+---

class _POWER_SESSION_CONNECT	size(2):
	+---
 0	| Connected
 1	| Console
	+---

class _POWER_SESSION_TIMEOUTS	size(8):
	+---
 0	| InputTimeout
 4	| DisplayTimeout
	+---

class _POWER_SESSION_RIT_STATE	size(8):
	+---
 0	| Active
  	| <alignment member> (size=3)
 4	| LastInputTime
	+---

class _POWER_SESSION_WINLOGON	size(8):
	+---
 0	| SessionId
 4	| Console
 5	| Locked
  	| <alignment member> (size=2)
	+---

class _POWER_IDLE_RESILIENCY	size(8):
	+---
 0	| CoalescingTimeout
 4	| IdleResiliencyPeriod
	+---

class _POWER_MONITOR_INVOCATION	size(8):
	+---
 0	| Console
  	| <alignment member> (size=3)
 4	| POWER_MONITOR_REQUEST_REASON RequestReason
	+---

class _RESUME_PERFORMANCE	size(24):
	+---
 0	| PostTimeMs
  	| <alignment member> (size=4)
 8	| TotalResumeTimeMs
16	| ResumeCompleteTimestamp
	+---

class <anonymous-tag>	size(32):
	+---
 0	| Version
 4	| _GUID Guid
20	| SYSTEM_POWER_CONDITION PowerCondition
24	| DataLength
28	| Data
  	| <alignment member> (size=3)
	+---

class <anonymous-tag>	size(16):
	+---
 0	| _GUID Guid
	+---

class _APPLICATIONLAUNCH_SETTING_VALUE	size(16):
	+---
 0	| _LARGE_INTEGER ActivationTime
 8	| Flags
12	| ButtonInstanceID
	+---

class _POWER_PLATFORM_INFORMATION	size(1):
	+---
 0	| AoAc
	+---

class <anonymous-tag>	size(8):
	+---
 0	| Granularity
 4	| Capacity
	+---

class <anonymous-tag>	size(12):
	+---
 0	| Frequency
 4	| Flags
 8	| PercentFrequency
	+---

class <anonymous-tag>	size(32):
	+---
 0	| Latency
 4	| Power
 8	| TimeCheck
12	| PromotePercent
13	| DemotePercent
14	| StateType
15	| Reserved
16	| StateFlags
20	| Context
24	| IdleHandler
28	| Reserved1
	+---

class <anonymous-tag>	size(56):
	+---
 0	| Type
 4	| Count
 8	| TargetState
12	| OldState
16	| TargetProcessors
24	| State
	+---

class <anonymous-tag>	size(52):
	+---
 0	| Type
 4	| Count
 8	| TargetState
12	| OldState
16	| TargetProcessors
20	| State
	+---

class <anonymous-tag>	size(64):
	+---
 0	| Frequency
 4	| Power
 8	| PercentFrequency
 9	| IncreaseLevel
10	| DecreaseLevel
11	| Type
12	| IncreaseTime
16	| DecreaseTime
  	| <alignment member> (size=4)
24	| Control
32	| Status
40	| HitCount
44	| Reserved1
48	| Reserved2
56	| Reserved3
	+---

class <anonymous-tag>	size(144):
	+---
 0	| Count
 4	| MaxFrequency
 8	| CurrentState
12	| MaxPerfState
16	| MinPerfState
20	| LowestPerfState
24	| ThermalConstraint
28	| BusyAdjThreshold
29	| PolicyType
30	| Type
31	| Reserved
32	| TimerInterval
  	| <alignment member> (size=4)
40	| TargetProcessors
48	| PStateHandler
52	| PStateContext
56	| TStateHandler
60	| TStateContext
64	| FeedbackHandler
68	| Reserved1
72	| Reserved2
80	| State
	+---

class <anonymous-tag>	size(136):
	+---
 0	| Count
 4	| MaxFrequency
 8	| CurrentState
12	| MaxPerfState
16	| MinPerfState
20	| LowestPerfState
24	| ThermalConstraint
28	| BusyAdjThreshold
29	| PolicyType
30	| Type
31	| Reserved
32	| TimerInterval
36	| TargetProcessors
40	| PStateHandler
44	| PStateContext
48	| TStateHandler
52	| TStateContext
56	| FeedbackHandler
60	| Reserved1
64	| Reserved2
72	| State
	+---

class <anonymous-tag>	size(48):
	+---
 0	| IdleTransitions
 4	| FailedTransitions
 8	| InvalidBucketIndex
  	| <alignment member> (size=4)
16	| TotalTime
24	| IdleTimeBuckets
	+---

class <anonymous-tag>	size(72):
	+---
 0	| StateCount
 4	| TotalTransitions
 8	| ResetCount
  	| <alignment member> (size=4)
16	| StartTime
24	| State
	+---

class <anonymous-tag>	size(24):
	+---
 0	| TotalTimeUs
 8	| MinTimeUs
12	| MaxTimeUs
16	| Count
  	| <alignment member> (size=4)
	+---

class <anonymous-tag>	size(416):
	+---
 0	| TotalTime
 8	| IdleTransitions
12	| FailedTransitions
16	| InvalidBucketIndex
20	| MinTimeUs
24	| MaxTimeUs
28	| CancelledTransitions
32	| IdleTimeBuckets
	+---

class <anonymous-tag>	size(440):
	+---
 0	| StateCount
 4	| TotalTransitions
 8	| ResetCount
12	| AbortCount
16	| StartTime
24	| State
	+---

class <anonymous-tag>	size(20):
	+---
 0	| State
 4	| Status
 8	| Latency
12	| Speed
16	| Processor
	+---

class <anonymous-tag>	size(24):
	+---
 0	| State
 4	| Latency
 8	| Speed
  	| <alignment member> (size=4)
16	| Processors
	+---

class <anonymous-tag>	size(16):
	+---
 0	| NewState
 4	| OldState
 8	| Processors
	+---

class <anonymous-tag>	size(16):
	+---
 0	| ThermalConstraint
  	| <alignment member> (size=4)
 8	| Processors
	+---

class <anonymous-tag>	size(16):
	+---
 0	| Mode
  	| <alignment member> (size=7)
 8	| Processors
	+---

class <anonymous-tag>	size(12):
	+---
 0	| POWER_ACTION Action
 4	| Flags
 8	| EventCode
	+---

class <anonymous-tag>	size(24):
	+---
 0	| Enable
 1	| Spare
 4	| BatteryLevel
 8	| POWER_ACTION_POLICY PowerPolicy
20	| _SYSTEM_POWER_STATE MinSystemState
	+---

class _SYSTEM_POWER_POLICY	size(232):
	+---
 0	| Revision
 4	| POWER_ACTION_POLICY PowerButton
16	| POWER_ACTION_POLICY SleepButton
28	| POWER_ACTION_POLICY LidClose
40	| _SYSTEM_POWER_STATE LidOpenWake
44	| Reserved
48	| POWER_ACTION_POLICY Idle
60	| IdleTimeout
64	| IdleSensitivity
65	| DynamicThrottle
66	| Spare2
68	| _SYSTEM_POWER_STATE MinSleep
72	| _SYSTEM_POWER_STATE MaxSleep
76	| _SYSTEM_POWER_STATE ReducedLatencySleep
80	| WinLogonFlags
84	| Spare3
88	| DozeS4Timeout
92	| BroadcastCapacityResolution
96	| DischargePolicy
192	| VideoTimeout
196	| VideoDimDisplay
  	| <alignment member> (size=3)
200	| VideoReserved
212	| SpindownTimeout
216	| OptimizeForPower
217	| FanThrottleTolerance
218	| ForcedThrottle
219	| MinThrottle
220	| POWER_ACTION_POLICY OverThrottled
	+---

class <anonymous-tag>	size(8):
	+---
 0	| TimeCheck
 4	| DemotePercent
 5	| PromotePercent
 6	| Spare
	+---

class <anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(2):
	+---
 0.	| AllowScaling (bitstart=0,nbits=1)
 0.	| Disabled (bitstart=1,nbits=1)
 0.	| Reserved (bitstart=2,nbits=14)
	+---

class <anonymous-tag>::<anonymous-tag>	size(2):
	+---
 0	| AsWORD
 0.	| AllowScaling (bitstart=0,nbits=1)
 0.	| Disabled (bitstart=1,nbits=1)
 0.	| Reserved (bitstart=2,nbits=14)
	+---

class <anonymous-tag>	size(32):
	+---
 0	| Revision
 2	| <unnamed-type-Flags> Flags
 4	| PolicyCount
 8	| Policy
	+---

class _PROCESSOR_POWER_POLICY_INFO	size(20):
	+---
 0	| TimeCheck
 4	| DemoteLimit
 8	| PromoteLimit
12	| DemotePercent
13	| PromotePercent
14	| Spare
16.	| AllowDemotion (bitstart=0,nbits=1)
16.	| AllowPromotion (bitstart=1,nbits=1)
16.	| Reserved (bitstart=2,nbits=30)
	+---

class _PROCESSOR_POWER_POLICY	size(76):
	+---
 0	| Revision
 4	| DynamicThrottle
 5	| Spare
 8.	| DisableCStates (bitstart=0,nbits=1)
 8.	| Reserved (bitstart=1,nbits=31)
12	| PolicyCount
16	| Policy
	+---

class <anonymous-tag>::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(1):
	+---
 0.	| NoDomainAccounting (bitstart=0,nbits=1)
 0.	| IncreasePolicy (bitstart=1,nbits=2)
 0.	| DecreasePolicy (bitstart=3,nbits=2)
 0.	| Reserved (bitstart=5,nbits=3)
	+---

class <anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(1):
	+---
 0	| AsBYTE
 0.	| NoDomainAccounting (bitstart=0,nbits=1)
 0.	| IncreasePolicy (bitstart=1,nbits=2)
 0.	| DecreasePolicy (bitstart=3,nbits=2)
 0.	| Reserved (bitstart=5,nbits=3)
	+---

class <anonymous-tag>::<anonymous-tag>	size(1):
	+---
 0	| Spare
 0	| <unnamed-type-Flags> Flags
	+---

class <anonymous-tag>	size(28):
	+---
 0	| Revision
 4	| MaxThrottle
 5	| MinThrottle
 6	| BusyAdjThreshold
  	| <anonymous-tag> <alignment member> (size=7)
 7	| Spare
 7	| <unnamed-type-Flags> Flags
 8	| TimeCheck
12	| IncreaseTime
16	| DecreaseTime
20	| IncreasePercent
24	| DecreasePercent
	+---

class _ADMINISTRATOR_POWER_POLICY	size(24):
	+---
 0	| _SYSTEM_POWER_STATE MinSleep
 4	| _SYSTEM_POWER_STATE MaxSleep
 8	| MinVideoTimeout
12	| MaxVideoTimeout
16	| MinSpindownTimeout
20	| MaxSpindownTimeout
	+---

class _HIBERFILE_BUCKET	size(24):
	+---
 0	| MaxPhysicalMemory
 8	| PhysicalMemoryPercent
  	| <alignment member> (size=4)
	+---

class <anonymous-tag>	size(76):
	+---
 0	| PowerButtonPresent
 1	| SleepButtonPresent
 2	| LidPresent
 3	| SystemS1
 4	| SystemS2
 5	| SystemS3
 6	| SystemS4
 7	| SystemS5
 8	| HiberFilePresent
 9	| FullWake
10	| VideoDimPresent
11	| ApmPresent
12	| UpsPresent
13	| ThermalControl
14	| ProcessorThrottle
15	| ProcessorMinThrottle
16	| ProcessorThrottleScale
17	| spare2
21	| DiskSpinDown
22	| spare3
30	| SystemBatteriesPresent
31	| BatteriesAreShortTerm
32	| BatteryScale
56	| _SYSTEM_POWER_STATE AcOnLineWake
60	| _SYSTEM_POWER_STATE SoftLidWake
64	| _SYSTEM_POWER_STATE RtcWake
68	| _SYSTEM_POWER_STATE MinDeviceWakeState
72	| _SYSTEM_POWER_STATE DefaultLowLatencyWake
	+---

class <anonymous-tag>	size(32):
	+---
 0	| AcOnLine
 1	| BatteryPresent
 2	| Charging
 3	| Discharging
 4	| Spare1
 7	| Tag
 8	| MaxCapacity
12	| RemainingCapacity
16	| Rate
20	| EstimatedTime
24	| DefaultAlert1
28	| DefaultAlert2
	+---

class _IMAGE_DOS_HEADER	size(64):
	+---
 0	| e_magic
 2	| e_cblp
 4	| e_cp
 6	| e_crlc
 8	| e_cparhdr
10	| e_minalloc
12	| e_maxalloc
14	| e_ss
16	| e_sp
18	| e_csum
20	| e_ip
22	| e_cs
24	| e_lfarlc
26	| e_ovno
28	| e_res
36	| e_oemid
38	| e_oeminfo
40	| e_res2
60	| e_lfanew
	+---

class _IMAGE_OS2_HEADER	size(64):
	+---
 0	| ne_magic
 2	| ne_ver
 3	| ne_rev
 4	| ne_enttab
 6	| ne_cbenttab
 8	| ne_crc
12	| ne_flags
14	| ne_autodata
16	| ne_heap
18	| ne_stack
20	| ne_csip
24	| ne_sssp
28	| ne_cseg
30	| ne_cmod
32	| ne_cbnrestab
34	| ne_segtab
36	| ne_rsrctab
38	| ne_restab
40	| ne_modtab
42	| ne_imptab
44	| ne_nrestab
48	| ne_cmovent
50	| ne_align
52	| ne_cres
54	| ne_exetyp
55	| ne_flagsothers
56	| ne_pretthunks
58	| ne_psegrefbytes
60	| ne_swaparea
62	| ne_expver
	+---

class _IMAGE_VXD_HEADER	size(196):
	+---
 0	| e32_magic
 2	| e32_border
 3	| e32_worder
 4	| e32_level
 8	| e32_cpu
10	| e32_os
12	| e32_ver
16	| e32_mflags
20	| e32_mpages
24	| e32_startobj
28	| e32_eip
32	| e32_stackobj
36	| e32_esp
40	| e32_pagesize
44	| e32_lastpagesize
48	| e32_fixupsize
52	| e32_fixupsum
56	| e32_ldrsize
60	| e32_ldrsum
64	| e32_objtab
68	| e32_objcnt
72	| e32_objmap
76	| e32_itermap
80	| e32_rsrctab
84	| e32_rsrccnt
88	| e32_restab
92	| e32_enttab
96	| e32_dirtab
100	| e32_dircnt
104	| e32_fpagetab
108	| e32_frectab
112	| e32_impmod
116	| e32_impmodcnt
120	| e32_impproc
124	| e32_pagesum
128	| e32_datapage
132	| e32_preload
136	| e32_nrestab
140	| e32_cbnrestab
144	| e32_nressum
148	| e32_autodata
152	| e32_debuginfo
156	| e32_debuglen
160	| e32_instpreload
164	| e32_instdemand
168	| e32_heapsize
172	| e32_res3
184	| e32_winresoff
188	| e32_winreslen
192	| e32_devid
194	| e32_ddkver
	+---

class _IMAGE_FILE_HEADER	size(20):
	+---
 0	| Machine
 2	| NumberOfSections
 4	| TimeDateStamp
 8	| PointerToSymbolTable
12	| NumberOfSymbols
16	| SizeOfOptionalHeader
18	| Characteristics
	+---

class _IMAGE_DATA_DIRECTORY	size(8):
	+---
 0	| VirtualAddress
 4	| Size
	+---

class _IMAGE_OPTIONAL_HEADER	size(224):
	+---
 0	| Magic
 2	| MajorLinkerVersion
 3	| MinorLinkerVersion
 4	| SizeOfCode
 8	| SizeOfInitializedData
12	| SizeOfUninitializedData
16	| AddressOfEntryPoint
20	| BaseOfCode
24	| BaseOfData
28	| ImageBase
32	| SectionAlignment
36	| FileAlignment
40	| MajorOperatingSystemVersion
42	| MinorOperatingSystemVersion
44	| MajorImageVersion
46	| MinorImageVersion
48	| MajorSubsystemVersion
50	| MinorSubsystemVersion
52	| Win32VersionValue
56	| SizeOfImage
60	| SizeOfHeaders
64	| CheckSum
68	| Subsystem
70	| DllCharacteristics
72	| SizeOfStackReserve
76	| SizeOfStackCommit
80	| SizeOfHeapReserve
84	| SizeOfHeapCommit
88	| LoaderFlags
92	| NumberOfRvaAndSizes
96	| DataDirectory
	+---

class _IMAGE_ROM_OPTIONAL_HEADER	size(56):
	+---
 0	| Magic
 2	| MajorLinkerVersion
 3	| MinorLinkerVersion
 4	| SizeOfCode
 8	| SizeOfInitializedData
12	| SizeOfUninitializedData
16	| AddressOfEntryPoint
20	| BaseOfCode
24	| BaseOfData
28	| BaseOfBss
32	| GprMask
36	| CprMask
52	| GpValue
	+---

class _IMAGE_OPTIONAL_HEADER64	size(240):
	+---
 0	| Magic
 2	| MajorLinkerVersion
 3	| MinorLinkerVersion
 4	| SizeOfCode
 8	| SizeOfInitializedData
12	| SizeOfUninitializedData
16	| AddressOfEntryPoint
20	| BaseOfCode
24	| ImageBase
32	| SectionAlignment
36	| FileAlignment
40	| MajorOperatingSystemVersion
42	| MinorOperatingSystemVersion
44	| MajorImageVersion
46	| MinorImageVersion
48	| MajorSubsystemVersion
50	| MinorSubsystemVersion
52	| Win32VersionValue
56	| SizeOfImage
60	| SizeOfHeaders
64	| CheckSum
68	| Subsystem
70	| DllCharacteristics
72	| SizeOfStackReserve
80	| SizeOfStackCommit
88	| SizeOfHeapReserve
96	| SizeOfHeapCommit
104	| LoaderFlags
108	| NumberOfRvaAndSizes
112	| DataDirectory
	+---

class _IMAGE_NT_HEADERS64	size(264):
	+---
 0	| Signature
 4	| _IMAGE_FILE_HEADER FileHeader
24	| _IMAGE_OPTIONAL_HEADER64 OptionalHeader
	+---

class _IMAGE_NT_HEADERS	size(248):
	+---
 0	| Signature
 4	| _IMAGE_FILE_HEADER FileHeader
24	| _IMAGE_OPTIONAL_HEADER OptionalHeader
	+---

class _IMAGE_ROM_HEADERS	size(76):
	+---
 0	| _IMAGE_FILE_HEADER FileHeader
20	| _IMAGE_ROM_OPTIONAL_HEADER OptionalHeader
	+---

class ANON_OBJECT_HEADER	size(32):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| _GUID ClassID
28	| SizeOfData
	+---

class ANON_OBJECT_HEADER_V2	size(44):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| _GUID ClassID
28	| SizeOfData
32	| Flags
36	| MetaDataSize
40	| MetaDataOffset
	+---

class ANON_OBJECT_HEADER_BIGOBJ	size(56):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| _GUID ClassID
28	| SizeOfData
32	| Flags
36	| MetaDataSize
40	| MetaDataOffset
44	| NumberOfSections
48	| PointerToSymbolTable
52	| NumberOfSymbols
	+---

class _IMAGE_SECTION_HEADER::<anonymous-tag>	size(4):
	+---
 0	| PhysicalAddress
 0	| VirtualSize
	+---

class _IMAGE_SECTION_HEADER	size(40):
	+---
 0	| Name
 8	| <unnamed-type-Misc> Misc
12	| VirtualAddress
16	| SizeOfRawData
20	| PointerToRawData
24	| PointerToRelocations
28	| PointerToLinenumbers
32	| NumberOfRelocations
34	| NumberOfLinenumbers
36	| Characteristics
	+---

class _IMAGE_SYMBOL::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| Short
 4	| Long
	+---

class _IMAGE_SYMBOL::<anonymous-tag>	size(8):
	+---
 0	| ShortName
 0	| <unnamed-type-Name> Name
 0	| LongName
	+---

class _IMAGE_SYMBOL	size(18):
	+---
 0	| <unnamed-type-N> N
 8	| Value
12	| SectionNumber
14	| Type
16	| StorageClass
17	| NumberOfAuxSymbols
	+---

class _IMAGE_SYMBOL_EX::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| Short
 4	| Long
	+---

class _IMAGE_SYMBOL_EX::<anonymous-tag>	size(8):
	+---
 0	| ShortName
 0	| <unnamed-type-Name> Name
 0	| LongName
	+---

class _IMAGE_SYMBOL_EX	size(20):
	+---
 0	| <unnamed-type-N> N
 8	| Value
12	| SectionNumber
16	| Type
18	| StorageClass
19	| NumberOfAuxSymbols
	+---

class IMAGE_AUX_SYMBOL_TOKEN_DEF	size(18):
	+---
 0	| bAuxType
 1	| bReserved
 2	| SymbolTableIndex
 6	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| Linenumber
 2	| Size
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| <unnamed-type-LnSz> LnSz
 0	| TotalSize
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| PointerToLinenumber
 4	| PointerToNextFunction
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| Dimension
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| <unnamed-type-Function> Function
 0	| <unnamed-type-Array> Array
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>	size(18):
	+---
 0	| TagIndex
 4	| <unnamed-type-Misc> Misc
 8	| <unnamed-type-FcnAry> FcnAry
16	| TvIndex
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>	size(18):
	+---
 0	| Name
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>	size(18):
	+---
 0	| Length
 4	| NumberOfRelocations
 6	| NumberOfLinenumbers
 8	| CheckSum
12	| Number
14	| Selection
15	| bReserved
16	| HighNumber
	+---

class _IMAGE_AUX_SYMBOL::<anonymous-tag>	size(18):
	+---
 0	| crc
 4	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL	size(18):
	+---
 0	| <unnamed-type-Sym> Sym
 0	| <unnamed-type-File> File
 0	| <unnamed-type-Section> Section
 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
 0	| <unnamed-type-CRC> CRC
	+---

class _IMAGE_AUX_SYMBOL_EX::<anonymous-tag>	size(20):
	+---
 0	| WeakDefaultSymIndex
 4	| WeakSearchType
 8	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX::<anonymous-tag>	size(20):
	+---
 0	| Name
	+---

class _IMAGE_AUX_SYMBOL_EX::<anonymous-tag>	size(20):
	+---
 0	| Length
 4	| NumberOfRelocations
 6	| NumberOfLinenumbers
 8	| CheckSum
12	| Number
14	| Selection
15	| bReserved
16	| HighNumber
18	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX::<anonymous-tag>	size(20):
	+---
 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
18	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX::<anonymous-tag>	size(20):
	+---
 0	| crc
 4	| rgbReserved
	+---

class _IMAGE_AUX_SYMBOL_EX	size(20):
	+---
 0	| <unnamed-type-Sym> Sym
 0	| <unnamed-type-File> File
 0	| <unnamed-type-Section> Section
 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
18	| rgbReserved
 0	| <unnamed-type-CRC> CRC
	+---

class _IMAGE_RELOCATION::<anonymous-tag>	size(4):
	+---
 0	| VirtualAddress
 0	| RelocCount
	+---

class _IMAGE_RELOCATION	size(10):
	+---
 0	| VirtualAddress
 0	| RelocCount
 4	| SymbolTableIndex
 8	| Type
	+---

class _IMAGE_LINENUMBER::<anonymous-tag>	size(4):
	+---
 0	| SymbolTableIndex
 0	| VirtualAddress
	+---

class _IMAGE_LINENUMBER	size(6):
	+---
 0	| <unnamed-type-Type> Type
 4	| Linenumber
	+---

class _IMAGE_BASE_RELOCATION	size(8):
	+---
 0	| VirtualAddress
 4	| SizeOfBlock
	+---

class _IMAGE_ARCHIVE_MEMBER_HEADER	size(60):
	+---
 0	| Name
16	| Date
28	| UserID
34	| GroupID
40	| Mode
48	| Size
58	| EndHeader
	+---

class _IMAGE_EXPORT_DIRECTORY	size(40):
	+---
 0	| Characteristics
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| Name
16	| Base
20	| NumberOfFunctions
24	| NumberOfNames
28	| AddressOfFunctions
32	| AddressOfNames
36	| AddressOfNameOrdinals
	+---

class _IMAGE_IMPORT_BY_NAME	size(4):
	+---
 0	| Hint
 2	| Name
  	| <alignment member> (size=1)
	+---

class _IMAGE_THUNK_DATA64::<anonymous-tag>	size(8):
	+---
 0	| ForwarderString
 0	| Function
 0	| Ordinal
 0	| AddressOfData
	+---

class _IMAGE_THUNK_DATA64	size(8):
	+---
 0	| <unnamed-type-u u1
	+---

class _IMAGE_THUNK_DATA32::<anonymous-tag>	size(4):
	+---
 0	| ForwarderString
 0	| Function
 0	| Ordinal
 0	| AddressOfData
	+---

class _IMAGE_THUNK_DATA32	size(4):
	+---
 0	| <unnamed-type-u u1
	+---

class _IMAGE_TLS_DIRECTORY64::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY64::<anonymous-tag>	size(4):
	+---
 0	| Characteristics
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY64	size(40):
	+---
 0	| StartAddressOfRawData
 8	| EndAddressOfRawData
16	| AddressOfIndex
24	| AddressOfCallBacks
32	| SizeOfZeroFill
  	| <anonymous-tag> <alignment member> (size=36)
36	| Characteristics
  	| <anonymous-tag> <alignment member> (size=36)
36.	| Reserved0 (bitstart=0,nbits=20)
36.	| Alignment (bitstart=20,nbits=4)
36.	| Reserved1 (bitstart=24,nbits=8)
  	| <anonymous-tag> <alignment member> (size=36)
	+---

class _IMAGE_TLS_DIRECTORY32::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY32::<anonymous-tag>	size(4):
	+---
 0	| Characteristics
 0.	| Reserved0 (bitstart=0,nbits=20)
 0.	| Alignment (bitstart=20,nbits=4)
 0.	| Reserved1 (bitstart=24,nbits=8)
	+---

class _IMAGE_TLS_DIRECTORY32	size(24):
	+---
 0	| StartAddressOfRawData
 4	| EndAddressOfRawData
 8	| AddressOfIndex
12	| AddressOfCallBacks
16	| SizeOfZeroFill
  	| <anonymous-tag> <alignment member> (size=20)
20	| Characteristics
  	| <anonymous-tag> <alignment member> (size=20)
20.	| Reserved0 (bitstart=0,nbits=20)
20.	| Alignment (bitstart=20,nbits=4)
20.	| Reserved1 (bitstart=24,nbits=8)
  	| <anonymous-tag> <alignment member> (size=20)
	+---

class _IMAGE_IMPORT_DESCRIPTOR::<anonymous-tag>	size(4):
	+---
 0	| Characteristics
 0	| OriginalFirstThunk
	+---

class _IMAGE_IMPORT_DESCRIPTOR	size(20):
	+---
 0	| Characteristics
 0	| OriginalFirstThunk
 4	| TimeDateStamp
 8	| ForwarderChain
12	| Name
16	| FirstThunk
	+---

class _IMAGE_BOUND_IMPORT_DESCRIPTOR	size(8):
	+---
 0	| TimeDateStamp
 4	| OffsetModuleName
 6	| NumberOfModuleForwarderRefs
	+---

class _IMAGE_BOUND_FORWARDER_REF	size(8):
	+---
 0	| TimeDateStamp
 4	| OffsetModuleName
 6	| Reserved
	+---

class _IMAGE_DELAYLOAD_DESCRIPTOR::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| RvaBased (bitstart=0,nbits=1)
 0.	| ReservedAttributes (bitstart=1,nbits=31)
	+---

class _IMAGE_DELAYLOAD_DESCRIPTOR::<anonymous-tag>	size(4):
	+---
 0	| AllAttributes
 0.	| RvaBased (bitstart=0,nbits=1)
 0.	| ReservedAttributes (bitstart=1,nbits=31)
	+---

class _IMAGE_DELAYLOAD_DESCRIPTOR	size(32):
	+---
 0	| <unnamed-type-Attributes> Attributes
 4	| DllNameRVA
 8	| ModuleHandleRVA
12	| ImportAddressTableRVA
16	| ImportNameTableRVA
20	| BoundImportAddressTableRVA
24	| UnloadInformationTableRVA
28	| TimeDateStamp
	+---

class _IMAGE_RESOURCE_DIRECTORY	size(16):
	+---
 0	| Characteristics
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| NumberOfNamedEntries
14	| NumberOfIdEntries
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| NameOffset (bitstart=0,nbits=31)
 0.	| NameIsString (bitstart=31,nbits=1)
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<anonymous-tag>	size(4):
	+---
 0.	| NameOffset (bitstart=0,nbits=31)
 0.	| NameIsString (bitstart=31,nbits=1)
 0	| Name
 0	| Id
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| OffsetToDirectory (bitstart=0,nbits=31)
 0.	| DataIsDirectory (bitstart=31,nbits=1)
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<anonymous-tag>	size(4):
	+---
 0	| OffsetToData
 0.	| OffsetToDirectory (bitstart=0,nbits=31)
 0.	| DataIsDirectory (bitstart=31,nbits=1)
	+---

class _IMAGE_RESOURCE_DIRECTORY_ENTRY	size(8):
	+---
 0.	| NameOffset (bitstart=0,nbits=31)
 0.	| NameIsString (bitstart=31,nbits=1)
 0	| Name
 0	| Id
  	| <anonymous-tag> <alignment member> (size=4)
 4	| OffsetToData
  	| <anonymous-tag> <alignment member> (size=4)
 4.	| OffsetToDirectory (bitstart=0,nbits=31)
 4.	| DataIsDirectory (bitstart=31,nbits=1)
  	| <anonymous-tag> <alignment member> (size=4)
	+---

class _IMAGE_RESOURCE_DIRECTORY_STRING	size(4):
	+---
 0	| Length
 2	| NameString
  	| <alignment member> (size=1)
	+---

class _IMAGE_RESOURCE_DIR_STRING_U	size(4):
	+---
 0	| Length
 2	| NameString
	+---

class _IMAGE_RESOURCE_DATA_ENTRY	size(16):
	+---
 0	| OffsetToData
 4	| Size
 8	| CodePage
12	| Reserved
	+---

class _IMAGE_LOAD_CONFIG_CODE_INTEGRITY	size(12):
	+---
 0	| Flags
 2	| Catalog
 4	| CatalogOffset
 8	| Reserved
	+---

class _IMAGE_DYNAMIC_RELOCATION_TABLE	size(8):
	+---
 0	| Version
 4	| Size
	+---

class _IMAGE_DYNAMIC_RELOCATION32	size(8):
	+---
 0	| Symbol
 4	| BaseRelocSize
	+---

class _IMAGE_DYNAMIC_RELOCATION64	size(12):
	+---
 0	| Symbol
 8	| BaseRelocSize
	+---

class _IMAGE_DYNAMIC_RELOCATION32_V2	size(20):
	+---
 0	| HeaderSize
 4	| FixupInfoSize
 8	| Symbol
12	| SymbolGroup
16	| Flags
	+---

class _IMAGE_DYNAMIC_RELOCATION64_V2	size(24):
	+---
 0	| HeaderSize
 4	| FixupInfoSize
 8	| Symbol
16	| SymbolGroup
20	| Flags
	+---

class _IMAGE_PROLOGUE_DYNAMIC_RELOCATION_HEADER	size(1):
	+---
 0	| PrologueByteCount
	+---

class _IMAGE_EPILOGUE_DYNAMIC_RELOCATION_HEADER	size(8):
	+---
 0	| EpilogueCount
 4	| EpilogueByteCount
 5	| BranchDescriptorElementSize
 6	| BranchDescriptorCount
	+---

class _IMAGE_IMPORT_CONTROL_TRANSFER_DYNAMIC_RELOCATION	size(4):
	+---
 0.	| PageRelativeOffset (bitstart=0,nbits=12)
 0.	| IndirectCall (bitstart=12,nbits=1)
 0.	| IATIndex (bitstart=13,nbits=19)
	+---

class _IMAGE_INDIR_CONTROL_TRANSFER_DYNAMIC_RELOCATION	size(2):
	+---
 0.	| PageRelativeOffset (bitstart=0,nbits=12)
 0.	| IndirectCall (bitstart=12,nbits=1)
 0.	| RexWPrefix (bitstart=13,nbits=1)
 0.	| CfgCheck (bitstart=14,nbits=1)
 0.	| Reserved (bitstart=15,nbits=1)
	+---

class _IMAGE_SWITCHTABLE_BRANCH_DYNAMIC_RELOCATION	size(2):
	+---
 0.	| PageRelativeOffset (bitstart=0,nbits=12)
 0.	| RegisterNumber (bitstart=12,nbits=4)
	+---

class _IMAGE_LOAD_CONFIG_DIRECTORY32	size(164):
	+---
 0	| Size
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| GlobalFlagsClear
16	| GlobalFlagsSet
20	| CriticalSectionDefaultTimeout
24	| DeCommitFreeBlockThreshold
28	| DeCommitTotalFreeThreshold
32	| LockPrefixTable
36	| MaximumAllocationSize
40	| VirtualMemoryThreshold
44	| ProcessHeapFlags
48	| ProcessAffinityMask
52	| CSDVersion
54	| DependentLoadFlags
56	| EditList
60	| SecurityCookie
64	| SEHandlerTable
68	| SEHandlerCount
72	| GuardCFCheckFunctionPointer
76	| GuardCFDispatchFunctionPointer
80	| GuardCFFunctionTable
84	| GuardCFFunctionCount
88	| GuardFlags
92	| _IMAGE_LOAD_CONFIG_CODE_INTEGRITY CodeIntegrity
104	| GuardAddressTakenIatEntryTable
108	| GuardAddressTakenIatEntryCount
112	| GuardLongJumpTargetTable
116	| GuardLongJumpTargetCount
120	| DynamicValueRelocTable
124	| CHPEMetadataPointer
128	| GuardRFFailureRoutine
132	| GuardRFFailureRoutineFunctionPointer
136	| DynamicValueRelocTableOffset
140	| DynamicValueRelocTableSection
142	| Reserved2
144	| GuardRFVerifyStackPointerFunctionPointer
148	| HotPatchTableOffset
152	| Reserved3
156	| EnclaveConfigurationPointer
160	| VolatileMetadataPointer
	+---

class _IMAGE_LOAD_CONFIG_DIRECTORY64	size(264):
	+---
 0	| Size
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| GlobalFlagsClear
16	| GlobalFlagsSet
20	| CriticalSectionDefaultTimeout
24	| DeCommitFreeBlockThreshold
32	| DeCommitTotalFreeThreshold
40	| LockPrefixTable
48	| MaximumAllocationSize
56	| VirtualMemoryThreshold
64	| ProcessAffinityMask
72	| ProcessHeapFlags
76	| CSDVersion
78	| DependentLoadFlags
80	| EditList
88	| SecurityCookie
96	| SEHandlerTable
104	| SEHandlerCount
112	| GuardCFCheckFunctionPointer
120	| GuardCFDispatchFunctionPointer
128	| GuardCFFunctionTable
136	| GuardCFFunctionCount
144	| GuardFlags
148	| _IMAGE_LOAD_CONFIG_CODE_INTEGRITY CodeIntegrity
160	| GuardAddressTakenIatEntryTable
168	| GuardAddressTakenIatEntryCount
176	| GuardLongJumpTargetTable
184	| GuardLongJumpTargetCount
192	| DynamicValueRelocTable
200	| CHPEMetadataPointer
208	| GuardRFFailureRoutine
216	| GuardRFFailureRoutineFunctionPointer
224	| DynamicValueRelocTableOffset
228	| DynamicValueRelocTableSection
230	| Reserved2
232	| GuardRFVerifyStackPointerFunctionPointer
240	| HotPatchTableOffset
244	| Reserved3
248	| EnclaveConfigurationPointer
256	| VolatileMetadataPointer
	+---

class _IMAGE_HOT_PATCH_INFO	size(28):
	+---
 0	| Version
 4	| Size
 8	| SequenceNumber
12	| BaseImageList
16	| BaseImageCount
20	| BufferOffset
24	| ExtraPatchSize
	+---

class _IMAGE_HOT_PATCH_BASE	size(32):
	+---
 0	| SequenceNumber
 4	| Flags
 8	| OriginalTimeDateStamp
12	| OriginalCheckSum
16	| CodeIntegrityInfo
20	| CodeIntegritySize
24	| PatchTable
28	| BufferOffset
	+---

class _IMAGE_HOT_PATCH_HASHES	size(52):
	+---
 0	| SHA256
32	| SHA1
	+---

class _IMAGE_CE_RUNTIME_FUNCTION_ENTRY	size(8):
	+---
 0	| FuncStart
 4.	| PrologLen (bitstart=0,nbits=8)
 4.	| FuncLen (bitstart=8,nbits=22)
 4.	| ThirtyTwoBit (bitstart=30,nbits=1)
 4.	| ExceptionFlag (bitstart=31,nbits=1)
	+---

class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| Ret (bitstart=13,nbits=2)
 0.	| H (bitstart=15,nbits=1)
 0.	| Reg (bitstart=16,nbits=3)
 0.	| R (bitstart=19,nbits=1)
 0.	| L (bitstart=20,nbits=1)
 0.	| C (bitstart=21,nbits=1)
 0.	| StackAdjust (bitstart=22,nbits=10)
	+---

class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY::<anonymous-tag>	size(4):
	+---
 0	| UnwindData
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| Ret (bitstart=13,nbits=2)
 0.	| H (bitstart=15,nbits=1)
 0.	| Reg (bitstart=16,nbits=3)
 0.	| R (bitstart=19,nbits=1)
 0.	| L (bitstart=20,nbits=1)
 0.	| C (bitstart=21,nbits=1)
 0.	| StackAdjust (bitstart=22,nbits=10)
	+---

class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY	size(8):
	+---
 0	| BeginAddress
  	| <anonymous-tag> <alignment member> (size=4)
 4	| UnwindData
  	| <anonymous-tag> <alignment member> (size=4)
 4.	| Flag (bitstart=0,nbits=2)
 4.	| FunctionLength (bitstart=2,nbits=11)
 4.	| Ret (bitstart=13,nbits=2)
 4.	| H (bitstart=15,nbits=1)
 4.	| Reg (bitstart=16,nbits=3)
 4.	| R (bitstart=19,nbits=1)
 4.	| L (bitstart=20,nbits=1)
 4.	| C (bitstart=21,nbits=1)
 4.	| StackAdjust (bitstart=22,nbits=10)
  	| <anonymous-tag> <alignment member> (size=4)
	+---

class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| RegF (bitstart=13,nbits=3)
 0.	| RegI (bitstart=16,nbits=4)
 0.	| H (bitstart=20,nbits=1)
 0.	| CR (bitstart=21,nbits=2)
 0.	| FrameSize (bitstart=23,nbits=9)
	+---

class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY::<anonymous-tag>	size(4):
	+---
 0	| UnwindData
 0.	| Flag (bitstart=0,nbits=2)
 0.	| FunctionLength (bitstart=2,nbits=11)
 0.	| RegF (bitstart=13,nbits=3)
 0.	| RegI (bitstart=16,nbits=4)
 0.	| H (bitstart=20,nbits=1)
 0.	| CR (bitstart=21,nbits=2)
 0.	| FrameSize (bitstart=23,nbits=9)
	+---

class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY	size(8):
	+---
 0	| BeginAddress
  	| <anonymous-tag> <alignment member> (size=4)
 4	| UnwindData
  	| <anonymous-tag> <alignment member> (size=4)
 4.	| Flag (bitstart=0,nbits=2)
 4.	| FunctionLength (bitstart=2,nbits=11)
 4.	| RegF (bitstart=13,nbits=3)
 4.	| RegI (bitstart=16,nbits=4)
 4.	| H (bitstart=20,nbits=1)
 4.	| CR (bitstart=21,nbits=2)
 4.	| FrameSize (bitstart=23,nbits=9)
  	| <anonymous-tag> <alignment member> (size=4)
	+---

class _IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY	size(40):
	+---
 0	| BeginAddress
 8	| EndAddress
16	| ExceptionHandler
24	| HandlerData
32	| PrologEndAddress
	+---

class _IMAGE_ALPHA_RUNTIME_FUNCTION_ENTRY	size(20):
	+---
 0	| BeginAddress
 4	| EndAddress
 8	| ExceptionHandler
12	| HandlerData
16	| PrologEndAddress
	+---

class _IMAGE_RUNTIME_FUNCTION_ENTRY::<anonymous-tag>	size(4):
	+---
 0	| UnwindInfoAddress
 0	| UnwindData
	+---

class _IMAGE_RUNTIME_FUNCTION_ENTRY	size(12):
	+---
 0	| BeginAddress
 4	| EndAddress
  	| <anonymous-tag> <alignment member> (size=8)
 8	| UnwindInfoAddress
 8	| UnwindData
	+---

class _IMAGE_ENCLAVE_CONFIG32	size(76):
	+---
 0	| Size
 4	| MinimumRequiredConfigSize
 8	| PolicyFlags
12	| NumberOfImports
16	| ImportList
20	| ImportEntrySize
24	| FamilyID
40	| ImageID
56	| ImageVersion
60	| SecurityVersion
64	| EnclaveSize
68	| NumberOfThreads
72	| EnclaveFlags
	+---

class _IMAGE_ENCLAVE_CONFIG64	size(80):
	+---
 0	| Size
 4	| MinimumRequiredConfigSize
 8	| PolicyFlags
12	| NumberOfImports
16	| ImportList
20	| ImportEntrySize
24	| FamilyID
40	| ImageID
56	| ImageVersion
60	| SecurityVersion
64	| EnclaveSize
72	| NumberOfThreads
76	| EnclaveFlags
	+---

class _IMAGE_ENCLAVE_IMPORT	size(80):
	+---
 0	| MatchType
 4	| MinimumSecurityVersion
 8	| UniqueOrAuthorID
40	| FamilyID
56	| ImageID
72	| ImportName
76	| Reserved
	+---

class _IMAGE_DEBUG_DIRECTORY	size(28):
	+---
 0	| Characteristics
 4	| TimeDateStamp
 8	| MajorVersion
10	| MinorVersion
12	| Type
16	| SizeOfData
20	| AddressOfRawData
24	| PointerToRawData
	+---

class _IMAGE_COFF_SYMBOLS_HEADER	size(32):
	+---
 0	| NumberOfSymbols
 4	| LvaToFirstSymbol
 8	| NumberOfLinenumbers
12	| LvaToFirstLinenumber
16	| RvaToFirstByteOfCode
20	| RvaToLastByteOfCode
24	| RvaToFirstByteOfData
28	| RvaToLastByteOfData
	+---

class _FPO_DATA	size(16):
	+---
 0	| ulOffStart
 4	| cbProcSize
 8	| cdwLocals
12	| cdwParams
14.	| cbProlog (bitstart=0,nbits=8)
14.	| cbRegs (bitstart=8,nbits=3)
14.	| fHasSEH (bitstart=11,nbits=1)
14.	| fUseBP (bitstart=12,nbits=1)
14.	| reserved (bitstart=13,nbits=1)
14.	| cbFrame (bitstart=14,nbits=2)
	+---

class _IMAGE_DEBUG_MISC	size(16):
	+---
 0	| DataType
 4	| Length
 8	| Unicode
 9	| Reserved
12	| Data
  	| <alignment member> (size=3)
	+---

class _IMAGE_FUNCTION_ENTRY	size(12):
	+---
 0	| StartingAddress
 4	| EndingAddress
 8	| EndOfPrologue
	+---

class _IMAGE_FUNCTION_ENTRY64::<anonymous-tag>	size(8):
	+---
 0	| EndOfPrologue
 0	| UnwindInfoAddress
	+---

class _IMAGE_FUNCTION_ENTRY64	size(24):
	+---
 0	| StartingAddress
 8	| EndingAddress
  	| <anonymous-tag> <alignment member> (size=16)
16	| EndOfPrologue
16	| UnwindInfoAddress
	+---

class _IMAGE_SEPARATE_DEBUG_HEADER	size(48):
	+---
 0	| Signature
 2	| Flags
 4	| Machine
 6	| Characteristics
 8	| TimeDateStamp
12	| CheckSum
16	| ImageBase
20	| SizeOfImage
24	| NumberOfSections
28	| ExportedNamesSize
32	| DebugDirectorySize
36	| SectionAlignment
40	| Reserved
	+---

class _NON_PAGED_DEBUG_INFO	size(32):
	+---
 0	| Signature
 2	| Flags
 4	| Size
 8	| Machine
10	| Characteristics
12	| TimeDateStamp
16	| CheckSum
20	| SizeOfImage
24	| ImageBase
	+---

class _ImageArchitectureHeader	size(8):
	+---
 0.	| AmaskValue (bitstart=0,nbits=1)
 0.	| AmaskShift (bitstart=8,nbits=8)
 4	| FirstEntryRVA
	+---

class _ImageArchitectureEntry	size(8):
	+---
 0	| FixupInstRVA
 4	| NewInst
	+---

class IMPORT_OBJECT_HEADER::<anonymous-tag>	size(2):
	+---
 0	| Ordinal
 0	| Hint
	+---

class IMPORT_OBJECT_HEADER	size(20):
	+---
 0	| Sig1
 2	| Sig2
 4	| Version
 6	| Machine
 8	| TimeDateStamp
12	| SizeOfData
  	| <anonymous-tag> <alignment member> (size=16)
16	| Ordinal
16	| Hint
18.	| Type (bitstart=0,nbits=2)
18.	| NameType (bitstart=2,nbits=3)
18.	| Reserved (bitstart=5,nbits=11)
	+---

class IMAGE_COR20_HEADER::<anonymous-tag>	size(4):
	+---
 0	| EntryPointToken
 0	| EntryPointRVA
	+---

class IMAGE_COR20_HEADER	size(72):
	+---
 0	| cb
 4	| MajorRuntimeVersion
 6	| MinorRuntimeVersion
 8	| _IMAGE_DATA_DIRECTORY MetaData
16	| Flags
  	| <anonymous-tag> <alignment member> (size=20)
20	| EntryPointToken
20	| EntryPointRVA
24	| _IMAGE_DATA_DIRECTORY Resources
32	| _IMAGE_DATA_DIRECTORY StrongNameSignature
40	| _IMAGE_DATA_DIRECTORY CodeManagerTable
48	| _IMAGE_DATA_DIRECTORY VTableFixups
56	| _IMAGE_DATA_DIRECTORY ExportAddressTableJumps
64	| _IMAGE_DATA_DIRECTORY ManagedNativeHeader
	+---

class _SLIST_HEADER::<anonymous-tag>	size(8):
	+---
 0	| _SINGLE_LIST_ENTRY Next
 4	| Depth
 6	| CpuId
	+---

class _SLIST_HEADER	size(8):
	+---
 0	| Alignment
 0	| _SINGLE_LIST_ENTRY Next
 4	| Depth
 6	| CpuId
	+---

class _RTL_RUN_ONCE	size(4):
	+---
 0	| Ptr
	+---

class _RTL_BARRIER	size(24):
	+---
 0	| Reserved1
 4	| Reserved2
 8	| Reserved3
16	| Reserved4
20	| Reserved5
	+---

class _MESSAGE_RESOURCE_ENTRY	size(6):
	+---
 0	| Length
 2	| Flags
 4	| Text
  	| <alignment member> (size=1)
	+---

class _MESSAGE_RESOURCE_BLOCK	size(12):
	+---
 0	| LowId
 4	| HighId
 8	| OffsetToEntries
	+---

class _MESSAGE_RESOURCE_DATA	size(16):
	+---
 0	| NumberOfBlocks
 4	| Blocks
	+---

class _OSVERSIONINFOA	size(148):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
	+---

class _OSVERSIONINFOW	size(276):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
	+---

class _OSVERSIONINFOEXA	size(156):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
148	| wServicePackMajor
150	| wServicePackMinor
152	| wSuiteMask
154	| wProductType
155	| wReserved
	+---

class _OSVERSIONINFOEXW	size(284):
	+---
 0	| dwOSVersionInfoSize
 4	| dwMajorVersion
 8	| dwMinorVersion
12	| dwBuildNumber
16	| dwPlatformId
20	| szCSDVersion
276	| wServicePackMajor
278	| wServicePackMinor
280	| wSuiteMask
282	| wProductType
283	| wReserved
	+---

class _IMAGE_POLICY_ENTRY::<anonymous-tag>	size(8):
	+---
 0	| None
 0	| BoolValue
 0	| Int8Value
 0	| UInt8Value
 0	| Int16Value
 0	| UInt16Value
 0	| Int32Value
 0	| UInt32Value
  	| <alignment member> (size=4)
 0	| Int64Value
 0	| UInt64Value
 0	| AnsiStringValue
 0	| UnicodeStringValue
	+---

class _IMAGE_POLICY_ENTRY	size(16):
	+---
 0	| _IMAGE_POLICY_ENTRY_TYPE Type
 4	| _IMAGE_POLICY_ID PolicyId
 8	| <unnamed-type-u> u
	+---

class _IMAGE_POLICY_METADATA	size(16):
	+---
 0	| Version
 1	| Reserved0
 8	| ApplicationId
16	| Policies
	+---

class _RTL_CRITICAL_SECTION_DEBUG	size(32):
	+---
 0	| Type
 2	| CreatorBackTraceIndex
 4	| CriticalSection
 8	| _LIST_ENTRY ProcessLocksList
16	| EntryCount
20	| ContentionCount
24	| Flags
28	| CreatorBackTraceIndexHigh
30	| SpareWORD
	+---

class _RTL_CRITICAL_SECTION	size(24):
	+---
 0	| DebugInfo
 4	| LockCount
 8	| RecursionCount
12	| OwningThread
16	| LockSemaphore
20	| SpinCount
	+---

class _RTL_SRWLOCK	size(4):
	+---
 0	| Ptr
	+---

class _RTL_CONDITION_VARIABLE	size(4):
	+---
 0	| Ptr
	+---

class _ACTIVATION_CONTEXT_QUERY_INDEX	size(8):
	+---
 0	| ulAssemblyIndex
 4	| ulFileIndexInAssembly
	+---

class _ASSEMBLY_FILE_DETAILED_INFORMATION	size(20):
	+---
 0	| ulFlags
 4	| ulFilenameLength
 8	| ulPathLength
12	| lpFileName
16	| lpFilePath
	+---

class _ACTIVATION_CONTEXT_ASSEMBLY_DETAILED_INFORMATION	size(88):
	+---
 0	| ulFlags
 4	| ulEncodedAssemblyIdentityLength
 8	| ulManifestPathType
12	| ulManifestPathLength
16	| _LARGE_INTEGER liManifestLastWriteTime
24	| ulPolicyPathType
28	| ulPolicyPathLength
32	| _LARGE_INTEGER liPolicyLastWriteTime
40	| ulMetadataSatelliteRosterIndex
44	| ulManifestVersionMajor
48	| ulManifestVersionMinor
52	| ulPolicyVersionMajor
56	| ulPolicyVersionMinor
60	| ulAssemblyDirectoryNameLength
64	| lpAssemblyEncodedAssemblyIdentity
68	| lpAssemblyManifestPath
72	| lpAssemblyPolicyPath
76	| lpAssemblyDirectoryName
80	| ulFileCount
  	| <alignment member> (size=4)
	+---

class _ACTIVATION_CONTEXT_RUN_LEVEL_INFORMATION	size(12):
	+---
 0	| ulFlags
 4	| ACTCTX_REQUESTED_RUN_LEVEL RunLevel
 8	| UiAccess
	+---

class _COMPATIBILITY_CONTEXT_ELEMENT	size(20):
	+---
 0	| _GUID Id
16	| ACTCTX_COMPATIBILITY_ELEMENT_TYPE Type
	+---

class _ACTIVATION_CONTEXT_COMPATIBILITY_INFORMATION	size(4):
	+---
 0	| ElementCount
 4	| Elements
	+---

class _SUPPORTED_OS_INFO	size(4):
	+---
 0	| MajorVersion
 2	| MinorVersion
	+---

class _ACTIVATION_CONTEXT_DETAILED_INFORMATION	size(48):
	+---
 0	| dwFlags
 4	| ulFormatVersion
 8	| ulAssemblyCount
12	| ulRootManifestPathType
16	| ulRootManifestPathChars
20	| ulRootConfigurationPathType
24	| ulRootConfigurationPathChars
28	| ulAppDirPathType
32	| ulAppDirPathChars
36	| lpRootManifestPath
40	| lpRootConfigurationPath
44	| lpAppDirPath
	+---

class _HARDWARE_COUNTER_DATA	size(16):
	+---
 0	| _HARDWARE_COUNTER_TYPE Type
 4	| Reserved
 8	| Value
	+---

class _PERFORMANCE_DATA	size(288):
	+---
 0	| Size
 2	| Version
 3	| HwCountersCount
 4	| ContextSwitchCount
 8	| WaitReasonBitMap
16	| CycleTime
24	| RetryCount
28	| Reserved
32	| HwCounters
	+---

class _EVENTLOGRECORD	size(56):
	+---
 0	| Length
 4	| Reserved
 8	| RecordNumber
12	| TimeGenerated
16	| TimeWritten
20	| EventID
24	| EventType
26	| NumStrings
28	| EventCategory
30	| ReservedFlags
32	| ClosingRecordNumber
36	| StringOffset
40	| UserSidLength
44	| UserSidOffset
48	| DataLength
52	| DataOffset
	+---

class _EVENTSFORLOGFILE	size(520):
	+---
 0	| ulSize
 4	| szLogicalLogFile
516	| ulNumRecords
520	| pEventLogRecords
	+---

class _PACKEDEVENTINFO	size(8):
	+---
 0	| ulSize
 4	| ulNumEventsForLogFile
 8	| ulOffsets
	+---

class _TAPE_ERASE	size(8):
	+---
 0	| Type
 4	| Immediate
  	| <alignment member> (size=3)
	+---

class _TAPE_PREPARE	size(8):
	+---
 0	| Operation
 4	| Immediate
  	| <alignment member> (size=3)
	+---

class _TAPE_WRITE_MARKS	size(12):
	+---
 0	| Type
 4	| Count
 8	| Immediate
  	| <alignment member> (size=3)
	+---

class _TAPE_GET_POSITION	size(16):
	+---
 0	| Type
 4	| Partition
 8	| _LARGE_INTEGER Offset
	+---

class _TAPE_SET_POSITION	size(24):
	+---
 0	| Method
 4	| Partition
 8	| _LARGE_INTEGER Offset
16	| Immediate
  	| <alignment member> (size=7)
	+---

class _TAPE_GET_DRIVE_PARAMETERS	size(32):
	+---
 0	| ECC
 1	| Compression
 2	| DataPadding
 3	| ReportSetmarks
 4	| DefaultBlockSize
 8	| MaximumBlockSize
12	| MinimumBlockSize
16	| MaximumPartitionCount
20	| FeaturesLow
24	| FeaturesHigh
28	| EOTWarningZoneSize
	+---

class _TAPE_SET_DRIVE_PARAMETERS	size(8):
	+---
 0	| ECC
 1	| Compression
 2	| DataPadding
 3	| ReportSetmarks
 4	| EOTWarningZoneSize
	+---

class _TAPE_GET_MEDIA_PARAMETERS	size(32):
	+---
 0	| _LARGE_INTEGER Capacity
 8	| _LARGE_INTEGER Remaining
16	| BlockSize
20	| PartitionCount
24	| WriteProtected
  	| <alignment member> (size=7)
	+---

class _TAPE_SET_MEDIA_PARAMETERS	size(4):
	+---
 0	| BlockSize
	+---

class _TAPE_CREATE_PARTITION	size(12):
	+---
 0	| Method
 4	| Count
 8	| Size
	+---

class _TAPE_WMI_OPERATIONS	size(12):
	+---
 0	| Method
 4	| DataBufferSize
 8	| DataBuffer
	+---

class _TRANSACTION_NOTIFICATION	size(24):
	+---
 0	| TransactionKey
 4	| TransactionNotification
 8	| _LARGE_INTEGER TmVirtualClock
16	| ArgumentLength
  	| <alignment member> (size=4)
	+---

class _TRANSACTION_NOTIFICATION_RECOVERY_ARGUMENT	size(32):
	+---
 0	| _GUID EnlistmentId
16	| _GUID UOW
	+---

class _TRANSACTION_NOTIFICATION_TM_ONLINE_ARGUMENT	size(20):
	+---
 0	| _GUID TmIdentity
16	| Flags
	+---

class _TRANSACTION_NOTIFICATION_SAVEPOINT_ARGUMENT	size(4):
	+---
 0	| SavepointId
	+---

class _TRANSACTION_NOTIFICATION_PROPAGATE_ARGUMENT	size(40):
	+---
 0	| PropagationCookie
 4	| _GUID UOW
20	| _GUID TmIdentity
36	| BufferLength
	+---

class _TRANSACTION_NOTIFICATION_MARSHAL_ARGUMENT	size(20):
	+---
 0	| MarshalCookie
 4	| _GUID UOW
	+---

class _KCRM_MARSHAL_HEADER	size(16):
	+---
 0	| VersionMajor
 4	| VersionMinor
 8	| NumProtocols
12	| Unused
	+---

class _KCRM_TRANSACTION_BLOB	size(172):
	+---
 0	| _GUID UOW
16	| _GUID TmIdentity
32	| IsolationLevel
36	| IsolationFlags
40	| Timeout
44	| Description
	+---

class _KCRM_PROTOCOL_BLOB	size(32):
	+---
 0	| _GUID ProtocolId
16	| StaticInfoLength
20	| TransactionIdInfoLength
24	| Unused1
28	| Unused2
	+---

class _TRANSACTION_BASIC_INFORMATION	size(24):
	+---
 0	| _GUID TransactionId
16	| State
20	| Outcome
	+---

class _TRANSACTIONMANAGER_BASIC_INFORMATION	size(24):
	+---
 0	| _GUID TmIdentity
16	| _LARGE_INTEGER VirtualClock
	+---

class _TRANSACTIONMANAGER_LOG_INFORMATION	size(16):
	+---
 0	| _GUID LogIdentity
	+---

class _TRANSACTIONMANAGER_LOGPATH_INFORMATION	size(8):
	+---
 0	| LogPathLength
 4	| LogPath
  	| <alignment member> (size=2)
	+---

class _TRANSACTIONMANAGER_RECOVERY_INFORMATION	size(8):
	+---
 0	| LastRecoveredLsn
	+---

class _TRANSACTIONMANAGER_OLDEST_INFORMATION	size(16):
	+---
 0	| _GUID OldestTransactionGuid
	+---

class _TRANSACTION_PROPERTIES_INFORMATION	size(32):
	+---
 0	| IsolationLevel
 4	| IsolationFlags
 8	| _LARGE_INTEGER Timeout
16	| Outcome
20	| DescriptionLength
24	| Description
  	| <alignment member> (size=6)
	+---

class _TRANSACTION_BIND_INFORMATION	size(4):
	+---
 0	| TmHandle
	+---

class _TRANSACTION_ENLISTMENT_PAIR	size(32):
	+---
 0	| _GUID EnlistmentId
16	| _GUID ResourceManagerId
	+---

class _TRANSACTION_ENLISTMENTS_INFORMATION	size(36):
	+---
 0	| NumberOfEnlistments
 4	| EnlistmentPair
	+---

class _TRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION	size(32):
	+---
 0	| _TRANSACTION_ENLISTMENT_PAIR SuperiorEnlistmentPair
	+---

class _RESOURCEMANAGER_BASIC_INFORMATION	size(24):
	+---
 0	| _GUID ResourceManagerId
16	| DescriptionLength
20	| Description
  	| <alignment member> (size=2)
	+---

class _RESOURCEMANAGER_COMPLETION_INFORMATION	size(8):
	+---
 0	| IoCompletionPortHandle
 4	| CompletionKey
	+---

class _ENLISTMENT_BASIC_INFORMATION	size(48):
	+---
 0	| _GUID EnlistmentId
16	| _GUID TransactionId
32	| _GUID ResourceManagerId
	+---

class _ENLISTMENT_CRM_INFORMATION	size(48):
	+---
 0	| _GUID CrmTransactionManagerId
16	| _GUID CrmResourceManagerId
32	| _GUID CrmEnlistmentId
	+---

class _TRANSACTION_LIST_ENTRY	size(16):
	+---
 0	| _GUID UOW
	+---

class _TRANSACTION_LIST_INFORMATION	size(20):
	+---
 0	| NumberOfTransactions
 4	| TransactionInformation
	+---

class _KTMOBJECT_CURSOR	size(36):
	+---
 0	| _GUID LastQuery
16	| ObjectIdCount
20	| ObjectIds
	+---

class _TP_POOL_STACK_INFORMATION	size(8):
	+---
 0	| StackReserve
 4	| StackCommit
	+---

class _TP_CALLBACK_ENVIRON_V1::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0.	| LongFunction (bitstart=0,nbits=1)
 0.	| Persistent (bitstart=1,nbits=1)
 0.	| Private (bitstart=2,nbits=30)
	+---

class _TP_CALLBACK_ENVIRON_V1::<anonymous-tag>	size(4):
	+---
 0	| Flags
 0	| <unnamed-type-s> s
	+---

class _TP_CALLBACK_ENVIRON_V1	size(32):
	+---
 0	| Version
 4	| Pool
 8	| CleanupGroup
12	| CleanupGroupCancelCallback
16	| RaceDll
20	| ActivationContext
24	| FinalizationCallback
28	| <unnamed-type-u> u
	+---

class HKEY__	size(4):
	+---
 0	| unused
	+---

class HMETAFILE__	size(4):
	+---
 0	| unused
	+---

class HINSTANCE__	size(4):
	+---
 0	| unused
	+---

class HRGN__	size(4):
	+---
 0	| unused
	+---

class HRSRC__	size(4):
	+---
 0	| unused
	+---

class HSPRITE__	size(4):
	+---
 0	| unused
	+---

class HLSURF__	size(4):
	+---
 0	| unused
	+---

class HSTR__	size(4):
	+---
 0	| unused
	+---

class HTASK__	size(4):
	+---
 0	| unused
	+---

class HWINSTA__	size(4):
	+---
 0	| unused
	+---

class HKL__	size(4):
	+---
 0	| unused
	+---

class _FILETIME	size(8):
	+---
 0	| dwLowDateTime
 4	| dwHighDateTime
	+---

class HWND__	size(4):
	+---
 0	| unused
	+---

class HHOOK__	size(4):
	+---
 0	| unused
	+---

class HACCEL__	size(4):
	+---
 0	| unused
	+---

class HBITMAP__	size(4):
	+---
 0	| unused
	+---

class HBRUSH__	size(4):
	+---
 0	| unused
	+---

class HCOLORSPACE__	size(4):
	+---
 0	| unused
	+---

class HDC__	size(4):
	+---
 0	| unused
	+---

class HGLRC__	size(4):
	+---
 0	| unused
	+---

class HDESK__	size(4):
	+---
 0	| unused
	+---

class HENHMETAFILE__	size(4):
	+---
 0	| unused
	+---

class HFONT__	size(4):
	+---
 0	| unused
	+---

class HICON__	size(4):
	+---
 0	| unused
	+---

class HMENU__	size(4):
	+---
 0	| unused
	+---

class HPALETTE__	size(4):
	+---
 0	| unused
	+---

class HPEN__	size(4):
	+---
 0	| unused
	+---

class HWINEVENTHOOK__	size(4):
	+---
 0	| unused
	+---

class tagRECT	size(16):
	+---
 0	| left
 4	| top
 8	| right
12	| bottom
	+---

class _RECTL	size(16):
	+---
 0	| left
 4	| top
 8	| right
12	| bottom
	+---

class tagPOINT	size(8):
	+---
 0	| x
 4	| y
	+---

class _POINTL	size(8):
	+---
 0	| x
 4	| y
	+---

class tagSIZE	size(8):
	+---
 0	| cx
 4	| cy
	+---

class tagPOINTS	size(4):
	+---
 0	| x
 2	| y
	+---

class DPI_AWARENESS_CONTEXT__	size(4):
	+---
 0	| unused
	+---

class _SECURITY_ATTRIBUTES	size(12):
	+---
 0	| nLength
 4	| lpSecurityDescriptor
 8	| bInheritHandle
	+---

class _OVERLAPPED::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| Offset
 4	| OffsetHigh
	+---

class _OVERLAPPED::<anonymous-tag>	size(8):
	+---
 0	| Offset
 4	| OffsetHigh
 0	| Pointer
	+---

class _OVERLAPPED	size(20):
	+---
 0	| Internal
 4	| InternalHigh
  	| <anonymous-tag> <alignment member> (size=8)
  	| <anonymous-tag> <alignment member> (size=8)
 8	| Offset
12	| OffsetHigh
  	| <anonymous-tag> <alignment member> (size=8)
 8	| Pointer
16	| hEvent
	+---

class _OVERLAPPED_ENTRY	size(16):
	+---
 0	| lpCompletionKey
 4	| lpOverlapped
 8	| Internal
12	| dwNumberOfBytesTransferred
	+---

class _SYSTEMTIME	size(16):
	+---
 0	| wYear
 2	| wMonth
 4	| wDayOfWeek
 6	| wDay
 8	| wHour
10	| wMinute
12	| wSecond
14	| wMilliseconds
	+---

class _WIN32_FIND_DATAA	size(320):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| nFileSizeHigh
32	| nFileSizeLow
36	| dwReserved0
40	| dwReserved1
44	| cFileName
304	| cAlternateFileName
  	| <alignment member> (size=2)
	+---

class _WIN32_FIND_DATAW	size(592):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| nFileSizeHigh
32	| nFileSizeLow
36	| dwReserved0
40	| dwReserved1
44	| cFileName
564	| cAlternateFileName
	+---

class _PROCESS_HEAP_ENTRY::<anonymous-tag>::<anonymous-tag>	size(16):
	+---
 0	| hMem
 4	| dwReserved
	+---

class _PROCESS_HEAP_ENTRY::<anonymous-tag>::<anonymous-tag>	size(16):
	+---
 0	| dwCommittedSize
 4	| dwUnCommittedSize
 8	| lpFirstBlock
12	| lpLastBlock
	+---

class _PROCESS_HEAP_ENTRY::<anonymous-tag>	size(16):
	+---
 0	| <unnamed-type-Block> Block
 0	| <unnamed-type-Region> Region
	+---

class _PROCESS_HEAP_ENTRY	size(28):
	+---
 0	| lpData
 4	| cbData
 8	| cbOverhead
 9	| iRegionIndex
10	| wFlags
  	| <anonymous-tag> <alignment member> (size=12)
12	| <unnamed-type-Block> Block
12	| <unnamed-type-Region> Region
	+---

class _REASON_CONTEXT::<anonymous-tag>::<anonymous-tag>	size(16):
	+---
 0	| LocalizedReasonModule
 4	| LocalizedReasonId
 8	| ReasonStringCount
12	| ReasonStrings
	+---

class _REASON_CONTEXT::<anonymous-tag>	size(16):
	+---
 0	| <unnamed-type-Detailed> Detailed
 0	| SimpleReasonString
	+---

class _REASON_CONTEXT	size(24):
	+---
 0	| Version
 4	| Flags
 8	| <unnamed-type-Reason> Reason
	+---

class _EXCEPTION_DEBUG_INFO	size(84):
	+---
 0	| _EXCEPTION_RECORD ExceptionRecord
80	| dwFirstChance
	+---

class _CREATE_THREAD_DEBUG_INFO	size(12):
	+---
 0	| hThread
 4	| lpThreadLocalBase
 8	| lpStartAddress
	+---

class _CREATE_PROCESS_DEBUG_INFO	size(40):
	+---
 0	| hFile
 4	| hProcess
 8	| hThread
12	| lpBaseOfImage
16	| dwDebugInfoFileOffset
20	| nDebugInfoSize
24	| lpThreadLocalBase
28	| lpStartAddress
32	| lpImageName
36	| fUnicode
  	| <alignment member> (size=2)
	+---

class _EXIT_THREAD_DEBUG_INFO	size(4):
	+---
 0	| dwExitCode
	+---

class _EXIT_PROCESS_DEBUG_INFO	size(4):
	+---
 0	| dwExitCode
	+---

class _LOAD_DLL_DEBUG_INFO	size(24):
	+---
 0	| hFile
 4	| lpBaseOfDll
 8	| dwDebugInfoFileOffset
12	| nDebugInfoSize
16	| lpImageName
20	| fUnicode
  	| <alignment member> (size=2)
	+---

class _UNLOAD_DLL_DEBUG_INFO	size(4):
	+---
 0	| lpBaseOfDll
	+---

class _OUTPUT_DEBUG_STRING_INFO	size(8):
	+---
 0	| lpDebugStringData
 4	| fUnicode
 6	| nDebugStringLength
	+---

class _RIP_INFO	size(8):
	+---
 0	| dwError
 4	| dwType
	+---

class _DEBUG_EVENT::<anonymous-tag>	size(84):
	+---
 0	| _EXCEPTION_DEBUG_INFO Exception
 0	| _CREATE_THREAD_DEBUG_INFO CreateThread
 0	| _CREATE_PROCESS_DEBUG_INFO CreateProcessInfo
 0	| _EXIT_THREAD_DEBUG_INFO ExitThread
 0	| _EXIT_PROCESS_DEBUG_INFO ExitProcess
 0	| _LOAD_DLL_DEBUG_INFO LoadDll
 0	| _UNLOAD_DLL_DEBUG_INFO UnloadDll
 0	| _OUTPUT_DEBUG_STRING_INFO DebugString
 0	| _RIP_INFO RipInfo
	+---

class _DEBUG_EVENT	size(96):
	+---
 0	| dwDebugEventCode
 4	| dwProcessId
 8	| dwThreadId
12	| <unnamed-type-u> u
	+---

class DISK_SPACE_INFORMATION	size(96):
	+---
 0	| ActualTotalAllocationUnits
 8	| ActualAvailableAllocationUnits
16	| ActualPoolUnavailableAllocationUnits
24	| CallerTotalAllocationUnits
32	| CallerAvailableAllocationUnits
40	| CallerPoolUnavailableAllocationUnits
48	| UsedAllocationUnits
56	| TotalReservedAllocationUnits
64	| VolumeStorageReserveAllocationUnits
72	| AvailableCommittedAllocationUnits
80	| PoolAvailableAllocationUnits
88	| SectorsPerAllocationUnit
92	| BytesPerSector
	+---

class _WIN32_FILE_ATTRIBUTE_DATA	size(36):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| nFileSizeHigh
32	| nFileSizeLow
	+---

class _BY_HANDLE_FILE_INFORMATION	size(52):
	+---
 0	| dwFileAttributes
 4	| _FILETIME ftCreationTime
12	| _FILETIME ftLastAccessTime
20	| _FILETIME ftLastWriteTime
28	| dwVolumeSerialNumber
32	| nFileSizeHigh
36	| nFileSizeLow
40	| nNumberOfLinks
44	| nFileIndexHigh
48	| nFileIndexLow
	+---

class _HEAP_SUMMARY	size(20):
	+---
 0	| cb
 4	| cbAllocated
 8	| cbCommitted
12	| cbReserved
16	| cbMaxReserve
	+---

class _PROCESS_INFORMATION	size(16):
	+---
 0	| hProcess
 4	| hThread
 8	| dwProcessId
12	| dwThreadId
	+---

class _STARTUPINFOA	size(68):
	+---
 0	| cb
 4	| lpReserved
 8	| lpDesktop
12	| lpTitle
16	| dwX
20	| dwY
24	| dwXSize
28	| dwYSize
32	| dwXCountChars
36	| dwYCountChars
40	| dwFillAttribute
44	| dwFlags
48	| wShowWindow
50	| cbReserved2
52	| lpReserved2
56	| hStdInput
60	| hStdOutput
64	| hStdError
	+---

class _STARTUPINFOW	size(68):
	+---
 0	| cb
 4	| lpReserved
 8	| lpDesktop
12	| lpTitle
16	| dwX
20	| dwY
24	| dwXSize
28	| dwYSize
32	| dwXCountChars
36	| dwYCountChars
40	| dwFillAttribute
44	| dwFlags
48	| wShowWindow
50	| cbReserved2
52	| lpReserved2
56	| hStdInput
60	| hStdOutput
64	| hStdError
	+---

class _THREAD_POWER_THROTTLING_STATE	size(12):
	+---
 0	| Version
 4	| ControlMask
 8	| StateMask
	+---

class _APP_MEMORY_INFORMATION	size(32):
	+---
 0	| AvailableCommit
 8	| PrivateCommitUsage
16	| PeakPrivateCommitUsage
24	| TotalCommitUsage
	+---

class _PROCESS_MEMORY_EXHAUSTION_INFO	size(12):
	+---
 0	| Version
 2	| Reserved
 4	| _PROCESS_MEMORY_EXHAUSTION_TYPE Type
 8	| Value
	+---

class _PROCESS_POWER_THROTTLING_STATE	size(12):
	+---
 0	| Version
 4	| ControlMask
 8	| StateMask
	+---

class PROCESS_PROTECTION_LEVEL_INFORMATION	size(4):
	+---
 0	| ProtectionLevel
	+---

class _PROCESS_LEAP_SECOND_INFO	size(8):
	+---
 0	| Flags
 4	| Reserved
	+---

class _SYSTEM_INFO::<anonymous-tag>::<anonymous-tag>	size(4):
	+---
 0	| wProcessorArchitecture
 2	| wReserved
	+---

class _SYSTEM_INFO::<anonymous-tag>	size(4):
	+---
 0	| dwOemId
 0	| wProcessorArchitecture
 2	| wReserved
	+---

class _SYSTEM_INFO	size(36):
	+---
 0	| dwOemId
 0	| wProcessorArchitecture
 2	| wReserved
 4	| dwPageSize
 8	| lpMinimumApplicationAddress
12	| lpMaximumApplicationAddress
16	| dwActiveProcessorMask
20	| dwNumberOfProcessors
24	| dwProcessorType
28	| dwAllocationGranularity
32	| wProcessorLevel
34	| wProcessorRevision
	+---

class _MEMORYSTATUSEX	size(64):
	+---
 0	| dwLength
 4	| dwMemoryLoad
 8	| ullTotalPhys
16	| ullAvailPhys
24	| ullTotalPageFile
32	| ullAvailPageFile
40	| ullTotalVirtual
48	| ullAvailVirtual
56	| ullAvailExtendedVirtual
	+---

class JOBOBJECT_IO_RATE_CONTROL_INFORMATION	size(40):
	+---
 0	| MaxIops
 8	| MaxBandwidth
16	| ReservationIops
24	| VolumeName
28	| BaseIoSize
32	| ControlFlags
  	| <alignment member> (size=4)
	+---

class tagENUMUILANG	size(12):
	+---
 0	| NumOfEnumUILang
 4	| SizeOfEnumUIBuffer
 8	| pEnumUIBuffer
	+---

class _REDIRECTION_FUNCTION_DESCRIPTOR	size(12):
	+---
 0	| DllName
 4	| FunctionName
 8	| RedirectionTarget
	+---

class _REDIRECTION_DESCRIPTOR	size(12):
	+---
 0	| Version
 4	| FunctionCount
 8	| Redirections
	+---

class _COMMPROP	size(64):
	+---
 0	| wPacketLength
 2	| wPacketVersion
 4	| dwServiceMask
 8	| dwReserved1
12	| dwMaxTxQueue
16	| dwMaxRxQueue
20	| dwMaxBaud
24	| dwProvSubType
28	| dwProvCapabilities
32	| dwSettableParams
36	| dwSettableBaud
40	| wSettableData
42	| wSettableStopParity
44	| dwCurrentTxQueue
48	| dwCurrentRxQueue
52	| dwProvSpec1
56	| dwProvSpec2
60	| wcProvChar
  	| <alignment member> (size=2)
	+---

class _COMSTAT	size(12):
	+---
 0.	| fCtsHold (bitstart=0,nbits=1)
 0.	| fDsrHold (bitstart=1,nbits=1)
 0.	| fRlsdHold (bitstart=2,nbits=1)
 0.	| fXoffHold (bitstart=3,nbits=1)
 0.	| fXoffSent (bitstart=4,nbits=1)
 0.	| fEof (bitstart=5,nbits=1)
 0.	| fTxim (bitstart=6,nbits=1)
 0.	| fReserved (bitstart=7,nbits=25)
 4	| cbInQue
 8	| cbOutQue
	+---

class _DCB	size(28):
	+---
 0	| DCBlength
 4	| BaudRate
 8.	| fBinary (bitstart=0,nbits=1)
 8.	| fParity (bitstart=1,nbits=1)
 8.	| fOutxCtsFlow (bitstart=2,nbits=1)
 8.	| fOutxDsrFlow (bitstart=3,nbits=1)
 8.	| fDtrControl (bitstart=4,nbits=2)
 8.	| fDsrSensitivity (bitstart=6,nbits=1)
 8.	| fTXContinueOnXoff (bitstart=7,nbits=1)
 8.	| fOutX (bitstart=8,nbits=1)
 8.	| fInX (bitstart=9,nbits=1)
 8.	| fErrorChar (bitstart=10,nbits=1)
 8.	| fNull (bitstart=11,nbits=1)
 8.	| fRtsControl (bitstart=12,nbits=2)
 8.	| fAbortOnError (bitstart=14,nbits=1)
 8.	| fDummy2 (bitstart=15,nbits=17)
12	| wReserved
14	| XonLim
16	| XoffLim
18	| ByteSize
19	| Parity
20	| StopBits
21	| XonChar
22	| XoffChar
23	| ErrorChar
24	| EofChar
25	| EvtChar
26	| wReserved1
	+---

class _COMMTIMEOUTS	size(20):
	+---
 0	| ReadIntervalTimeout
 4	| ReadTotalTimeoutMultiplier
 8	| ReadTotalTimeoutConstant
12	| WriteTotalTimeoutMultiplier
16	| WriteTotalTimeoutConstant
	+---

class _COMMCONFIG	size(52):
	+---
 0	| dwSize
 4	| wVersion
 6	| wReserved
 8	| _DCB dcb
36	| dwProviderSubType
40	| dwProviderOffset
44	| dwProviderSize
48	| wcProviderData
  	| <alignment member> (size=2)
	+---

class _MEMORYSTATUS	size(32):
	+---
 0	| dwLength
 4	| dwMemoryLoad
 8	| dwTotalPhys
12	| dwAvailPhys
16	| dwTotalPageFile
20	| dwAvailPageFile
24	| dwTotalVirtual
28	| dwAvailVirtual
	+---

class _JIT_DEBUG_INFO	size(40):
	+---
 0	| dwSize
 4	| dwProcessorArchitecture
 8	| dwThreadID
12	| dwReserved0
16	| lpExceptionAddress
24	| lpExceptionRecord
32	| lpContextRecord
	+---

class _OFSTRUCT	size(136):
	+---
 0	| cBytes
 1	| fFixedDisk
 2	| nErrCode
 4	| Reserved1
 6	| Reserved2
 8	| szPathName
	+---

class _WIN32_STREAM_ID	size(24):
	+---
 0	| dwStreamId
 4	| dwStreamAttributes
 8	| _LARGE_INTEGER Size
16	| dwStreamNameSize
20	| cStreamName
  	| <alignment member> (size=2)
	+---

class _EVENTLOG_FULL_INFORMATION	size(4):
	+---
 0	| dwFull
	+---

class tagHW_PROFILE_INFOA	size(124):
	+---
 0	| dwDockInfo
 4	| szHwProfileGuid
43	| szHwProfileName
  	| <alignment member> (size=1)
	+---

class tagHW_PROFILE_INFOW	size(244):
	+---
 0	| dwDockInfo
 4	| szHwProfileGuid
82	| szHwProfileName
  	| <alignment member> (size=2)
	+---

class _TIME_ZONE_INFORMATION	size(172):
	+---
 0	| Bias
 4	| StandardName
68	| _SYSTEMTIME StandardDate
84	| StandardBias
88	| DaylightName
152	| _SYSTEMTIME DaylightDate
168	| DaylightBias
	+---

class _TIME_DYNAMIC_ZONE_INFORMATION	size(432):
	+---
 0	| Bias
 4	| StandardName
68	| _SYSTEMTIME StandardDate
84	| StandardBias
88	| DaylightName
152	| _SYSTEMTIME DaylightDate
168	| DaylightBias
172	| TimeZoneKeyName
428	| DynamicDaylightTimeDisabled
  	| <alignment member> (size=3)
	+---

class _SYSTEM_POWER_STATUS	size(12):
	+---
 0	| ACLineStatus
 1	| BatteryFlag
 2	| BatteryLifePercent
 3	| SystemStatusFlag
 4	| BatteryLifeTime
 8	| BatteryFullLifeTime
	+---

class _DRAWPATRECT	size(20):
	+---
 0	| tagPOINT ptPosition
 8	| tagPOINT ptSize
16	| wStyle
18	| wPattern
	+---

class _PSINJECTDATA	size(8):
	+---
 0	| DataBytes
 4	| InjectionPoint
 6	| PageNumber
	+---

class _PSFEATURE_OUTPUT	size(8):
	+---
 0	| bPageIndependent
 4	| bSetPageDevice
	+---

class _PSFEATURE_CUSTPAPER	size(20):
	+---
 0	| lOrientation
 4	| lWidth
 8	| lHeight
12	| lWidthOffset
16	| lHeightOffset
	+---

class tagXFORM	size(24):
	+---
 0	| eM11
 4	| eM12
 8	| eM21
12	| eM22
16	| eDx
20	| eDy
	+---

class tagBITMAP	size(24):
	+---
 0	| bmType
 4	| bmWidth
 8	| bmHeight
12	| bmWidthBytes
16	| bmPlanes
18	| bmBitsPixel
20	| bmBits
	+---

class tagRGBTRIPLE	size(3):
	+---
 0	| rgbtBlue
 1	| rgbtGreen
 2	| rgbtRed
	+---

class tagRGBQUAD	size(4):
	+---
 0	| rgbBlue
 1	| rgbGreen
 2	| rgbRed
 3	| rgbReserved
	+---

class tagCIEXYZ	size(12):
	+---
 0	| ciexyzX
 4	| ciexyzY
 8	| ciexyzZ
	+---

class tagICEXYZTRIPLE	size(36):
	+---
 0	| tagCIEXYZ ciexyzRed
12	| tagCIEXYZ ciexyzGreen
24	| tagCIEXYZ ciexyzBlue
	+---

class tagLOGCOLORSPACEA	size(328):
	+---
 0	| lcsSignature
 4	| lcsVersion
 8	| lcsSize
12	| lcsCSType
16	| lcsIntent
20	| tagICEXYZTRIPLE lcsEndpoints
56	| lcsGammaRed
60	| lcsGammaGreen
64	| lcsGammaBlue
68	| lcsFilename
	+---

class tagLOGCOLORSPACEW	size(588):
	+---
 0	| lcsSignature
 4	| lcsVersion
 8	| lcsSize
12	| lcsCSType
16	| lcsIntent
20	| tagICEXYZTRIPLE lcsEndpoints
56	| lcsGammaRed
60	| lcsGammaGreen
64	| lcsGammaBlue
68	| lcsFilename
	+---

class tagBITMAPCOREHEADER	size(12):
	+---
 0	| bcSize
 4	| bcWidth
 6	| bcHeight
 8	| bcPlanes
10	| bcBitCount
	+---

class tagBITMAPINFOHEADER	size(40):
	+---
 0	| biSize
 4	| biWidth
 8	| biHeight
12	| biPlanes
14	| biBitCount
16	| biCompression
20	| biSizeImage
24	| biXPelsPerMeter
28	| biYPelsPerMeter
32	| biClrUsed
36	| biClrImportant
	+---

class <anonymous-tag>	size(108):
	+---
 0	| bV4Size
 4	| bV4Width
 8	| bV4Height
12	| bV4Planes
14	| bV4BitCount
16	| bV4V4Compression
20	| bV4SizeImage
24	| bV4XPelsPerMeter
28	| bV4YPelsPerMeter
32	| bV4ClrUsed
36	| bV4ClrImportant
40	| bV4RedMask
44	| bV4GreenMask
48	| bV4BlueMask
52	| bV4AlphaMask
56	| bV4CSType
60	| tagICEXYZTRIPLE bV4Endpoints
96	| bV4GammaRed
100	| bV4GammaGreen
104	| bV4GammaBlue
	+---

class tagBITMAPINFO	size(44):
	+---
 0	| tagBITMAPINFOHEADER bmiHeader
40	| bmiColors
	+---

class tagBITMAPCOREINFO	size(16):
	+---
 0	| tagBITMAPCOREHEADER bmciHeader
12	| bmciColors
  	| <alignment member> (size=1)
	+---

class tagBITMAPFILEHEADER	size(14):
	+---
 0	| bfType
 2	| bfSize
 6	| bfReserved1
 8	| bfReserved2
10	| bfOffBits
	+---

class tagFONTSIGNATURE	size(24):
	+---
 0	| fsUsb
16	| fsCsb
	+---

class tagCHARSETINFO	size(32):
	+---
 0	| ciCharset
 4	| ciACP
 8	| tagFONTSIGNATURE fs
	+---

class tagLOCALESIGNATURE	size(32):
	+---
 0	| lsUsb
16	| lsCsbDefault
24	| lsCsbSupported
	+---

class tagHANDLETABLE	size(4):
	+---
 0	| objectHandle
	+---

class tagMETARECORD	size(8):
	+---
 0	| rdSize
 4	| rdFunction
 6	| rdParm
	+---

class tagMETAFILEPICT	size(16):
	+---
 0	| mm
 4	| xExt
 8	| yExt
12	| hMF
	+---

class tagMETAHEADER	size(18):
	+---
 0	| mtType
 2	| mtHeaderSize
 4	| mtVersion
 6	| mtSize
10	| mtNoObjects
12	| mtMaxRecord
16	| mtNoParameters
	+---

class tagENHMETARECORD	size(12):
	+---
 0	| iType
 4	| nSize
 8	| dParm
	+---

class tagENHMETAHEADER	size(100):
	+---
 0	| iType
 4	| nSize
 8	| _RECTL rclBounds
24	| _RECTL rclFrame
40	| dSignature
44	| nVersion
48	| nBytes
52	| nRecords
56	| nHandles
58	| sReserved
60	| nDescription
64	| offDescription
68	| nPalEntries
72	| tagSIZE szlDevice
80	| tagSIZE szlMillimeters
88	| cbPixelFormat
92	| offPixelFormat
96	| bOpenGL
	+---

class tagTEXTMETRICA	size(56):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
45	| tmLastChar
46	| tmDefaultChar
47	| tmBreakChar
48	| tmItalic
49	| tmUnderlined
50	| tmStruckOut
51	| tmPitchAndFamily
52	| tmCharSet
  	| <alignment member> (size=3)
	+---

class tagTEXTMETRICW	size(60):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
46	| tmLastChar
48	| tmDefaultChar
50	| tmBreakChar
52	| tmItalic
53	| tmUnderlined
54	| tmStruckOut
55	| tmPitchAndFamily
56	| tmCharSet
  	| <alignment member> (size=3)
	+---

class tagNEWTEXTMETRICA	size(72):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
45	| tmLastChar
46	| tmDefaultChar
47	| tmBreakChar
48	| tmItalic
49	| tmUnderlined
50	| tmStruckOut
51	| tmPitchAndFamily
52	| tmCharSet
  	| <alignment member> (size=3)
56	| ntmFlags
60	| ntmSizeEM
64	| ntmCellHeight
68	| ntmAvgWidth
	+---

class tagNEWTEXTMETRICW	size(76):
	+---
 0	| tmHeight
 4	| tmAscent
 8	| tmDescent
12	| tmInternalLeading
16	| tmExternalLeading
20	| tmAveCharWidth
24	| tmMaxCharWidth
28	| tmWeight
32	| tmOverhang
36	| tmDigitizedAspectX
40	| tmDigitizedAspectY
44	| tmFirstChar
46	| tmLastChar
48	| tmDefaultChar
50	| tmBreakChar
52	| tmItalic
53	| tmUnderlined
54	| tmStruckOut
55	| tmPitchAndFamily
56	| tmCharSet
  	| <alignment member> (size=3)
60	| ntmFlags
64	| ntmSizeEM
68	| ntmCellHeight
72	| ntmAvgWidth
	+---

class tagNEWTEXTMETRICEXA	size(96):
	+---
 0	| tagNEWTEXTMETRICA ntmTm
72	| tagFONTSIGNATURE ntmFontSig
	+---

class tagNEWTEXTMETRICEXW	size(100):
	+---
 0	| tagNEWTEXTMETRICW ntmTm
76	| tagFONTSIGNATURE ntmFontSig
	+---

class tagPELARRAY	size(20):
	+---
 0	| paXCount
 4	| paYCount
 8	| paXExt
12	| paYExt
16	| paRGBs
  	| <alignment member> (size=3)
	+---

class tagLOGBRUSH	size(12):
	+---
 0	| lbStyle
 4	| lbColor
 8	| lbHatch
	+---

class tagLOGBRUSH32	size(12):
	+---
 0	| lbStyle
 4	| lbColor
 8	| lbHatch
	+---

class tagLOGPEN	size(16):
	+---
 0	| lopnStyle
 4	| tagPOINT lopnWidth
12	| lopnColor
	+---

class tagEXTLOGPEN	size(28):
	+---
 0	| elpPenStyle
 4	| elpWidth
 8	| elpBrushStyle
12	| elpColor
16	| elpHatch
20	| elpNumEntries
24	| elpStyleEntry
	+---

class tagEXTLOGPEN32	size(28):
	+---
 0	| elpPenStyle
 4	| elpWidth
 8	| elpBrushStyle
12	| elpColor
16	| elpHatch
20	| elpNumEntries
24	| elpStyleEntry
	+---

class tagPALETTEENTRY	size(4):
	+---
 0	| peRed
 1	| peGreen
 2	| peBlue
 3	| peFlags
	+---

class tagLOGPALETTE	size(8):
	+---
 0	| palVersion
 2	| palNumEntries
 4	| palPalEntry
	+---

class tagLOGFONTA	size(60):
	+---
 0	| lfHeight
 4	| lfWidth
 8	| lfEscapement
12	| lfOrientation
16	| lfWeight
20	| lfItalic
21	| lfUnderline
22	| lfStrikeOut
23	| lfCharSet
24	| lfOutPrecision
25	| lfClipPrecision
26	| lfQuality
27	| lfPitchAndFamily
28	| lfFaceName
	+---

class tagLOGFONTW	size(92):
	+---
 0	| lfHeight
 4	| lfWidth
 8	| lfEscapement
12	| lfOrientation
16	| lfWeight
20	| lfItalic
21	| lfUnderline
22	| lfStrikeOut
23	| lfCharSet
24	| lfOutPrecision
25	| lfClipPrecision
26	| lfQuality
27	| lfPitchAndFamily
28	| lfFaceName
	+---

class tagENUMLOGFONTA	size(156):
	+---
 0	| tagLOGFONTA elfLogFont
60	| elfFullName
124	| elfStyle
	+---

class tagENUMLOGFONTW	size(284):
	+---
 0	| tagLOGFONTW elfLogFont
92	| elfFullName
220	| elfStyle
	+---

class tagENUMLOGFONTEXA	size(188):
	+---
 0	| tagLOGFONTA elfLogFont
60	| elfFullName
124	| elfStyle
156	| elfScript
	+---

class tagENUMLOGFONTEXW	size(348):
	+---
 0	| tagLOGFONTW elfLogFont
92	| elfFullName
220	| elfStyle
284	| elfScript
	+---

class tagPANOSE	size(10):
	+---
 0	| bFamilyType
 1	| bSerifStyle
 2	| bWeight
 3	| bProportion
 4	| bContrast
 5	| bStrokeVariation
 6	| bArmStyle
 7	| bLetterform
 8	| bMidline
 9	| bXHeight
	+---

class tagEXTLOGFONTA	size(192):
	+---
 0	| tagLOGFONTA elfLogFont
60	| elfFullName
124	| elfStyle
156	| elfVersion
160	| elfStyleSize
164	| elfMatch
168	| elfReserved
172	| elfVendorId
176	| elfCulture
180	| tagPANOSE elfPanose
  	| <alignment member> (size=2)
	+---

class tagEXTLOGFONTW	size(320):
	+---
 0	| tagLOGFONTW elfLogFont
92	| elfFullName
220	| elfStyle
284	| elfVersion
288	| elfStyleSize
292	| elfMatch
296	| elfReserved
300	| elfVendorId
304	| elfCulture
308	| tagPANOSE elfPanose
  	| <alignment member> (size=2)
	+---

class _devicemodeA::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
	+---

class _devicemodeA::<anonymous-tag>	size(8):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
 0	| _POINTL dmPosition
	+---

class _devicemodeA::<anonymous-tag>	size(4):
	+---
 0	| dmDisplayFlags
 0	| dmNup
	+---

class _devicemodeA	size(156):
	+---
 0	| dmDeviceName
32	| dmSpecVersion
34	| dmDriverVersion
36	| dmSize
38	| dmDriverExtra
40	| dmFields
  	| <anonymous-tag> <alignment member> (size=44)
  	| <anonymous-tag> <alignment member> (size=44)
44	| dmOrientation
46	| dmPaperSize
48	| dmPaperLength
50	| dmPaperWidth
  	| <anonymous-tag> <alignment member> (size=44)
44	| _POINTL dmPosition
52	| dmScale
54	| dmCopies
56	| dmDefaultSource
58	| dmPrintQuality
60	| dmColor
62	| dmDuplex
64	| dmYResolution
66	| dmTTOption
68	| dmCollate
70	| dmFormName
102	| dmLogPixels
104	| dmBitsPerPel
108	| dmPelsWidth
112	| dmPelsHeight
  	| <anonymous-tag> <alignment member> (size=116)
116	| dmDisplayFlags
116	| dmNup
120	| dmDisplayFrequency
124	| dmICMMethod
128	| dmICMIntent
132	| dmMediaType
136	| dmDitherType
140	| dmReserved1
144	| dmReserved2
148	| dmPanningWidth
152	| dmPanningHeight
	+---

class _devicemodeW::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
	+---

class _devicemodeW::<anonymous-tag>	size(8):
	+---
 0	| dmOrientation
 2	| dmPaperSize
 4	| dmPaperLength
 6	| dmPaperWidth
 0	| _POINTL dmPosition
	+---

class _devicemodeW::<anonymous-tag>	size(4):
	+---
 0	| dmDisplayFlags
 0	| dmNup
	+---

class _devicemodeW	size(220):
	+---
 0	| dmDeviceName
64	| dmSpecVersion
66	| dmDriverVersion
68	| dmSize
70	| dmDriverExtra
72	| dmFields
  	| <anonymous-tag> <alignment member> (size=76)
  	| <anonymous-tag> <alignment member> (size=76)
76	| dmOrientation
78	| dmPaperSize
80	| dmPaperLength
82	| dmPaperWidth
  	| <anonymous-tag> <alignment member> (size=76)
76	| _POINTL dmPosition
84	| dmScale
86	| dmCopies
88	| dmDefaultSource
90	| dmPrintQuality
92	| dmColor
94	| dmDuplex
96	| dmYResolution
98	| dmTTOption
100	| dmCollate
102	| dmFormName
166	| dmLogPixels
168	| dmBitsPerPel
172	| dmPelsWidth
176	| dmPelsHeight
  	| <anonymous-tag> <alignment member> (size=180)
180	| dmDisplayFlags
180	| dmNup
184	| dmDisplayFrequency
188	| dmICMMethod
192	| dmICMIntent
196	| dmMediaType
200	| dmDitherType
204	| dmReserved1
208	| dmReserved2
212	| dmPanningWidth
216	| dmPanningHeight
	+---

class _DISPLAY_DEVICEA	size(424):
	+---
 0	| cb
 4	| DeviceName
36	| DeviceString
164	| StateFlags
168	| DeviceID
296	| DeviceKey
	+---

class _DISPLAY_DEVICEW	size(840):
	+---
 0	| cb
 4	| DeviceName
68	| DeviceString
324	| StateFlags
328	| DeviceID
584	| DeviceKey
	+---

class _RGNDATAHEADER	size(32):
	+---
 0	| dwSize
 4	| iType
 8	| nCount
12	| nRgnSize
16	| tagRECT rcBound
	+---

class _RGNDATA	size(36):
	+---
 0	| _RGNDATAHEADER rdh
32	| Buffer
  	| <alignment member> (size=3)
	+---

class _ABC	size(12):
	+---
 0	| abcA
 4	| abcB
 8	| abcC
	+---

class _ABCFLOAT	size(12):
	+---
 0	| abcfA
 4	| abcfB
 8	| abcfC
	+---

class _OUTLINETEXTMETRICA	size(212):
	+---
 0	| otmSize
 4	| tagTEXTMETRICA otmTextMetrics
60	| otmFiller
61	| tagPANOSE otmPanoseNumber
  	| <alignment member> (size=1)
72	| otmfsSelection
76	| otmfsType
80	| otmsCharSlopeRise
84	| otmsCharSlopeRun
88	| otmItalicAngle
92	| otmEMSquare
96	| otmAscent
100	| otmDescent
104	| otmLineGap
108	| otmsCapEmHeight
112	| otmsXHeight
116	| tagRECT otmrcFontBox
132	| otmMacAscent
136	| otmMacDescent
140	| otmMacLineGap
144	| otmusMinimumPPEM
148	| tagPOINT otmptSubscriptSize
156	| tagPOINT otmptSubscriptOffset
164	| tagPOINT otmptSuperscriptSize
172	| tagPOINT otmptSuperscriptOffset
180	| otmsStrikeoutSize
184	| otmsStrikeoutPosition
188	| otmsUnderscoreSize
192	| otmsUnderscorePosition
196	| otmpFamilyName
200	| otmpFaceName
204	| otmpStyleName
208	| otmpFullName
	+---

class _OUTLINETEXTMETRICW	size(216):
	+---
 0	| otmSize
 4	| tagTEXTMETRICW otmTextMetrics
64	| otmFiller
65	| tagPANOSE otmPanoseNumber
  	| <alignment member> (size=1)
76	| otmfsSelection
80	| otmfsType
84	| otmsCharSlopeRise
88	| otmsCharSlopeRun
92	| otmItalicAngle
96	| otmEMSquare
100	| otmAscent
104	| otmDescent
108	| otmLineGap
112	| otmsCapEmHeight
116	| otmsXHeight
120	| tagRECT otmrcFontBox
136	| otmMacAscent
140	| otmMacDescent
144	| otmMacLineGap
148	| otmusMinimumPPEM
152	| tagPOINT otmptSubscriptSize
160	| tagPOINT otmptSubscriptOffset
168	| tagPOINT otmptSuperscriptSize
176	| tagPOINT otmptSuperscriptOffset
184	| otmsStrikeoutSize
188	| otmsStrikeoutPosition
192	| otmsUnderscoreSize
196	| otmsUnderscorePosition
200	| otmpFamilyName
204	| otmpFaceName
208	| otmpStyleName
212	| otmpFullName
	+---

class tagPOLYTEXTA	size(40):
	+---
 0	| x
 4	| y
 8	| n
12	| lpstr
16	| uiFlags
20	| tagRECT rcl
36	| pdx
	+---

class tagPOLYTEXTW	size(40):
	+---
 0	| x
 4	| y
 8	| n
12	| lpstr
16	| uiFlags
20	| tagRECT rcl
36	| pdx
	+---

class _FIXED	size(4):
	+---
 0	| fract
 2	| value
	+---

class _MAT2	size(16):
	+---
 0	| _FIXED eM11
 4	| _FIXED eM12
 8	| _FIXED eM21
12	| _FIXED eM22
	+---

class _GLYPHMETRICS	size(20):
	+---
 0	| gmBlackBoxX
 4	| gmBlackBoxY
 8	| tagPOINT gmptGlyphOrigin
16	| gmCellIncX
18	| gmCellIncY
	+---

class tagPOINTFX	size(8):
	+---
 0	| _FIXED x
 4	| _FIXED y
	+---

class tagTTPOLYCURVE	size(12):
	+---
 0	| wType
 2	| cpfx
 4	| apfx
	+---

class tagTTPOLYGONHEADER	size(16):
	+---
 0	| cb
 4	| dwType
 8	| tagPOINTFX pfxStart
	+---

class tagGCP_RESULTSA	size(36):
	+---
 0	| lStructSize
 4	| lpOutString
 8	| lpOrder
12	| lpDx
16	| lpCaretPos
20	| lpClass
24	| lpGlyphs
28	| nGlyphs
32	| nMaxFit
	+---

class tagGCP_RESULTSW	size(36):
	+---
 0	| lStructSize
 4	| lpOutString
 8	| lpOrder
12	| lpDx
16	| lpCaretPos
20	| lpClass
24	| lpGlyphs
28	| nGlyphs
32	| nMaxFit
	+---

class _RASTERIZER_STATUS	size(6):
	+---
 0	| nSize
 2	| wFlags
 4	| nLanguageID
	+---

class tagPIXELFORMATDESCRIPTOR	size(40):
	+---
 0	| nSize
 2	| nVersion
 4	| dwFlags
 8	| iPixelType
 9	| cColorBits
10	| cRedBits
11	| cRedShift
12	| cGreenBits
13	| cGreenShift
14	| cBlueBits
15	| cBlueShift
16	| cAlphaBits
17	| cAlphaShift
18	| cAccumBits
19	| cAccumRedBits
20	| cAccumGreenBits
21	| cAccumBlueBits
22	| cAccumAlphaBits
23	| cDepthBits
24	| cStencilBits
25	| cAuxBuffers
26	| iLayerType
27	| bReserved
28	| dwLayerMask
32	| dwVisibleMask
36	| dwDamageMask
	+---

class _TRIVERTEX	size(16):
	+---
 0	| x
 4	| y
 8	| Red
10	| Green
12	| Blue
14	| Alpha
	+---

class _GRADIENT_TRIANGLE	size(12):
	+---
 0	| Vertex1
 4	| Vertex2
 8	| Vertex3
	+---

class _GRADIENT_RECT	size(8):
	+---
 0	| UpperLeft
 4	| LowerRight
	+---

class _BLENDFUNCTION	size(4):
	+---
 0	| BlendOp
 1	| BlendFlags
 2	| SourceConstantAlpha
 3	| AlphaFormat
	+---

class tagDIBSECTION	size(84):
	+---
 0	| tagBITMAP dsBm
24	| tagBITMAPINFOHEADER dsBmih
64	| dsBitfields
76	| dshSection
80	| dsOffset
	+---

class tagCOLORADJUSTMENT	size(24):
	+---
 0	| caSize
 2	| caFlags
 4	| caIlluminantIndex
 6	| caRedGamma
 8	| caGreenGamma
10	| caBlueGamma
12	| caReferenceBlack
14	| caReferenceWhite
16	| caContrast
18	| caBrightness
20	| caColorfulness
22	| caRedGreenTint
	+---

class _DOCINFOA	size(20):
	+---
 0	| cbSize
 4	| lpszDocName
 8	| lpszOutput
12	| lpszDatatype
16	| fwType
	+---

class _DOCINFOW	size(20):
	+---
 0	| cbSize
 4	| lpszDocName
 8	| lpszOutput
12	| lpszDatatype
16	| fwType
	+---

class tagKERNINGPAIR	size(8):
	+---
 0	| wFirst
 2	| wSecond
 4	| iKernAmount
	+---

class tagEMR	size(8):
	+---
 0	| iType
 4	| nSize
	+---

class tagEMRTEXT	size(40):
	+---
 0	| _POINTL ptlReference
 8	| nChars
12	| offString
16	| fOptions
20	| _RECTL rcl
36	| offDx
	+---

class tagABORTPATH	size(8):
	+---
 0	| tagEMR emr
	+---

class tagEMRSELECTCLIPPATH	size(12):
	+---
 0	| tagEMR emr
 8	| iMode
	+---

class tagEMRSETMITERLIMIT	size(12):
	+---
 0	| tagEMR emr
 8	| eMiterLimit
	+---

class tagEMRRESTOREDC	size(12):
	+---
 0	| tagEMR emr
 8	| iRelative
	+---

class tagEMRSETARCDIRECTION	size(12):
	+---
 0	| tagEMR emr
 8	| iArcDirection
	+---

class tagEMRSETMAPPERFLAGS	size(12):
	+---
 0	| tagEMR emr
 8	| dwFlags
	+---

class tagEMRSETTEXTCOLOR	size(12):
	+---
 0	| tagEMR emr
 8	| crColor
	+---

class tagEMRSELECTOBJECT	size(12):
	+---
 0	| tagEMR emr
 8	| ihObject
	+---

class tagEMRSELECTPALETTE	size(12):
	+---
 0	| tagEMR emr
 8	| ihPal
	+---

class tagEMRRESIZEPALETTE	size(16):
	+---
 0	| tagEMR emr
 8	| ihPal
12	| cEntries
	+---

class tagEMRSETPALETTEENTRIES	size(24):
	+---
 0	| tagEMR emr
 8	| ihPal
12	| iStart
16	| cEntries
20	| aPalEntries
	+---

class tagEMRSETCOLORADJUSTMENT	size(32):
	+---
 0	| tagEMR emr
 8	| tagCOLORADJUSTMENT ColorAdjustment
	+---

class tagEMRGDICOMMENT	size(16):
	+---
 0	| tagEMR emr
 8	| cbData
12	| Data
  	| <alignment member> (size=3)
	+---

class tagEMREOF	size(20):
	+---
 0	| tagEMR emr
 8	| nPalEntries
12	| offPalEntries
16	| nSizeLast
	+---

class tagEMRLINETO	size(16):
	+---
 0	| tagEMR emr
 8	| _POINTL ptl
	+---

class tagEMROFFSETCLIPRGN	size(16):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlOffset
	+---

class tagEMRFILLPATH	size(24):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
	+---

class tagEMREXCLUDECLIPRECT	size(24):
	+---
 0	| tagEMR emr
 8	| _RECTL rclClip
	+---

class tagEMRSETVIEWPORTORGEX	size(16):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlOrigin
	+---

class tagEMRSETVIEWPORTEXTEX	size(16):
	+---
 0	| tagEMR emr
 8	| tagSIZE szlExtent
	+---

class tagEMRSCALEVIEWPORTEXTEX	size(24):
	+---
 0	| tagEMR emr
 8	| xNum
12	| xDenom
16	| yNum
20	| yDenom
	+---

class tagEMRSETWORLDTRANSFORM	size(32):
	+---
 0	| tagEMR emr
 8	| tagXFORM xform
	+---

class tagEMRMODIFYWORLDTRANSFORM	size(36):
	+---
 0	| tagEMR emr
 8	| tagXFORM xform
32	| iMode
	+---

class tagEMRSETPIXELV	size(20):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlPixel
16	| crColor
	+---

class tagEMREXTFLOODFILL	size(24):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlStart
16	| crColor
20	| iMode
	+---

class tagEMRELLIPSE	size(24):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBox
	+---

class tagEMRROUNDRECT	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBox
24	| tagSIZE szlCorner
	+---

class tagEMRARC	size(40):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBox
24	| _POINTL ptlStart
32	| _POINTL ptlEnd
	+---

class tagEMRANGLEARC	size(28):
	+---
 0	| tagEMR emr
 8	| _POINTL ptlCenter
16	| nRadius
20	| eStartAngle
24	| eSweepAngle
	+---

class tagEMRPOLYLINE	size(36):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cptl
28	| aptl
	+---

class tagEMRPOLYLINE16	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cpts
28	| apts
	+---

class tagEMRPOLYDRAW	size(40):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cptl
28	| aptl
36	| abTypes
  	| <alignment member> (size=3)
	+---

class tagEMRPOLYDRAW16	size(36):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cpts
28	| apts
32	| abTypes
  	| <alignment member> (size=3)
	+---

class tagEMRPOLYPOLYLINE	size(44):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| nPolys
28	| cptl
32	| aPolyCounts
36	| aptl
	+---

class tagEMRPOLYPOLYLINE16	size(40):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| nPolys
28	| cpts
32	| aPolyCounts
36	| apts
	+---

class tagEMRINVERTRGN	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbRgnData
28	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMRFILLRGN	size(36):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbRgnData
28	| ihBrush
32	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMRFRAMERGN	size(44):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbRgnData
28	| ihBrush
32	| tagSIZE szlStroke
40	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMREXTSELECTCLIPRGN	size(20):
	+---
 0	| tagEMR emr
 8	| cbRgnData
12	| iMode
16	| RgnData
  	| <alignment member> (size=3)
	+---

class tagEMREXTTEXTOUTA	size(76):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| iGraphicsMode
28	| exScale
32	| eyScale
36	| tagEMRTEXT emrtext
	+---

class tagEMRPOLYTEXTOUTA	size(80):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| iGraphicsMode
28	| exScale
32	| eyScale
36	| cStrings
40	| aemrtext
	+---

class tagEMRBITBLT	size(100):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
	+---

class tagEMRSTRETCHBLT	size(108):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
100	| cxSrc
104	| cySrc
	+---

class tagEMRMASKBLT	size(128):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| cxDest
36	| cyDest
40	| dwRop
44	| xSrc
48	| ySrc
52	| tagXFORM xformSrc
76	| crBkColorSrc
80	| iUsageSrc
84	| offBmiSrc
88	| cbBmiSrc
92	| offBitsSrc
96	| cbBitsSrc
100	| xMask
104	| yMask
108	| iUsageMask
112	| offBmiMask
116	| cbBmiMask
120	| offBitsMask
124	| cbBitsMask
	+---

class tagEMRPLGBLT	size(140):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| aptlDest
48	| xSrc
52	| ySrc
56	| cxSrc
60	| cySrc
64	| tagXFORM xformSrc
88	| crBkColorSrc
92	| iUsageSrc
96	| offBmiSrc
100	| cbBmiSrc
104	| offBitsSrc
108	| cbBitsSrc
112	| xMask
116	| yMask
120	| iUsageMask
124	| offBmiMask
128	| cbBmiMask
132	| offBitsMask
136	| cbBitsMask
	+---

class tagEMRSETDIBITSTODEVICE	size(76):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| xSrc
36	| ySrc
40	| cxSrc
44	| cySrc
48	| offBmiSrc
52	| cbBmiSrc
56	| offBitsSrc
60	| cbBitsSrc
64	| iUsageSrc
68	| iStartScan
72	| cScans
	+---

class tagEMRSTRETCHDIBITS	size(80):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| xDest
28	| yDest
32	| xSrc
36	| ySrc
40	| cxSrc
44	| cySrc
48	| offBmiSrc
52	| cbBmiSrc
56	| offBitsSrc
60	| cbBitsSrc
64	| iUsageSrc
68	| dwRop
72	| cxDest
76	| cyDest
	+---

class tagEMREXTCREATEFONTINDIRECTW	size(332):
	+---
 0	| tagEMR emr
 8	| ihFont
12	| tagEXTLOGFONTW elfw
	+---

class tagEMRCREATEPALETTE	size(20):
	+---
 0	| tagEMR emr
 8	| ihPal
12	| tagLOGPALETTE lgpl
	+---

class tagEMRCREATEPEN	size(28):
	+---
 0	| tagEMR emr
 8	| ihPen
12	| tagLOGPEN lopn
	+---

class tagEMREXTCREATEPEN	size(56):
	+---
 0	| tagEMR emr
 8	| ihPen
12	| offBmi
16	| cbBmi
20	| offBits
24	| cbBits
28	| tagEXTLOGPEN32 elp
	+---

class tagEMRCREATEBRUSHINDIRECT	size(24):
	+---
 0	| tagEMR emr
 8	| ihBrush
12	| tagLOGBRUSH32 lb
	+---

class tagEMRCREATEMONOBRUSH	size(32):
	+---
 0	| tagEMR emr
 8	| ihBrush
12	| iUsage
16	| offBmi
20	| cbBmi
24	| offBits
28	| cbBits
	+---

class tagEMRCREATEDIBPATTERNBRUSHPT	size(32):
	+---
 0	| tagEMR emr
 8	| ihBrush
12	| iUsage
16	| offBmi
20	| cbBmi
24	| offBits
28	| cbBits
	+---

class tagEMRFORMAT	size(16):
	+---
 0	| dSignature
 4	| nVersion
 8	| cbData
12	| offData
	+---

class tagEMRGLSRECORD	size(16):
	+---
 0	| tagEMR emr
 8	| cbData
12	| Data
  	| <alignment member> (size=3)
	+---

class tagEMRGLSBOUNDEDRECORD	size(32):
	+---
 0	| tagEMR emr
 8	| _RECTL rclBounds
24	| cbData
28	| Data
  	| <alignment member> (size=3)
	+---

class tagEMRPIXELFORMAT	size(48):
	+---
 0	| tagEMR emr
 8	| tagPIXELFORMATDESCRIPTOR pfd
	+---

class tagEMRCREATECOLORSPACE	size(340):
	+---
 0	| tagEMR emr
 8	| ihCS
12	| tagLOGCOLORSPACEA lcs
	+---

class tagEMRSETCOLORSPACE	size(12):
	+---
 0	| tagEMR emr
 8	| ihCS
	+---

class _POINTFLOAT	size(8):
	+---
 0	| x
 4	| y
	+---

class _GLYPHMETRICSFLOAT	size(24):
	+---
 0	| gmfBlackBoxX
 4	| gmfBlackBoxY
 8	| _POINTFLOAT gmfptGlyphOrigin
16	| gmfCellIncX
20	| gmfCellIncY
	+---

class tagLAYERPLANEDESCRIPTOR	size(32):
	+---
 0	| nSize
 2	| nVersion
 4	| dwFlags
 8	| iPixelType
 9	| cColorBits
10	| cRedBits
11	| cRedShift
12	| cGreenBits
13	| cGreenShift
14	| cBlueBits
15	| cBlueShift
16	| cAlphaBits
17	| cAlphaShift
18	| cAccumBits
19	| cAccumRedBits
20	| cAccumGreenBits
21	| cAccumBlueBits
22	| cAccumAlphaBits
23	| cDepthBits
24	| cStencilBits
25	| cAuxBuffers
26	| iLayerPlane
27	| bReserved
28	| crTransparent
	+---

class tagCBT_CREATEWNDA	size(8):
	+---
 0	| lpcs
 4	| hwndInsertAfter
	+---

class tagCBT_CREATEWNDW	size(8):
	+---
 0	| lpcs
 4	| hwndInsertAfter
	+---

class tagCBTACTIVATESTRUCT	size(8):
	+---
 0	| fMouse
 4	| hWndActive
	+---

class <anonymous-tag>	size(20):
	+---
 0	| hwnd
 4	| tagRECT rc
	+---

class tagEVENTMSG	size(20):
	+---
 0	| message
 4	| paramL
 8	| paramH
12	| time
16	| hwnd
	+---

class tagCWPSTRUCT	size(16):
	+---
 0	| lParam
 4	| wParam
 8	| message
12	| hwnd
	+---

class tagCWPRETSTRUCT	size(20):
	+---
 0	| lResult
 4	| lParam
 8	| wParam
12	| message
16	| hwnd
	+---

class tagKBDLLHOOKSTRUCT	size(20):
	+---
 0	| vkCode
 4	| scanCode
 8	| flags
12	| time
16	| dwExtraInfo
	+---

class tagMSLLHOOKSTRUCT	size(24):
	+---
 0	| tagPOINT pt
 8	| mouseData
12	| flags
16	| time
20	| dwExtraInfo
	+---

class tagDEBUGHOOKINFO	size(20):
	+---
 0	| idThread
 4	| idThreadInstaller
 8	| lParam
12	| wParam
16	| code
	+---

class tagMOUSEHOOKSTRUCT	size(20):
	+---
 0	| tagPOINT pt
 8	| hwnd
12	| wHitTestCode
16	| dwExtraInfo
	+---

class tagHARDWAREHOOKSTRUCT	size(16):
	+---
 0	| hwnd
 4	| message
 8	| wParam
12	| lParam
	+---

class tagUSEROBJECTFLAGS	size(12):
	+---
 0	| fInherit
 4	| fReserved
 8	| dwFlags
	+---

class tagWNDCLASSEXA	size(48):
	+---
 0	| cbSize
 4	| style
 8	| lpfnWndProc
12	| cbClsExtra
16	| cbWndExtra
20	| hInstance
24	| hIcon
28	| hCursor
32	| hbrBackground
36	| lpszMenuName
40	| lpszClassName
44	| hIconSm
	+---

class tagWNDCLASSEXW	size(48):
	+---
 0	| cbSize
 4	| style
 8	| lpfnWndProc
12	| cbClsExtra
16	| cbWndExtra
20	| hInstance
24	| hIcon
28	| hCursor
32	| hbrBackground
36	| lpszMenuName
40	| lpszClassName
44	| hIconSm
	+---

class tagWNDCLASSA	size(40):
	+---
 0	| style
 4	| lpfnWndProc
 8	| cbClsExtra
12	| cbWndExtra
16	| hInstance
20	| hIcon
24	| hCursor
28	| hbrBackground
32	| lpszMenuName
36	| lpszClassName
	+---

class tagWNDCLASSW	size(40):
	+---
 0	| style
 4	| lpfnWndProc
 8	| cbClsExtra
12	| cbWndExtra
16	| hInstance
20	| hIcon
24	| hCursor
28	| hbrBackground
32	| lpszMenuName
36	| lpszClassName
	+---

class tagMSG	size(28):
	+---
 0	| hwnd
 4	| message
 8	| wParam
12	| lParam
16	| time
20	| tagPOINT pt
	+---

class tagMINMAXINFO	size(40):
	+---
 0	| tagPOINT ptReserved
 8	| tagPOINT ptMaxSize
16	| tagPOINT ptMaxPosition
24	| tagPOINT ptMinTrackSize
32	| tagPOINT ptMaxTrackSize
	+---

class tagCOPYDATASTRUCT	size(12):
	+---
 0	| dwData
 4	| cbData
 8	| lpData
	+---

class tagMDINEXTMENU	size(12):
	+---
 0	| hmenuIn
 4	| hmenuNext
 8	| hwndNext
	+---

class tagWINDOWPOS	size(28):
	+---
 0	| hwnd
 4	| hwndInsertAfter
 8	| x
12	| y
16	| cx
20	| cy
24	| flags
	+---

class tagNCCALCSIZE_PARAMS	size(52):
	+---
 0	| rgrc
48	| lppos
	+---

class tagTRACKMOUSEEVENT	size(16):
	+---
 0	| cbSize
 4	| dwFlags
 8	| hwndTrack
12	| dwHoverTime
	+---

class tagACCEL	size(6):
	+---
 0	| fVirt
  	| <alignment member> (size=1)
 2	| key
 4	| cmd
	+---

class tagPAINTSTRUCT	size(64):
	+---
 0	| hdc
 4	| fErase
 8	| tagRECT rcPaint
24	| fRestore
28	| fIncUpdate
32	| rgbReserved
	+---

class tagCREATESTRUCTA	size(48):
	+---
 0	| lpCreateParams
 4	| hInstance
 8	| hMenu
12	| hwndParent
16	| cy
20	| cx
24	| y
28	| x
32	| style
36	| lpszName
40	| lpszClass
44	| dwExStyle
	+---

class tagCREATESTRUCTW	size(48):
	+---
 0	| lpCreateParams
 4	| hInstance
 8	| hMenu
12	| hwndParent
16	| cy
20	| cx
24	| y
28	| x
32	| style
36	| lpszName
40	| lpszClass
44	| dwExStyle
	+---

class tagWINDOWPLACEMENT	size(44):
	+---
 0	| length
 4	| flags
 8	| showCmd
12	| tagPOINT ptMinPosition
20	| tagPOINT ptMaxPosition
28	| tagRECT rcNormalPosition
	+---

class tagNMHDR	size(12):
	+---
 0	| hwndFrom
 4	| idFrom
 8	| code
	+---

class tagSTYLESTRUCT	size(8):
	+---
 0	| styleOld
 4	| styleNew
	+---

class tagMEASUREITEMSTRUCT	size(24):
	+---
 0	| CtlType
 4	| CtlID
 8	| itemID
12	| itemWidth
16	| itemHeight
20	| itemData
	+---

class tagDRAWITEMSTRUCT	size(48):
	+---
 0	| CtlType
 4	| CtlID
 8	| itemID
12	| itemAction
16	| itemState
20	| hwndItem
24	| hDC
28	| tagRECT rcItem
44	| itemData
	+---

class tagDELETEITEMSTRUCT	size(20):
	+---
 0	| CtlType
 4	| CtlID
 8	| itemID
12	| hwndItem
16	| itemData
	+---

class tagCOMPAREITEMSTRUCT	size(32):
	+---
 0	| CtlType
 4	| CtlID
 8	| hwndItem
12	| itemID1
16	| itemData1
20	| itemID2
24	| itemData2
28	| dwLocaleId
	+---

class <anonymous-tag>	size(18):
	+---
 0	| style
 4	| dwExtendedStyle
 8	| cdit
10	| x
12	| y
14	| cx
16	| cy
	+---

class <anonymous-tag>	size(18):
	+---
 0	| style
 4	| dwExtendedStyle
 8	| x
10	| y
12	| cx
14	| cy
16	| id
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum DIALOG_CONTROL_DPI_CHANGE_BEHAVIORS>	size(1):
	+---
	+---

class _ENUM_FLAG_SIZED_INTEGER<enum DIALOG_DPI_CHANGE_BEHAVIORS>	size(1):
	+---
	+---

class tagTPMPARAMS	size(20):
	+---
 0	| cbSize
 4	| tagRECT rcExclude
	+---

class tagMENUITEMINFOA	size(44):
	+---
 0	| cbSize
 4	| fMask
 8	| fType
12	| fState
16	| wID
20	| hSubMenu
24	| hbmpChecked
28	| hbmpUnchecked
32	| dwItemData
36	| dwTypeData
40	| cch
	+---

class tagMENUITEMINFOW	size(44):
	+---
 0	| cbSize
 4	| fMask
 8	| fType
12	| fState
16	| wID
20	| hSubMenu
24	| hbmpChecked
28	| hbmpUnchecked
32	| dwItemData
36	| dwTypeData
40	| cch
	+---

class tagDROPSTRUCT	size(28):
	+---
 0	| hwndSource
 4	| hwndSink
 8	| wFmt
12	| dwData
16	| tagPOINT ptDrop
24	| dwControlData
	+---

class tagDRAWTEXTPARAMS	size(20):
	+---
 0	| cbSize
 4	| iTabLength
 8	| iLeftMargin
12	| iRightMargin
16	| uiLengthDrawn
	+---

class tagHELPINFO	size(28):
	+---
 0	| cbSize
 4	| iContextType
 8	| iCtrlId
12	| hItemHandle
16	| dwContextId
20	| tagPOINT MousePos
	+---

class tagMSGBOXPARAMSA	size(40):
	+---
 0	| cbSize
 4	| hwndOwner
 8	| hInstance
12	| lpszText
16	| lpszCaption
20	| dwStyle
24	| lpszIcon
28	| dwContextHelpId
32	| lpfnMsgBoxCallback
36	| dwLanguageId
	+---

class tagMSGBOXPARAMSW	size(40):
	+---
 0	| cbSize
 4	| hwndOwner
 8	| hInstance
12	| lpszText
16	| lpszCaption
20	| dwStyle
24	| lpszIcon
28	| dwContextHelpId
32	| lpfnMsgBoxCallback
36	| dwLanguageId
	+---

class <anonymous-tag>	size(4):
	+---
 0	| versionNumber
 2	| offset
	+---

class <anonymous-tag>	size(6):
	+---
 0	| mtOption
 2	| mtID
 4	| mtString
	+---

class _ICONINFO	size(20):
	+---
 0	| fIcon
 4	| xHotspot
 8	| yHotspot
12	| hbmMask
16	| hbmColor
	+---

class tagCURSORSHAPE	size(24):
	+---
 0	| xHotSpot
 4	| yHotSpot
 8	| cx
12	| cy
16	| cbWidth
20	| Planes
21	| BitsPixel
  	| <alignment member> (size=2)
	+---

class tagSCROLLINFO	size(28):
	+---
 0	| cbSize
 4	| fMask
 8	| nMin
12	| nMax
16	| nPage
20	| nPos
24	| nTrackPos
	+---

class tagMDICREATESTRUCTA	size(36):
	+---
 0	| szClass
 4	| szTitle
 8	| hOwner
12	| x
16	| y
20	| cx
24	| cy
28	| style
32	| lParam
	+---

class tagMDICREATESTRUCTW	size(36):
	+---
 0	| szClass
 4	| szTitle
 8	| hOwner
12	| x
16	| y
20	| cx
24	| cy
28	| style
32	| lParam
	+---

class tagCLIENTCREATESTRUCT	size(8):
	+---
 0	| hWindowMenu
 4	| idFirstChild
	+---

class tagMULTIKEYHELPA	size(8):
	+---
 0	| mkSize
 4	| mkKeylist
 5	| szKeyphrase
  	| <alignment member> (size=2)
	+---

class tagMULTIKEYHELPW	size(8):
	+---
 0	| mkSize
 4	| mkKeylist
 6	| szKeyphrase
	+---

class tagHELPWININFOA	size(28):
	+---
 0	| wStructSize
 4	| x
 8	| y
12	| dx
16	| dy
20	| wMax
24	| rgchMember
  	| <alignment member> (size=2)
	+---

class tagHELPWININFOW	size(28):
	+---
 0	| wStructSize
 4	| x
 8	| y
12	| dx
16	| dy
20	| wMax
24	| rgchMember
	+---

class tagNONCLIENTMETRICSA	size(340):
	+---
 0	| cbSize
 4	| iBorderWidth
 8	| iScrollWidth
12	| iScrollHeight
16	| iCaptionWidth
20	| iCaptionHeight
24	| tagLOGFONTA lfCaptionFont
84	| iSmCaptionWidth
88	| iSmCaptionHeight
92	| tagLOGFONTA lfSmCaptionFont
152	| iMenuWidth
156	| iMenuHeight
160	| tagLOGFONTA lfMenuFont
220	| tagLOGFONTA lfStatusFont
280	| tagLOGFONTA lfMessageFont
	+---

class tagNONCLIENTMETRICSW	size(500):
	+---
 0	| cbSize
 4	| iBorderWidth
 8	| iScrollWidth
12	| iScrollHeight
16	| iCaptionWidth
20	| iCaptionHeight
24	| tagLOGFONTW lfCaptionFont
116	| iSmCaptionWidth
120	| iSmCaptionHeight
124	| tagLOGFONTW lfSmCaptionFont
216	| iMenuWidth
220	| iMenuHeight
224	| tagLOGFONTW lfMenuFont
316	| tagLOGFONTW lfStatusFont
408	| tagLOGFONTW lfMessageFont
	+---

class tagMINIMIZEDMETRICS	size(20):
	+---
 0	| cbSize
 4	| iWidth
 8	| iHorzGap
12	| iVertGap
16	| iArrange
	+---

class tagICONMETRICSA	size(76):
	+---
 0	| cbSize
 4	| iHorzSpacing
 8	| iVertSpacing
12	| iTitleWrap
16	| tagLOGFONTA lfFont
	+---

class tagICONMETRICSW	size(108):
	+---
 0	| cbSize
 4	| iHorzSpacing
 8	| iVertSpacing
12	| iTitleWrap
16	| tagLOGFONTW lfFont
	+---

class tagANIMATIONINFO	size(8):
	+---
 0	| cbSize
 4	| iMinAnimate
	+---

class tagSERIALKEYSA	size(28):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszActivePort
12	| lpszPort
16	| iBaudRate
20	| iPortState
24	| iActive
	+---

class tagSERIALKEYSW	size(28):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszActivePort
12	| lpszPort
16	| iBaudRate
20	| iPortState
24	| iActive
	+---

class tagHIGHCONTRASTA	size(12):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszDefaultScheme
	+---

class tagHIGHCONTRASTW	size(12):
	+---
 0	| cbSize
 4	| dwFlags
 8	| lpszDefaultScheme
	+---

class _VIDEOPARAMETERS	size(356):
	+---
 0	| _GUID Guid
16	| dwOffset
20	| dwCommand
24	| dwFlags
28	| dwMode
32	| dwTVStandard
36	| dwAvailableModes
40	| dwAvailableTVStandard
44	| dwFlickerFilter
48	| dwOverScanX
52	| dwOverScanY
56	| dwMaxUnscaledX
60	| dwMaxUnscaledY
64	| dwPositionX
68	| dwPositionY
72	| dwBrightness
76	| dwContrast
80	| dwCPType
84	| dwCPCommand
88	| dwCPStandard
92	| dwCPKey
96	| bCP_APSTriggerBits
100	| bOEMCopyProtection
	+---

class tagFILTERKEYS	size(24):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iWaitMSec
12	| iDelayMSec
16	| iRepeatMSec
20	| iBounceMSec
	+---

class tagSTICKYKEYS	size(8):
	+---
 0	| cbSize
 4	| dwFlags
	+---

class tagMOUSEKEYS	size(28):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iMaxSpeed
12	| iTimeToMaxSpeed
16	| iCtrlSpeed
20	| dwReserved1
24	| dwReserved2
	+---

class tagACCESSTIMEOUT	size(12):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iTimeOutMSec
	+---

class tagSOUNDSENTRYA	size(48):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iFSTextEffect
12	| iFSTextEffectMSec
16	| iFSTextEffectColorBits
20	| iFSGrafEffect
24	| iFSGrafEffectMSec
28	| iFSGrafEffectColor
32	| iWindowsEffect
36	| iWindowsEffectMSec
40	| lpszWindowsEffectDLL
44	| iWindowsEffectOrdinal
	+---

class tagSOUNDSENTRYW	size(48):
	+---
 0	| cbSize
 4	| dwFlags
 8	| iFSTextEffect
12	| iFSTextEffectMSec
16	| iFSTextEffectColorBits
20	| iFSGrafEffect
24	| iFSGrafEffectMSec
28	| iFSGrafEffectColor
32	| iWindowsEffect
36	| iWindowsEffectMSec
40	| lpszWindowsEffectDLL
44	| iWindowsEffectOrdinal
	+---

class tagTOGGLEKEYS	size(8):
	+---
 0	| cbSize
 4	| dwFlags
	+---

class _cpinfo	size(20):
	+---
 0	| MaxCharSize
 4	| DefaultChar
 6	| LeadByte
  	| <alignment member> (size=2)
	+---

class _cpinfoexA	size(284):
	+---
 0	| MaxCharSize
 4	| DefaultChar
 6	| LeadByte
18	| UnicodeDefaultChar
20	| CodePage
24	| CodePageName
	+---

class _cpinfoexW	size(544):
	+---
 0	| MaxCharSize
 4	| DefaultChar
 6	| LeadByte
18	| UnicodeDefaultChar
20	| CodePage
24	| CodePageName
	+---

class _numberfmtA	size(24):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
	+---

class _numberfmtW	size(24):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
	+---

class _currencyfmtA	size(32):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
24	| PositiveOrder
28	| lpCurrencySymbol
	+---

class _currencyfmtW	size(32):
	+---
 0	| NumDigits
 4	| LeadingZero
 8	| Grouping
12	| lpDecimalSep
16	| lpThousandSep
20	| NegativeOrder
24	| PositiveOrder
28	| lpCurrencySymbol
	+---

class _nlsversioninfo	size(12):
	+---
 0	| dwNLSVersionInfoSize
 4	| dwNLSVersion
 8	| dwDefinedVersion
	+---

class _nlsversioninfoex	size(32):
	+---
 0	| dwNLSVersionInfoSize
 4	| dwNLSVersion
 8	| dwDefinedVersion
12	| dwEffectiveId
16	| _GUID guidCustomVersion
	+---

class _FILEMUIINFO	size(80):
	+---
 0	| dwSize
 4	| dwVersion
 8	| dwFileType
12	| pChecksum
28	| pServiceChecksum
44	| dwLanguageNameOffset
48	| dwTypeIDMainSize
52	| dwTypeIDMainOffset
56	| dwTypeNameMainOffset
60	| dwTypeIDMUISize
64	| dwTypeIDMUIOffset
68	| dwTypeNameMUIOffset
72	| abBuffer
	+---

class _COORD	size(4):
	+---
 0	| X
 2	| Y
	+---

class _SMALL_RECT	size(8):
	+---
 0	| Left
 2	| Top
 4	| Right
 6	| Bottom
	+---

class _KEY_EVENT_RECORD::<anonymous-tag>	size(2):
	+---
 0	| UnicodeChar
 0	| AsciiChar
	+---

class _KEY_EVENT_RECORD	size(16):
	+---
 0	| bKeyDown
 4	| wRepeatCount
 6	| wVirtualKeyCode
 8	| wVirtualScanCode
10	| <unnamed-type-uChar> uChar
12	| dwControlKeyState
	+---

class _MOUSE_EVENT_RECORD	size(16):
	+---
 0	| _COORD dwMousePosition
 4	| dwButtonState
 8	| dwControlKeyState
12	| dwEventFlags
	+---

class _WINDOW_BUFFER_SIZE_RECORD	size(4):
	+---
 0	| _COORD dwSize
	+---

class _MENU_EVENT_RECORD	size(4):
	+---
 0	| dwCommandId
	+---

class _FOCUS_EVENT_RECORD	size(4):
	+---
 0	| bSetFocus
	+---

class _INPUT_RECORD::<anonymous-tag>	size(16):
	+---
 0	| _KEY_EVENT_RECORD KeyEvent
 0	| _MOUSE_EVENT_RECORD MouseEvent
 0	| _WINDOW_BUFFER_SIZE_RECORD WindowBufferSizeEvent
 0	| _MENU_EVENT_RECORD MenuEvent
 0	| _FOCUS_EVENT_RECORD FocusEvent
	+---

class _INPUT_RECORD	size(20):
	+---
 0	| EventType
  	| <alignment member> (size=2)
 4	| <unnamed-type-Event> Event
	+---

class _CHAR_INFO::<anonymous-tag>	size(2):
	+---
 0	| UnicodeChar
 0	| AsciiChar
	+---

class _CHAR_INFO	size(4):
	+---
 0	| <unnamed-type-Char> Char
 2	| Attributes
	+---

class _CONSOLE_FONT_INFO	size(8):
	+---
 0	| nFont
 4	| _COORD dwFontSize
	+---

class _CONSOLE_READCONSOLE_CONTROL	size(16):
	+---
 0	| nLength
 4	| nInitialChars
 8	| dwCtrlWakeupMask
12	| dwControlKeyState
	+---

class _CONSOLE_CURSOR_INFO	size(8):
	+---
 0	| dwSize
 4	| bVisible
	+---

class _CONSOLE_SCREEN_BUFFER_INFO	size(22):
	+---
 0	| _COORD dwSize
 4	| _COORD dwCursorPosition
 8	| wAttributes
10	| _SMALL_RECT srWindow
18	| _COORD dwMaximumWindowSize
	+---

class _CONSOLE_SCREEN_BUFFER_INFOEX	size(96):
	+---
 0	| cbSize
 4	| _COORD dwSize
 8	| _COORD dwCursorPosition
12	| wAttributes
14	| _SMALL_RECT srWindow
22	| _COORD dwMaximumWindowSize
26	| wPopupAttributes
28	| bFullscreenSupported
32	| ColorTable
	+---

class tagVS_FIXEDFILEINFO	size(52):
	+---
 0	| dwSignature
 4	| dwStrucVersion
 8	| dwFileVersionMS
12	| dwFileVersionLS
16	| dwProductVersionMS
20	| dwProductVersionLS
24	| dwFileFlagsMask
28	| dwFileFlags
32	| dwFileOS
36	| dwFileType
40	| dwFileSubtype
44	| dwFileDateMS
48	| dwFileDateLS
	+---

class val_context	size(12):
	+---
 0	| valuelen
 4	| value_context
 8	| val_buff_ptr
	+---

class pvalueA	size(16):
	+---
 0	| pv_valuename
 4	| pv_valuelen
 8	| pv_value_context
12	| pv_type
	+---

class pvalueW	size(16):
	+---
 0	| pv_valuename
 4	| pv_valuelen
 8	| pv_value_context
12	| pv_type
	+---

class provider_info	size(24):
	+---
 0	| pi_R0_1val
 4	| pi_R0_allvals
 8	| pi_R3_1val
12	| pi_R3_allvals
16	| pi_flags
20	| pi_key_context
	+---

class value_entA	size(16):
	+---
 0	| ve_valuename
 4	| ve_valuelen
 8	| ve_valueptr
12	| ve_type
	+---

class value_entW	size(16):
	+---
 0	| ve_valuename
 4	| ve_valuelen
 8	| ve_valueptr
12	| ve_type
	+---

class _NETRESOURCEA	size(32):
	+---
 0	| dwScope
 4	| dwType
 8	| dwDisplayType
12	| dwUsage
16	| lpLocalName
20	| lpRemoteName
24	| lpComment
28	| lpProvider
	+---

class _NETRESOURCEW	size(32):
	+---
 0	| dwScope
 4	| dwType
 8	| dwDisplayType
12	| dwUsage
16	| lpLocalName
20	| lpRemoteName
24	| lpComment
28	| lpProvider
	+---

class _CONNECTDLGSTRUCTA	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpConnRes
12	| dwFlags
16	| dwDevNum
	+---

class _CONNECTDLGSTRUCTW	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpConnRes
12	| dwFlags
16	| dwDevNum
	+---

class _DISCDLGSTRUCTA	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpLocalName
12	| lpRemoteName
16	| dwFlags
	+---

class _DISCDLGSTRUCTW	size(20):
	+---
 0	| cbStructure
 4	| hwndOwner
 8	| lpLocalName
12	| lpRemoteName
16	| dwFlags
	+---

class _UNIVERSAL_NAME_INFOA	size(4):
	+---
 0	| lpUniversalName
	+---

class _UNIVERSAL_NAME_INFOW	size(4):
	+---
 0	| lpUniversalName
	+---

class _REMOTE_NAME_INFOA	size(12):
	+---
 0	| lpUniversalName
 4	| lpConnectionName
 8	| lpRemainingPath
	+---

class _REMOTE_NAME_INFOW	size(12):
	+---
 0	| lpUniversalName
 4	| lpConnectionName
 8	| lpRemainingPath
	+---

class _NETINFOSTRUCT	size(32):
	+---
 0	| cbStructure
 4	| dwProviderVersion
 8	| dwStatus
12	| dwCharacteristics
16	| dwHandle
20	| wNetType
  	| <alignment member> (size=2)
24	| dwPrinters
28	| dwDrives
	+---

class _NETCONNECTINFOSTRUCT	size(20):
	+---
 0	| cbStructure
 4	| dwFlags
 8	| dwSpeed
12	| dwDelay
16	| dwOptDataSize
	+---

class <anonymous-tag>	size(8):
	+---
 0	| Data
	+---

class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM::<anonymous-tag>::<anonymous-tag>	size(8):
	+---
 0	| DataOffset
 4	| Data
  	| <alignment member> (size=3)
	+---

class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM::<anonymous-tag>	size(8):
	+---
 0	| SERVICE_TRIGGER_CUSTOM_STATE_ID CustomStateId
 0	| <unnamed-type-s> s
	+---

class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM	size(8):
	+---
 0	| <unnamed-type-u> u
	+---

class _SERVICE_DESCRIPTIONA	size(4):
	+---
 0	| lpDescription
	+---

class _SERVICE_DESCRIPTIONW	size(4):
	+---
 0	| lpDescription
	+---

class _SC_ACTION	size(8):
	+---
 0	| _SC_ACTION_TYPE Type
 4	| Delay
	+---

class _SERVICE_FAILURE_ACTIONSA	size(20):
	+---
 0	| dwResetPeriod
 4	| lpRebootMsg
 8	| lpCommand
12	| cActions
16	| lpsaActions
	+---

class _SERVICE_FAILURE_ACTIONSW	size(20):
	+---
 0	| dwResetPeriod
 4	| lpRebootMsg
 8	| lpCommand
12	| cActions
16	| lpsaActions
	+---

class _SERVICE_DELAYED_AUTO_START_INFO	size(4):
	+---
 0	| fDelayedAutostart
	+---

class _SERVICE_FAILURE_ACTIONS_FLAG	size(4):
	+---
 0	| fFailureActionsOnNonCrashFailures
	+---

class _SERVICE_SID_INFO	size(4):
	+---
 0	| dwServiceSidType
	+---

class _SERVICE_REQUIRED_PRIVILEGES_INFOA	size(4):
	+---
 0	| pmszRequiredPrivileges
	+---

class _SERVICE_REQUIRED_PRIVILEGES_INFOW	size(4):
	+---
 0	| pmszRequiredPrivileges
	+---

class _SERVICE_PRESHUTDOWN_INFO	size(4):
	+---
 0	| dwPreshutdownTimeout
	+---

class _SERVICE_TRIGGER_SPECIFIC_DATA_ITEM	size(12):
	+---
 0	| dwDataType
 4	| cbData
 8	| pData
	+---

class _SERVICE_TRIGGER	size(20):
	+---
 0	| dwTriggerType
 4	| dwAction
 8	| pTriggerSubtype
12	| cDataItems
16	| pDataItems
	+---

class _SERVICE_TRIGGER_INFO	size(12):
	+---
 0	| cTriggers
 4	| pTriggers
 8	| pReserved
	+---

class _SERVICE_PREFERRED_NODE_INFO	size(4):
	+---
 0	| usPreferredNode
 2	| fDelete
  	| <alignment member> (size=1)
	+---

class _SERVICE_TIMECHANGE_INFO	size(16):
	+---
 0	| _LARGE_INTEGER liNewTime
 8	| _LARGE_INTEGER liOldTime
	+---

class _SERVICE_LAUNCH_PROTECTED_INFO	size(4):
	+---
 0	| dwLaunchProtected
	+---

class SC_HANDLE__	size(4):
	+---
 0	| unused
	+---

class SERVICE_STATUS_HANDLE__	size(4):
	+---
 0	| unused
	+---

class _SERVICE_STATUS	size(28):
	+---
 0	| dwServiceType
 4	| dwCurrentState
 8	| dwControlsAccepted
12	| dwWin32ExitCode
16	| dwServiceSpecificExitCode
20	| dwCheckPoint
24	| dwWaitHint
	+---

class _SERVICE_STATUS_PROCESS	size(36):
	+---
 0	| dwServiceType
 4	| dwCurrentState
 8	| dwControlsAccepted
12	| dwWin32ExitCode
16	| dwServiceSpecificExitCode
20	| dwCheckPoint
24	| dwWaitHint
28	| dwProcessId
32	| dwServiceFlags
	+---

class _ENUM_SERVICE_STATUSA	size(36):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS ServiceStatus
	+---

class _ENUM_SERVICE_STATUSW	size(36):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS ServiceStatus
	+---

class _ENUM_SERVICE_STATUS_PROCESSA	size(44):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS_PROCESS ServiceStatusProcess
	+---

class _ENUM_SERVICE_STATUS_PROCESSW	size(44):
	+---
 0	| lpServiceName
 4	| lpDisplayName
 8	| _SERVICE_STATUS_PROCESS ServiceStatusProcess
	+---

class _QUERY_SERVICE_LOCK_STATUSA	size(12):
	+---
 0	| fIsLocked
 4	| lpLockOwner
 8	| dwLockDuration
	+---

class _QUERY_SERVICE_LOCK_STATUSW	size(12):
	+---
 0	| fIsLocked
 4	| lpLockOwner
 8	| dwLockDuration
	+---

class _QUERY_SERVICE_CONFIGA	size(36):
	+---
 0	| dwServiceType
 4	| dwStartType
 8	| dwErrorControl
12	| lpBinaryPathName
16	| lpLoadOrderGroup
20	| dwTagId
24	| lpDependencies
28	| lpServiceStartName
32	| lpDisplayName
	+---

class _QUERY_SERVICE_CONFIGW	size(36):
	+---
 0	| dwServiceType
 4	| dwStartType
 8	| dwErrorControl
12	| lpBinaryPathName
16	| lpLoadOrderGroup
20	| dwTagId
24	| lpDependencies
28	| lpServiceStartName
32	| lpDisplayName
	+---

class _SERVICE_TABLE_ENTRYA	size(8):
	+---
 0	| lpServiceName
 4	| lpServiceProc
	+---

class _SERVICE_TABLE_ENTRYW	size(8):
	+---
 0	| lpServiceName
 4	| lpServiceProc
	+---

class _SERVICE_NOTIFY_1	size(52):
	+---
 0	| dwVersion
 4	| pfnNotifyCallback
 8	| pContext
12	| dwNotificationStatus
16	| _SERVICE_STATUS_PROCESS ServiceStatus
	+---

class _SERVICE_NOTIFY_2A	size(60):
	+---
 0	| dwVersion
 4	| pfnNotifyCallback
 8	| pContext
12	| dwNotificationStatus
16	| _SERVICE_STATUS_PROCESS ServiceStatus
52	| dwNotificationTriggered
56	| pszServiceNames
	+---

class _SERVICE_NOTIFY_2W	size(60):
	+---
 0	| dwVersion
 4	| pfnNotifyCallback
 8	| pContext
12	| dwNotificationStatus
16	| _SERVICE_STATUS_PROCESS ServiceStatus
52	| dwNotificationTriggered
56	| pszServiceNames
	+---

class _SERVICE_CONTROL_STATUS_REASON_PARAMSA	size(44):
	+---
 0	| dwReason
 4	| pszComment
 8	| _SERVICE_STATUS_PROCESS ServiceStatus
	+---

class _SERVICE_CONTROL_STATUS_REASON_PARAMSW	size(44):
	+---
 0	| dwReason
 4	| pszComment
 8	| _SERVICE_STATUS_PROCESS ServiceStatus
	+---

class _SERVICE_START_REASON	size(4):
	+---
 0	| dwReason
	+---

class _MODEMDEVCAPS	size(80):
	+---
 0	| dwActualSize
 4	| dwRequiredSize
 8	| dwDevSpecificOffset
12	| dwDevSpecificSize
16	| dwModemProviderVersion
20	| dwModemManufacturerOffset
24	| dwModemManufacturerSize
28	| dwModemModelOffset
32	| dwModemModelSize
36	| dwModemVersionOffset
40	| dwModemVersionSize
44	| dwDialOptions
48	| dwCallSetupFailTimer
52	| dwInactivityTimeout
56	| dwSpeakerVolume
60	| dwSpeakerMode
64	| dwModemOptions
68	| dwMaxDTERate
72	| dwMaxDCERate
76	| abVariablePortion
  	| <alignment member> (size=3)
	+---

class _MODEMSETTINGS	size(48):
	+---
 0	| dwActualSize
 4	| dwRequiredSize
 8	| dwDevSpecificOffset
12	| dwDevSpecificSize
16	| dwCallSetupFailTimer
20	| dwInactivityTimeout
24	| dwSpeakerVolume
28	| dwSpeakerMode
32	| dwPreferredModemOptions
36	| dwNegotiatedModemOptions
40	| dwNegotiatedDCERate
44	| abVariablePortion
  	| <alignment member> (size=3)
	+---

class tagCOMPOSITIONFORM	size(28):
	+---
 0	| dwStyle
 4	| tagPOINT ptCurrentPos
12	| tagRECT rcArea
	+---

class tagCANDIDATEFORM	size(32):
	+---
 0	| dwIndex
 4	| dwStyle
 8	| tagPOINT ptCurrentPos
16	| tagRECT rcArea
	+---

class tagCANDIDATELIST	size(28):
	+---
 0	| dwSize
 4	| dwStyle
 8	| dwCount
12	| dwSelection
16	| dwPageStart
20	| dwPageSize
24	| dwOffset
	+---

class tagREGISTERWORDA	size(8):
	+---
 0	| lpReading
 4	| lpWord
	+---

class tagREGISTERWORDW	size(8):
	+---
 0	| lpReading
 4	| lpWord
	+---

class tagSTYLEBUFA	size(36):
	+---
 0	| dwStyle
 4	| szDescription
	+---

class tagSTYLEBUFW	size(68):
	+---
 0	| dwStyle
 4	| szDescription
	+---

class _PROPSHEETPAGEA_V1::<anonymous-tag>	size(4):
	+---
 0	| pszTemplate
 0	| pResource
	+---

class _PROPSHEETPAGEA_V1::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETPAGEA_V1	size(40):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hInstance
  	| <anonymous-tag> <alignment member> (size=12)
12	| pszTemplate
12	| pResource
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszTitle
24	| pfnDlgProc
28	| lParam
32	| pfnCallback
36	| pcRefParent
	+---

class _PROPSHEETPAGEA::<anonymous-tag>	size(4):
	+---
 0	| pszTemplate
 0	| pResource
	+---

class _PROPSHEETPAGEA::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETPAGEA	size(48):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hInstance
  	| <anonymous-tag> <alignment member> (size=12)
12	| pszTemplate
12	| pResource
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszTitle
24	| pfnDlgProc
28	| lParam
32	| pfnCallback
36	| pcRefParent
40	| pszHeaderTitle
44	| pszHeaderSubTitle
	+---

class _PROPSHEETPAGEA_V3::<anonymous-tag>	size(4):
	+---
 0	| pszTemplate
 0	| pResource
	+---

class _PROPSHEETPAGEA_V3::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETPAGEA_V3	size(52):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hInstance
  	| <anonymous-tag> <alignment member> (size=12)
12	| pszTemplate
12	| pResource
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszTitle
24	| pfnDlgProc
28	| lParam
32	| pfnCallback
36	| pcRefParent
40	| pszHeaderTitle
44	| pszHeaderSubTitle
48	| hActCtx
	+---

class _PROPSHEETPAGEW_V1::<anonymous-tag>	size(4):
	+---
 0	| pszTemplate
 0	| pResource
	+---

class _PROPSHEETPAGEW_V1::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETPAGEW_V1	size(40):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hInstance
  	| <anonymous-tag> <alignment member> (size=12)
12	| pszTemplate
12	| pResource
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszTitle
24	| pfnDlgProc
28	| lParam
32	| pfnCallback
36	| pcRefParent
	+---

class _PROPSHEETPAGEW::<anonymous-tag>	size(4):
	+---
 0	| pszTemplate
 0	| pResource
	+---

class _PROPSHEETPAGEW::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETPAGEW	size(48):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hInstance
  	| <anonymous-tag> <alignment member> (size=12)
12	| pszTemplate
12	| pResource
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszTitle
24	| pfnDlgProc
28	| lParam
32	| pfnCallback
36	| pcRefParent
40	| pszHeaderTitle
44	| pszHeaderSubTitle
	+---

class _PROPSHEETPAGEW_V3::<anonymous-tag>	size(4):
	+---
 0	| pszTemplate
 0	| pResource
	+---

class _PROPSHEETPAGEW_V3::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETPAGEW_V3	size(52):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hInstance
  	| <anonymous-tag> <alignment member> (size=12)
12	| pszTemplate
12	| pResource
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszTitle
24	| pfnDlgProc
28	| lParam
32	| pfnCallback
36	| pcRefParent
40	| pszHeaderTitle
44	| pszHeaderSubTitle
48	| hActCtx
	+---

class _PROPSHEETHEADERA_V1::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETHEADERA_V1::<anonymous-tag>	size(4):
	+---
 0	| nStartPage
 0	| pStartPage
	+---

class _PROPSHEETHEADERA_V1::<anonymous-tag>	size(4):
	+---
 0	| ppsp
 0	| phpage
	+---

class _PROPSHEETHEADERA_V1	size(40):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hwndParent
12	| hInstance
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszCaption
24	| nPages
  	| <anonymous-tag> <alignment member> (size=28)
28	| nStartPage
28	| pStartPage
  	| <anonymous-tag> <alignment member> (size=32)
32	| ppsp
32	| phpage
36	| pfnCallback
	+---

class _PROPSHEETHEADERA_V2::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETHEADERA_V2::<anonymous-tag>	size(4):
	+---
 0	| nStartPage
 0	| pStartPage
	+---

class _PROPSHEETHEADERA_V2::<anonymous-tag>	size(4):
	+---
 0	| ppsp
 0	| phpage
	+---

class _PROPSHEETHEADERA_V2::<anonymous-tag>	size(4):
	+---
 0	| hbmWatermark
 0	| pszbmWatermark
	+---

class _PROPSHEETHEADERA_V2::<anonymous-tag>	size(4):
	+---
 0	| hbmHeader
 0	| pszbmHeader
	+---

class _PROPSHEETHEADERA_V2	size(52):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hwndParent
12	| hInstance
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszCaption
24	| nPages
  	| <anonymous-tag> <alignment member> (size=28)
28	| nStartPage
28	| pStartPage
  	| <anonymous-tag> <alignment member> (size=32)
32	| ppsp
32	| phpage
36	| pfnCallback
  	| <anonymous-tag> <alignment member> (size=40)
40	| hbmWatermark
40	| pszbmWatermark
44	| hplWatermark
  	| <anonymous-tag> <alignment member> (size=48)
48	| hbmHeader
48	| pszbmHeader
	+---

class _PROPSHEETHEADERW_V1::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETHEADERW_V1::<anonymous-tag>	size(4):
	+---
 0	| nStartPage
 0	| pStartPage
	+---

class _PROPSHEETHEADERW_V1::<anonymous-tag>	size(4):
	+---
 0	| ppsp
 0	| phpage
	+---

class _PROPSHEETHEADERW_V1	size(40):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hwndParent
12	| hInstance
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszCaption
24	| nPages
  	| <anonymous-tag> <alignment member> (size=28)
28	| nStartPage
28	| pStartPage
  	| <anonymous-tag> <alignment member> (size=32)
32	| ppsp
32	| phpage
36	| pfnCallback
	+---

class _PROPSHEETHEADERW_V2::<anonymous-tag>	size(4):
	+---
 0	| hIcon
 0	| pszIcon
	+---

class _PROPSHEETHEADERW_V2::<anonymous-tag>	size(4):
	+---
 0	| nStartPage
 0	| pStartPage
	+---

class _PROPSHEETHEADERW_V2::<anonymous-tag>	size(4):
	+---
 0	| ppsp
 0	| phpage
	+---

class _PROPSHEETHEADERW_V2::<anonymous-tag>	size(4):
	+---
 0	| hbmWatermark
 0	| pszbmWatermark
	+---

class _PROPSHEETHEADERW_V2::<anonymous-tag>	size(4):
	+---
 0	| hbmHeader
 0	| pszbmHeader
	+---

class _PROPSHEETHEADERW_V2	size(52):
	+---
 0	| dwSize
 4	| dwFlags
 8	| hwndParent
12	| hInstance
  	| <anonymous-tag> <alignment member> (size=16)
16	| hIcon
16	| pszIcon
20	| pszCaption
24	| nPages
  	| <anonymous-tag> <alignment member> (size=28)
28	| nStartPage
28	| pStartPage
  	| <anonymous-tag> <alignment member> (size=32)
32	| ppsp
32	| phpage
36	| pfnCallback
  	| <anonymous-tag> <alignment member> (size=40)
40	| hbmWatermark
40	| pszbmWatermark
44	| hplWatermark
  	| <anonymous-tag> <alignment member> (size=48)
48	| hbmHeader
48	| pszbmHeader
	+---

class _PSHNOTIFY	size(16):
	+---
 0	| tagNMHDR hdr
12	| lParam
	+---

class tagINITCOMMONCONTROLSEX	size(8):
	+---
 0	| dwSize
 4	| dwICC
	+---

class tagCOLORSCHEME	size(12):
	+---
 0	| dwSize
 4	| clrBtnHighlight
 8	| clrBtnShadow
	+---

class tagNMTOOLTIPSCREATED	size(16):
	+---
 0	| tagNMHDR hdr
12	| hwndToolTips
	+---

class tagNMMOUSE	size(32):
	+---
 0	| tagNMHDR hdr
12	| dwItemSpec
16	| dwItemData
20	| tagPOINT pt
28	| dwHitInfo
	+---

class tagNMOBJECTNOTIFY	size(32):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| piid
20	| pObject
24	| hResult
28	| dwFlags
	+---

class tagNMKEY	size(20):
	+---
 0	| tagNMHDR hdr
12	| nVKey
16	| uFlags
	+---

class tagNMCHAR	size(24):
	+---
 0	| tagNMHDR hdr
12	| ch
16	| dwItemPrev
20	| dwItemNext
	+---

class tagNMCUSTOMDRAWINFO	size(48):
	+---
 0	| tagNMHDR hdr
12	| dwDrawStage
16	| hdc
20	| tagRECT rc
36	| dwItemSpec
40	| uItemState
44	| lItemlParam
	+---

class tagNMTTCUSTOMDRAW	size(52):
	+---
 0	| tagNMCUSTOMDRAWINFO nmcd
48	| uDrawFlags
	+---

class tagNMCUSTOMSPLITRECTINFO	size(60):
	+---
 0	| tagNMHDR hdr
12	| tagRECT rcClient
28	| tagRECT rcButton
44	| tagRECT rcSplit
	+---

class _IMAGELISTDRAWPARAMS	size(56):
	+---
 0	| cbSize
 4	| himl
 8	| i
12	| hdcDst
16	| x
20	| y
24	| cx
28	| cy
32	| xBitmap
36	| yBitmap
40	| rgbBk
44	| rgbFg
48	| fStyle
52	| dwRop
	+---

class _IMAGEINFO	size(32):
	+---
 0	| hbmImage
 4	| hbmMask
 8	| Unused1
12	| Unused2
16	| tagRECT rcImage
	+---

class _HD_TEXTFILTERA	size(8):
	+---
 0	| pszText
 4	| cchTextMax
	+---

class _HD_TEXTFILTERW	size(8):
	+---
 0	| pszText
 4	| cchTextMax
	+---

class _HD_ITEMA	size(44):
	+---
 0	| mask
 4	| cxy
 8	| pszText
12	| hbm
16	| cchTextMax
20	| fmt
24	| lParam
28	| iImage
32	| iOrder
36	| type
40	| pvFilter
	+---

class _HD_ITEMW	size(44):
	+---
 0	| mask
 4	| cxy
 8	| pszText
12	| hbm
16	| cchTextMax
20	| fmt
24	| lParam
28	| iImage
32	| iOrder
36	| type
40	| pvFilter
	+---

class _HD_LAYOUT	size(8):
	+---
 0	| prc
 4	| pwpos
	+---

class _HD_HITTESTINFO	size(16):
	+---
 0	| tagPOINT pt
 8	| flags
12	| iItem
	+---

class tagNMHEADERA	size(24):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| iButton
20	| pitem
	+---

class tagNMHEADERW	size(24):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| iButton
20	| pitem
	+---

class tagNMHDDISPINFOW	size(36):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| mask
20	| pszText
24	| cchTextMax
28	| iImage
32	| lParam
	+---

class tagNMHDDISPINFOA	size(36):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| mask
20	| pszText
24	| cchTextMax
28	| iImage
32	| lParam
	+---

class tagNMHDFILTERBTNCLICK	size(32):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| tagRECT rc
	+---

class _TBBUTTON	size(20):
	+---
 0	| iBitmap
 4	| idCommand
 8	| fsState
 9	| fsStyle
10	| bReserved
12	| dwData
16	| iString
	+---

class _COLORMAP	size(8):
	+---
 0	| from
 4	| to
	+---

class _NMTBCUSTOMDRAW	size(108):
	+---
 0	| tagNMCUSTOMDRAWINFO nmcd
48	| hbrMonoDither
52	| hbrLines
56	| hpenLines
60	| clrText
64	| clrMark
68	| clrTextHighlight
72	| clrBtnFace
76	| clrBtnHighlight
80	| clrHighlightHotTrack
84	| tagRECT rcText
100	| nStringBkMode
104	| nHLStringBkMode
	+---

class tagTBADDBITMAP	size(8):
	+---
 0	| hInst
 4	| nID
	+---

class tagTBSAVEPARAMSA	size(12):
	+---
 0	| hkr
 4	| pszSubKey
 8	| pszValueName
	+---

class tagTBSAVEPARAMSW	size(12):
	+---
 0	| hkr
 4	| pszSubKey
 8	| pszValueName
	+---

class <anonymous-tag>	size(8):
	+---
 0	| iButton
 4	| dwFlags
	+---

class <anonymous-tag>	size(20):
	+---
 0	| hInstOld
 4	| nIDOld
 8	| hInstNew
12	| nIDNew
16	| nButtons
	+---

class <anonymous-tag>	size(32):
	+---
 0	| cbSize
 4	| dwMask
 8	| idCommand
12	| iImage
16	| fsState
17	| fsStyle
18	| cx
20	| lParam
24	| pszText
28	| cchText
	+---

class <anonymous-tag>	size(32):
	+---
 0	| cbSize
 4	| dwMask
 8	| idCommand
12	| iImage
16	| fsState
17	| fsStyle
18	| cx
20	| lParam
24	| pszText
28	| cchText
	+---

class tagNMTBHOTITEM	size(24):
	+---
 0	| tagNMHDR hdr
12	| idOld
16	| idNew
20	| dwFlags
	+---

class tagNMTBSAVE	size(52):
	+---
 0	| tagNMHDR hdr
12	| pData
16	| pCurrent
20	| cbData
24	| iItem
28	| cButtons
32	| _TBBUTTON tbButton
	+---

class tagNMTBRESTORE	size(56):
	+---
 0	| tagNMHDR hdr
12	| pData
16	| pCurrent
20	| cbData
24	| iItem
28	| cButtons
32	| cbBytesPerRecord
36	| _TBBUTTON tbButton
	+---

class tagNMTBGETINFOTIPA	size(28):
	+---
 0	| tagNMHDR hdr
12	| pszText
16	| cchTextMax
20	| iItem
24	| lParam
	+---

class tagNMTBGETINFOTIPW	size(28):
	+---
 0	| tagNMHDR hdr
12	| pszText
16	| cchTextMax
20	| iItem
24	| lParam
	+---

class <anonymous-tag>	size(36):
	+---
 0	| tagNMHDR hdr
12	| dwMask
16	| idCommand
20	| lParam
24	| iImage
28	| pszText
32	| cchText
	+---

class <anonymous-tag>	size(36):
	+---
 0	| tagNMHDR hdr
12	| dwMask
16	| idCommand
20	| lParam
24	| iImage
28	| pszText
32	| cchText
	+---

class tagNMTOOLBARA	size(60):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| _TBBUTTON tbButton
36	| cchText
40	| pszText
44	| tagRECT rcButton
	+---

class tagNMTOOLBARW	size(60):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| _TBBUTTON tbButton
36	| cchText
40	| pszText
44	| tagRECT rcButton
	+---

class tagREBARINFO	size(12):
	+---
 0	| cbSize
 4	| fMask
 8	| himl
	+---

class tagREBARBANDINFOA	size(80):
	+---
 0	| cbSize
 4	| fMask
 8	| fStyle
12	| clrFore
16	| clrBack
20	| lpText
24	| cch
28	| iImage
32	| hwndChild
36	| cxMinChild
40	| cyMinChild
44	| cx
48	| hbmBack
52	| wID
56	| cyChild
60	| cyMaxChild
64	| cyIntegral
68	| cxIdeal
72	| lParam
76	| cxHeader
	+---

class tagREBARBANDINFOW	size(80):
	+---
 0	| cbSize
 4	| fMask
 8	| fStyle
12	| clrFore
16	| clrBack
20	| lpText
24	| cch
28	| iImage
32	| hwndChild
36	| cxMinChild
40	| cyMinChild
44	| cx
48	| hbmBack
52	| wID
56	| cyChild
60	| cyMaxChild
64	| cyIntegral
68	| cxIdeal
72	| lParam
76	| cxHeader
	+---

class tagNMREBARCHILDSIZE	size(52):
	+---
 0	| tagNMHDR hdr
12	| uBand
16	| wID
20	| tagRECT rcChild
36	| tagRECT rcBand
	+---

class tagNMREBAR	size(32):
	+---
 0	| tagNMHDR hdr
12	| dwMask
16	| uBand
20	| fStyle
24	| wID
28	| lParam
	+---

class tagNMRBAUTOSIZE	size(48):
	+---
 0	| tagNMHDR hdr
12	| fChanged
16	| tagRECT rcTarget
32	| tagRECT rcActual
	+---

class tagNMREBARCHEVRON	size(44):
	+---
 0	| tagNMHDR hdr
12	| uBand
16	| wID
20	| lParam
24	| tagRECT rc
40	| lParamNM
	+---

class _RB_HITTESTINFO	size(16):
	+---
 0	| tagPOINT pt
 8	| flags
12	| iBand
	+---

class tagTOOLINFOA	size(44):
	+---
 0	| cbSize
 4	| uFlags
 8	| hwnd
12	| uId
16	| tagRECT rect
32	| hinst
36	| lpszText
40	| lParam
	+---

class tagTOOLINFOW	size(44):
	+---
 0	| cbSize
 4	| uFlags
 8	| hwnd
12	| uId
16	| tagRECT rect
32	| hinst
36	| lpszText
40	| lParam
	+---

class _TT_HITTESTINFOA	size(56):
	+---
 0	| hwnd
 4	| tagPOINT pt
12	| tagTOOLINFOA ti
	+---

class _TT_HITTESTINFOW	size(56):
	+---
 0	| hwnd
 4	| tagPOINT pt
12	| tagTOOLINFOW ti
	+---

class tagNMTTDISPINFOA	size(108):
	+---
 0	| tagNMHDR hdr
12	| lpszText
16	| szText
96	| hinst
100	| uFlags
104	| lParam
	+---

class tagNMTTDISPINFOW	size(188):
	+---
 0	| tagNMHDR hdr
12	| lpszText
16	| szText
176	| hinst
180	| uFlags
184	| lParam
	+---

class tagDRAGLISTINFO	size(16):
	+---
 0	| uNotification
 4	| hWnd
 8	| tagPOINT ptCursor
	+---

class _UDACCEL	size(8):
	+---
 0	| nSec
 4	| nInc
	+---

class _NM_UPDOWN	size(20):
	+---
 0	| tagNMHDR hdr
12	| iPos
16	| iDelta
	+---

class <anonymous-tag>	size(8):
	+---
 0	| iLow
 4	| iHigh
	+---

class tagLVITEMA	size(40):
	+---
 0	| mask
 4	| iItem
 8	| iSubItem
12	| state
16	| stateMask
20	| pszText
24	| cchTextMax
28	| iImage
32	| lParam
36	| iIndent
	+---

class tagLVITEMW	size(40):
	+---
 0	| mask
 4	| iItem
 8	| iSubItem
12	| state
16	| stateMask
20	| pszText
24	| cchTextMax
28	| iImage
32	| lParam
36	| iIndent
	+---

class tagLVFINDINFOA	size(24):
	+---
 0	| flags
 4	| psz
 8	| lParam
12	| tagPOINT pt
20	| vkDirection
	+---

class tagLVFINDINFOW	size(24):
	+---
 0	| flags
 4	| psz
 8	| lParam
12	| tagPOINT pt
20	| vkDirection
	+---

class tagLVHITTESTINFO	size(20):
	+---
 0	| tagPOINT pt
 8	| flags
12	| iItem
16	| iSubItem
	+---

class tagLVCOLUMNA	size(32):
	+---
 0	| mask
 4	| fmt
 8	| cx
12	| pszText
16	| cchTextMax
20	| iSubItem
24	| iImage
28	| iOrder
	+---

class tagLVCOLUMNW	size(32):
	+---
 0	| mask
 4	| fmt
 8	| cx
12	| pszText
16	| cchTextMax
20	| iSubItem
24	| iImage
28	| iOrder
	+---

class tagLVBKIMAGEA	size(24):
	+---
 0	| ulFlags
 4	| hbm
 8	| pszImage
12	| cchImageMax
16	| xOffsetPercent
20	| yOffsetPercent
	+---

class tagLVBKIMAGEW	size(24):
	+---
 0	| ulFlags
 4	| hbm
 8	| pszImage
12	| cchImageMax
16	| xOffsetPercent
20	| yOffsetPercent
	+---

class tagNMLISTVIEW	size(44):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| iSubItem
20	| uNewState
24	| uOldState
28	| uChanged
32	| tagPOINT ptAction
40	| lParam
	+---

class tagNMITEMACTIVATE	size(48):
	+---
 0	| tagNMHDR hdr
12	| iItem
16	| iSubItem
20	| uNewState
24	| uOldState
28	| uChanged
32	| tagPOINT ptAction
40	| lParam
44	| uKeyFlags
	+---

class tagNMLVCUSTOMDRAW	size(60):
	+---
 0	| tagNMCUSTOMDRAWINFO nmcd
48	| clrText
52	| clrTextBk
56	| iSubItem
	+---

class tagNMLVCACHEHINT	size(20):
	+---
 0	| tagNMHDR hdr
12	| iFrom
16	| iTo
	+---

class tagNMLVFINDITEMA	size(40):
	+---
 0	| tagNMHDR hdr
12	| iStart
16	| tagLVFINDINFOA lvfi
	+---

class tagNMLVFINDITEMW	size(40):
	+---
 0	| tagNMHDR hdr
12	| iStart
16	| tagLVFINDINFOW lvfi
	+---

class tagNMLVODSTATECHANGE	size(28):
	+---
 0	| tagNMHDR hdr
12	| iFrom
16	| iTo
20	| uNewState
24	| uOldState
	+---

class tagLVDISPINFO	size(52):
	+---
 0	| tagNMHDR hdr
12	| tagLVITEMA item
	+---

class tagLVDISPINFOW	size(52):
	+---
 0	| tagNMHDR hdr
12	| tagLVITEMW item
	+---

class tagLVKEYDOWN	size(18):
	+---
 0	| tagNMHDR hdr
12	| wVKey
14	| flags
	+---

class tagNMLVGETINFOTIPA	size(36):
	+---
 0	| tagNMHDR hdr
12	| dwFlags
16	| pszText
20	| cchTextMax
24	| iItem
28	| iSubItem
32	| lParam
	+---

class tagNMLVGETINFOTIPW	size(36):
	+---
 0	| tagNMHDR hdr
12	| dwFlags
16	| pszText
20	| cchTextMax
24	| iItem
28	| iSubItem
32	| lParam
	+---

class tagTVITEMA	size(40):
	+---
 0	| mask
 4	| hItem
 8	| state
12	| stateMask
16	| pszText
20	| cchTextMax
24	| iImage
28	| iSelectedImage
32	| cChildren
36	| lParam
	+---

class tagTVITEMW	size(40):
	+---
 0	| mask
 4	| hItem
 8	| state
12	| stateMask
16	| pszText
20	| cchTextMax
24	| iImage
28	| iSelectedImage
32	| cChildren
36	| lParam
	+---

class tagTVITEMEXA	size(44):
	+---
 0	| mask
 4	| hItem
 8	| state
12	| stateMask
16	| pszText
20	| cchTextMax
24	| iImage
28	| iSelectedImage
32	| cChildren
36	| lParam
40	| iIntegral
	+---

class tagTVITEMEXW	size(44):
	+---
 0	| mask
 4	| hItem
 8	| state
12	| stateMask
16	| pszText
20	| cchTextMax
24	| iImage
28	| iSelectedImage
32	| cChildren
36	| lParam
40	| iIntegral
	+---

class tagTVINSERTSTRUCTA::<anonymous-tag>	size(44):
	+---
 0	| tagTVITEMEXA itemex
 0	| tagTVITEMA item
	+---

class tagTVINSERTSTRUCTA	size(52):
	+---
 0	| hParent
 4	| hInsertAfter
  	| <anonymous-tag> <alignment member> (size=8)
 8	| tagTVITEMEXA itemex
 8	| tagTVITEMA item
	+---

class tagTVINSERTSTRUCTW::<anonymous-tag>	size(44):
	+---
 0	| tagTVITEMEXW itemex
 0	| tagTVITEMW item
	+---

class tagTVINSERTSTRUCTW	size(52):
	+---
 0	| hParent
 4	| hInsertAfter
  	| <anonymous-tag> <alignment member> (size=8)
 8	| tagTVITEMEXW itemex
 8	| tagTVITEMW item
	+---

class tagTVHITTESTINFO	size(16):
	+---
 0	| tagPOINT pt
 8	| flags
12	| hItem
	+---

class tagTVSORTCB	size(12):
	+---
 0	| hParent
 4	| lpfnCompare
 8	| lParam
	+---

class tagNMTREEVIEWA	size(104):
	+---
 0	| tagNMHDR hdr
12	| action
16	| tagTVITEMA itemOld
56	| tagTVITEMA itemNew
96	| tagPOINT ptDrag
	+---

class tagNMTREEVIEWW	size(104):
	+---
 0	| tagNMHDR hdr
12	| action
16	| tagTVITEMW itemOld
56	| tagTVITEMW itemNew
96	| tagPOINT ptDrag
	+---

class tagTVDISPINFOA	size(52):
	+---
 0	| tagNMHDR hdr
12	| tagTVITEMA item
	+---

class tagTVDISPINFOW	size(52):
	+---
 0	| tagNMHDR hdr
12	| tagTVITEMW item
	+---

class tagTVKEYDOWN	size(18):
	+---
 0	| tagNMHDR hdr
12	| wVKey
14	| flags
	+---

class tagNMTVCUSTOMDRAW	size(60):
	+---
 0	| tagNMCUSTOMDRAWINFO nmcd
48	| clrText
52	| clrTextBk
56	| iLevel
	+---

class tagNMTVGETINFOTIPA	size(28):
	+---
 0	| tagNMHDR hdr
12	| pszText
16	| cchTextMax
20	| hItem
24	| lParam
	+---

class tagNMTVGETINFOTIPW	size(28):
	+---
 0	| tagNMHDR hdr
12	| pszText
16	| cchTextMax
20	| hItem
24	| lParam
	+---

class tagCOMBOBOXEXITEMA	size(36):
	+---
 0	| mask
 4	| iItem
 8	| pszText
12	| cchTextMax
16	| iImage
20	| iSelectedImage
24	| iOverlay
28	| iIndent
32	| lParam
	+---

class tagCOMBOBOXEXITEMW	size(36):
	+---
 0	| mask
 4	| iItem
 8	| pszText
12	| cchTextMax
16	| iImage
20	| iSelectedImage
24	| iOverlay
28	| iIndent
32	| lParam
	+---

class <anonymous-tag>	size(48):
	+---
 0	| tagNMHDR hdr
12	| tagCOMBOBOXEXITEMA ceItem
	+---

class <anonymous-tag>	size(48):
	+---
 0	| tagNMHDR hdr
12	| tagCOMBOBOXEXITEMW ceItem
	+---

class <anonymous-tag>	size(536):
	+---
 0	| tagNMHDR hdr
12	| iItemid
16	| szText
	+---

class <anonymous-tag>	size(276):
	+---
 0	| tagNMHDR hdr
12	| iItemid
16	| szText
	+---

class <anonymous-tag>	size(544):
	+---
 0	| tagNMHDR hdr
12	| fChanged
16	| iNewSelection
20	| szText
540	| iWhy
	+---

class <anonymous-tag>	size(284):
	+---
 0	| tagNMHDR hdr
12	| fChanged
16	| iNewSelection
20	| szText
280	| iWhy
	+---

class tagTCITEMHEADERA	size(24):
	+---
 0	| mask
 4	| lpReserved1
 8	| lpReserved2
12	| pszText
16	| cchTextMax
20	| iImage
	+---

class tagTCITEMHEADERW	size(24):
	+---
 0	| mask
 4	| lpReserved1
 8	| lpReserved2
12	| pszText
16	| cchTextMax
20	| iImage
	+---

class tagTCITEMA	size(28):
	+---
 0	| mask
 4	| dwState
 8	| dwStateMask
12	| pszText
16	| cchTextMax
20	| iImage
24	| lParam
	+---

class tagTCITEMW	size(28):
	+---
 0	| mask
 4	| dwState
 8	| dwStateMask
12	| pszText
16	| cchTextMax
20	| iImage
24	| lParam
	+---

class tagTCHITTESTINFO	size(12):
	+---
 0	| tagPOINT pt
 8	| flags
	+---

class tagTCKEYDOWN	size(18):
	+---
 0	| tagNMHDR hdr
12	| wVKey
14	| flags
	+---

class <anonymous-tag>	size(32):
	+---
 0	| cbSize
 4	| tagPOINT pt
12	| uHit
16	| _SYSTEMTIME st
	+---

class tagNMSELCHANGE	size(44):
	+---
 0	| tagNMHDR nmhdr
12	| _SYSTEMTIME stSelStart
28	| _SYSTEMTIME stSelEnd
	+---

class tagNMDAYSTATE	size(36):
	+---
 0	| tagNMHDR nmhdr
12	| _SYSTEMTIME stStart
28	| cDayState
32	| prgDayState
	+---

class tagNMVIEWCHANGE	size(20):
	+---
 0	| tagNMHDR nmhdr
12	| dwOldView
16	| dwNewView
	+---

class tagNMDATETIMECHANGE	size(32):
	+---
 0	| tagNMHDR nmhdr
12	| dwFlags
16	| _SYSTEMTIME st
	+---

class tagNMDATETIMESTRINGA	size(36):
	+---
 0	| tagNMHDR nmhdr
12	| pszUserString
16	| _SYSTEMTIME st
32	| dwFlags
	+---

class tagNMDATETIMESTRINGW	size(36):
	+---
 0	| tagNMHDR nmhdr
12	| pszUserString
16	| _SYSTEMTIME st
32	| dwFlags
	+---

class tagNMDATETIMEWMKEYDOWNA	size(36):
	+---
 0	| tagNMHDR nmhdr
12	| nVirtKey
16	| pszFormat
20	| _SYSTEMTIME st
	+---

class tagNMDATETIMEWMKEYDOWNW	size(36):
	+---
 0	| tagNMHDR nmhdr
12	| nVirtKey
16	| pszFormat
20	| _SYSTEMTIME st
	+---

class tagNMDATETIMEFORMATA	size(100):
	+---
 0	| tagNMHDR nmhdr
12	| pszFormat
16	| _SYSTEMTIME st
32	| pszDisplay
36	| szDisplay
	+---

class tagNMDATETIMEFORMATW	size(164):
	+---
 0	| tagNMHDR nmhdr
12	| pszFormat
16	| _SYSTEMTIME st
32	| pszDisplay
36	| szDisplay
	+---

class tagNMDATETIMEFORMATQUERYA	size(24):
	+---
 0	| tagNMHDR nmhdr
12	| pszFormat
16	| tagSIZE szMax
	+---

class tagNMDATETIMEFORMATQUERYW	size(24):
	+---
 0	| tagNMHDR nmhdr
12	| pszFormat
16	| tagSIZE szMax
	+---

class tagNMIPADDRESS	size(20):
	+---
 0	| tagNMHDR hdr
12	| iField
16	| iValue
	+---

class <anonymous-tag>	size(46):
	+---
 0	| tagNMHDR hdr
12	| fwKeys
14	| tagRECT rcParent
30	| iDir
34	| iXpos
38	| iYpos
42	| iScroll
	+---

class <anonymous-tag>	size(24):
	+---
 0	| tagNMHDR hdr
12	| dwFlag
16	| iWidth
20	| iHeight
	+---

class tagNMPGHOTITEM	size(24):
	+---
 0	| tagNMHDR hdr
12	| idOld
16	| idNew
20	| dwFlags
	+---

class _DPASTREAMINFO	size(8):
	+---
 0	| iPos
 4	| pvItem
	+---

class _timespec32	size(8):
	+---
 0	| tv_sec
 4	| tv_nsec
	+---

class _timespec64	size(16):
	+---
 0	| tv_sec
 8	| tv_nsec
  	| <alignment member> (size=4)
	+---

class timespec	size(16):
	+---
 0	| tv_sec
 8	| tv_nsec
  	| <alignment member> (size=4)
	+---

class __POSITION	size(1):
	+---
	+---

class _AFX_DOUBLE	size(8):
	+---
 0	| doubleBits
	+---

class _AFX_FLOAT	size(4):
	+---
 0	| floatBits
	+---

class CRuntimeClass	size(24):
	+---
 0	| m_lpszClassName
 4	| m_nObjectSize
 8	| m_wSchema
12	| m_pfnCreateObject
16	| m_pBaseClass
20	| m_pNextClass
	+---

class CStringData	size(12):
	+---
 0	| nRefs
 4	| nDataLength
 8	| nAllocLength
	+---

class CString	size(4):
	+---
 0	| m_pchData
	+---

class CObject	size(4):
	+---
 0	| {vfptr}
	+---

CObject::$vftable@:
	| &CObject_meta
	|  0
 0	| &CObject::GetRuntimeClass
 1	| &CObject::{dtor}
 2	| &CObject::Serialize

CObject::GetRuntimeClass this adjustor: 0
CObject::{dtor} this adjustor: 0
CObject::Serialize this adjustor: 0
CObject::AssertValid this adjustor: 0
CObject::Dump this adjustor: 0
CObject::__delDtor this adjustor: 0
CObject::__vecDelDtor this adjustor: 0

class AFX_CLASSINIT	size(1):
	+---
	+---

class CException	size(8):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_bAutoDelete
	+---

CException::$vftable@:
	| &CException_meta
	|  0
 0	| &CException::GetRuntimeClass
 1	| &CException::{dtor}
 2	| &CObject::Serialize
 5	| &CException::GetErrorMessage
 6	| &CException::ReportError

CException::GetRuntimeClass this adjustor: 0
CException::GetErrorMessage this adjustor: 0
CException::ReportError this adjustor: 0
CException::{dtor} this adjustor: 0
CException::__delDtor this adjustor: 0
CException::__vecDelDtor this adjustor: 0

class CSimpleException	size(152):
	+---
 0	| +--- (base class CException)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_bAutoDelete
	| +---
 8	| m_bAutoDelete
12	| m_bInitialized
16	| m_bLoaded
20	| m_szMessage
148	| m_nResourceID
	+---

CSimpleException::$vftable@:
	| &CSimpleException_meta
	|  0
 0	| &CException::GetRuntimeClass
 1	| &CSimpleException::{dtor}
 2	| &CObject::Serialize
 5	| &CSimpleException::GetErrorMessage
 6	| &CException::ReportError

CSimpleException::GetErrorMessage this adjustor: 0
CSimpleException::{dtor} this adjustor: 0
CSimpleException::__delDtor this adjustor: 0
CSimpleException::__vecDelDtor this adjustor: 0

class AFX_EXCEPTION_LINK	size(8):
	+---
 0	| m_pLinkPrev
 4	| m_pException
	+---

class AFX_EXCEPTION_CONTEXT	size(4):
	+---
 0	| m_pLinkTop
	+---

class CMemoryException	size(152):
	+---
 0	| +--- (base class CSimpleException)
 0	| | +--- (base class CException)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_bAutoDelete
	| | +---
 8	| | m_bAutoDelete
12	| | m_bInitialized
16	| | m_bLoaded
20	| | m_szMessage
148	| | m_nResourceID
	| +---
	+---

CMemoryException::$vftable@:
	| &CMemoryException_meta
	|  0
 0	| &CMemoryException::GetRuntimeClass
 1	| &CMemoryException::{dtor}
 2	| &CObject::Serialize
 5	| &CSimpleException::GetErrorMessage
 6	| &CException::ReportError

CMemoryException::GetRuntimeClass this adjustor: 0
CMemoryException::{dtor} this adjustor: 0
CMemoryException::__delDtor this adjustor: 0
CMemoryException::__vecDelDtor this adjustor: 0

class CNotSupportedException	size(152):
	+---
 0	| +--- (base class CSimpleException)
 0	| | +--- (base class CException)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_bAutoDelete
	| | +---
 8	| | m_bAutoDelete
12	| | m_bInitialized
16	| | m_bLoaded
20	| | m_szMessage
148	| | m_nResourceID
	| +---
	+---

CNotSupportedException::$vftable@:
	| &CNotSupportedException_meta
	|  0
 0	| &CNotSupportedException::GetRuntimeClass
 1	| &CNotSupportedException::{dtor}
 2	| &CObject::Serialize
 5	| &CSimpleException::GetErrorMessage
 6	| &CException::ReportError

CNotSupportedException::GetRuntimeClass this adjustor: 0
CNotSupportedException::{dtor} this adjustor: 0
CNotSupportedException::__delDtor this adjustor: 0
CNotSupportedException::__vecDelDtor this adjustor: 0

class CArchiveException	size(16):
	+---
 0	| +--- (base class CException)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_bAutoDelete
	| +---
 8	| m_cause
12	| CString m_strFileName
	+---

CArchiveException::$vftable@:
	| &CArchiveException_meta
	|  0
 0	| &CArchiveException::GetRuntimeClass
 1	| &CArchiveException::{dtor}
 2	| &CObject::Serialize
 5	| &CArchiveException::GetErrorMessage
 6	| &CException::ReportError

CArchiveException::GetRuntimeClass this adjustor: 0
CArchiveException::{dtor} this adjustor: 0
CArchiveException::GetErrorMessage this adjustor: 0
CArchiveException::__delDtor this adjustor: 0
CArchiveException::__vecDelDtor this adjustor: 0

class CFileException	size(20):
	+---
 0	| +--- (base class CException)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_bAutoDelete
	| +---
 8	| m_cause
12	| m_lOsError
16	| CString m_strFileName
	+---

CFileException::$vftable@:
	| &CFileException_meta
	|  0
 0	| &CFileException::GetRuntimeClass
 1	| &CFileException::{dtor}
 2	| &CObject::Serialize
 5	| &CFileException::GetErrorMessage
 6	| &CException::ReportError

CFileException::GetRuntimeClass this adjustor: 0
CFileException::{dtor} this adjustor: 0
CFileException::GetErrorMessage this adjustor: 0
CFileException::__delDtor this adjustor: 0
CFileException::__vecDelDtor this adjustor: 0

class CFile	size(16):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_hFile
 8	| m_bCloseOnDelete
12	| CString m_strFileName
	+---

CFile::$vftable@:
	| &CFile_meta
	|  0
 0	| &CFile::GetRuntimeClass
 1	| &CFile::{dtor}
 2	| &CObject::Serialize
 5	| &CFile::GetPosition
 6	| &CFile::GetFileName
 7	| &CFile::GetFileTitle
 8	| &CFile::GetFilePath
 9	| &CFile::SetFilePath
10	| &CFile::Open
11	| &CFile::Duplicate
12	| &CFile::Seek
13	| &CFile::SetLength
14	| &CFile::GetLength
15	| &CFile::Read
16	| &CFile::Write
17	| &CFile::LockRange
18	| &CFile::UnlockRange
19	| &CFile::Abort
20	| &CFile::Flush
21	| &CFile::Close
22	| &CFile::GetBufferPtr

CFile::GetRuntimeClass this adjustor: 0
CFile::GetPosition this adjustor: 0
CFile::GetFileName this adjustor: 0
CFile::GetFileTitle this adjustor: 0
CFile::GetFilePath this adjustor: 0
CFile::SetFilePath this adjustor: 0
CFile::Open this adjustor: 0
CFile::Duplicate this adjustor: 0
CFile::Seek this adjustor: 0
CFile::SetLength this adjustor: 0
CFile::GetLength this adjustor: 0
CFile::Read this adjustor: 0
CFile::Write this adjustor: 0
CFile::LockRange this adjustor: 0
CFile::UnlockRange this adjustor: 0
CFile::Abort this adjustor: 0
CFile::Flush this adjustor: 0
CFile::Close this adjustor: 0
CFile::{dtor} this adjustor: 0
CFile::GetBufferPtr this adjustor: 0
CFile::__delDtor this adjustor: 0
CFile::__vecDelDtor this adjustor: 0

class CStdioFile	size(20):
	+---
 0	| +--- (base class CFile)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hFile
 8	| | m_bCloseOnDelete
12	| | CString m_strFileName
	| +---
16	| m_pStream
	+---

CStdioFile::$vftable@:
	| &CStdioFile_meta
	|  0
 0	| &CStdioFile::GetRuntimeClass
 1	| &CStdioFile::{dtor}
 2	| &CObject::Serialize
 5	| &CStdioFile::GetPosition
 6	| &CFile::GetFileName
 7	| &CFile::GetFileTitle
 8	| &CFile::GetFilePath
 9	| &CFile::SetFilePath
10	| &CStdioFile::Open
11	| &CStdioFile::Duplicate
12	| &CStdioFile::Seek
13	| &CFile::SetLength
14	| &CFile::GetLength
15	| &CStdioFile::Read
16	| &CStdioFile::Write
17	| &CStdioFile::LockRange
18	| &CStdioFile::UnlockRange
19	| &CStdioFile::Abort
20	| &CStdioFile::Flush
21	| &CStdioFile::Close
22	| &CFile::GetBufferPtr
23	| &CStdioFile::WriteString
24	| &CStdioFile::ReadString
25	| &CStdioFile::ReadString

CStdioFile::GetRuntimeClass this adjustor: 0
CStdioFile::WriteString this adjustor: 0
CStdioFile::ReadString this adjustor: 0
CStdioFile::ReadString this adjustor: 0
CStdioFile::{dtor} this adjustor: 0
CStdioFile::GetPosition this adjustor: 0
CStdioFile::Open this adjustor: 0
CStdioFile::Read this adjustor: 0
CStdioFile::Write this adjustor: 0
CStdioFile::Seek this adjustor: 0
CStdioFile::Abort this adjustor: 0
CStdioFile::Flush this adjustor: 0
CStdioFile::Close this adjustor: 0
CStdioFile::Duplicate this adjustor: 0
CStdioFile::LockRange this adjustor: 0
CStdioFile::UnlockRange this adjustor: 0
CStdioFile::__delDtor this adjustor: 0
CStdioFile::__vecDelDtor this adjustor: 0

class CMemFile	size(40):
	+---
 0	| +--- (base class CFile)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hFile
 8	| | m_bCloseOnDelete
12	| | CString m_strFileName
	| +---
16	| m_nGrowBytes
20	| m_nPosition
24	| m_nBufferSize
28	| m_nFileSize
32	| m_lpBuffer
36	| m_bAutoDelete
	+---

CMemFile::$vftable@:
	| &CMemFile_meta
	|  0
 0	| &CMemFile::GetRuntimeClass
 1	| &CMemFile::{dtor}
 2	| &CObject::Serialize
 5	| &CMemFile::GetPosition
 6	| &CFile::GetFileName
 7	| &CFile::GetFileTitle
 8	| &CFile::GetFilePath
 9	| &CFile::SetFilePath
10	| &CFile::Open
11	| &CMemFile::Duplicate
12	| &CMemFile::Seek
13	| &CMemFile::SetLength
14	| &CFile::GetLength
15	| &CMemFile::Read
16	| &CMemFile::Write
17	| &CMemFile::LockRange
18	| &CMemFile::UnlockRange
19	| &CMemFile::Abort
20	| &CMemFile::Flush
21	| &CMemFile::Close
22	| &CMemFile::GetBufferPtr
23	| &CMemFile::Alloc
24	| &CMemFile::Realloc
25	| &CMemFile::Memcpy
26	| &CMemFile::Free
27	| &CMemFile::GrowFile

CMemFile::GetRuntimeClass this adjustor: 0
CMemFile::Alloc this adjustor: 0
CMemFile::Realloc this adjustor: 0
CMemFile::Memcpy this adjustor: 0
CMemFile::Free this adjustor: 0
CMemFile::GrowFile this adjustor: 0
CMemFile::{dtor} this adjustor: 0
CMemFile::GetPosition this adjustor: 0
CMemFile::Seek this adjustor: 0
CMemFile::SetLength this adjustor: 0
CMemFile::Read this adjustor: 0
CMemFile::Write this adjustor: 0
CMemFile::Abort this adjustor: 0
CMemFile::Flush this adjustor: 0
CMemFile::Close this adjustor: 0
CMemFile::GetBufferPtr this adjustor: 0
CMemFile::Duplicate this adjustor: 0
CMemFile::LockRange this adjustor: 0
CMemFile::UnlockRange this adjustor: 0
CMemFile::__delDtor this adjustor: 0
CMemFile::__vecDelDtor this adjustor: 0

class CFileFind	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pFoundInfo
 8	| m_pNextInfo
12	| m_hContext
16	| m_bGotLast
20	| CString m_strRoot
24	| m_chDirSeparator
  	| <alignment member> (size=3)
	+---

CFileFind::$vftable@:
	| &CFileFind_meta
	|  0
 0	| &CFileFind::GetRuntimeClass
 1	| &CFileFind::{dtor}
 2	| &CObject::Serialize
 5	| &CFileFind::GetFileName
 6	| &CFileFind::GetFilePath
 7	| &CFileFind::GetFileTitle
 8	| &CFileFind::GetFileURL
 9	| &CFileFind::GetRoot
10	| &CFileFind::GetLastWriteTime
11	| &CFileFind::GetLastWriteTime
12	| &CFileFind::GetLastAccessTime
13	| &CFileFind::GetLastAccessTime
14	| &CFileFind::GetCreationTime
15	| &CFileFind::GetCreationTime
16	| &CFileFind::MatchesMask
17	| &CFileFind::IsDots
18	| &CFileFind::FindFile
19	| &CFileFind::FindNextFileA
20	| &CFileFind::CloseContext

CFileFind::{dtor} this adjustor: 0
CFileFind::GetFileName this adjustor: 0
CFileFind::GetFilePath this adjustor: 0
CFileFind::GetFileTitle this adjustor: 0
CFileFind::GetFileURL this adjustor: 0
CFileFind::GetRoot this adjustor: 0
CFileFind::GetLastWriteTime this adjustor: 0
CFileFind::GetLastWriteTime this adjustor: 0
CFileFind::GetLastAccessTime this adjustor: 0
CFileFind::GetLastAccessTime this adjustor: 0
CFileFind::GetCreationTime this adjustor: 0
CFileFind::GetCreationTime this adjustor: 0
CFileFind::MatchesMask this adjustor: 0
CFileFind::IsDots this adjustor: 0
CFileFind::FindFile this adjustor: 0
CFileFind::FindNextFileA this adjustor: 0
CFileFind::CloseContext this adjustor: 0
CFileFind::GetRuntimeClass this adjustor: 0
CFileFind::__delDtor this adjustor: 0
CFileFind::__vecDelDtor this adjustor: 0

class CTimeSpan	size(8):
	+---
 0	| m_timeSpan
	+---

class CTime	size(8):
	+---
 0	| m_time
	+---

class CFileStatus	size(292):
	+---
 0	| CTime m_ctime
 8	| CTime m_mtime
16	| CTime m_atime
24	| m_size
28	| m_attribute
29	| _m_padding
30	| m_szFullName
  	| <alignment member> (size=2)
	+---

class CArchive::<anonymous-tag>	size(4):
	+---
 0	| m_pLoadArray
 0	| m_pStoreMap
	+---

class CArchive	size(68):
	+---
 0	| m_pDocument
 4	| m_bForceFlat
 8	| m_bDirectBuffer
12	| m_nObjectSchema
16	| CString m_strFileName
20	| m_nMode
24	| m_bUserBuf
28	| m_nBufSize
32	| m_pFile
36	| m_lpBufCur
40	| m_lpBufMax
44	| m_lpBufStart
48	| m_nMapCount
  	| <anonymous-tag> <alignment member> (size=52)
52	| m_pLoadArray
52	| m_pStoreMap
56	| m_pSchemaMap
60	| m_nGrowSize
64	| m_nHashSize
	+---

class CDumpContext	size(8):
	+---
 0	| m_nDepth
 4	| m_pFile
	+---

class CByteArray	size(20):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pData
 8	| m_nSize
12	| m_nMaxSize
16	| m_nGrowBy
	+---

CByteArray::$vftable@:
	| &CByteArray_meta
	|  0
 0	| &CByteArray::GetRuntimeClass
 1	| &CByteArray::{dtor}
 2	| &CByteArray::Serialize

CByteArray::GetRuntimeClass this adjustor: 0
CByteArray::{dtor} this adjustor: 0
CByteArray::Serialize this adjustor: 0
CByteArray::__delDtor this adjustor: 0
CByteArray::__vecDelDtor this adjustor: 0

class CWordArray	size(20):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pData
 8	| m_nSize
12	| m_nMaxSize
16	| m_nGrowBy
	+---

CWordArray::$vftable@:
	| &CWordArray_meta
	|  0
 0	| &CWordArray::GetRuntimeClass
 1	| &CWordArray::{dtor}
 2	| &CWordArray::Serialize

CWordArray::GetRuntimeClass this adjustor: 0
CWordArray::{dtor} this adjustor: 0
CWordArray::Serialize this adjustor: 0
CWordArray::__delDtor this adjustor: 0
CWordArray::__vecDelDtor this adjustor: 0

class CDWordArray	size(20):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pData
 8	| m_nSize
12	| m_nMaxSize
16	| m_nGrowBy
	+---

CDWordArray::$vftable@:
	| &CDWordArray_meta
	|  0
 0	| &CDWordArray::GetRuntimeClass
 1	| &CDWordArray::{dtor}
 2	| &CDWordArray::Serialize

CDWordArray::GetRuntimeClass this adjustor: 0
CDWordArray::{dtor} this adjustor: 0
CDWordArray::Serialize this adjustor: 0
CDWordArray::__delDtor this adjustor: 0
CDWordArray::__vecDelDtor this adjustor: 0

class CUIntArray	size(20):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pData
 8	| m_nSize
12	| m_nMaxSize
16	| m_nGrowBy
	+---

CUIntArray::$vftable@:
	| &CUIntArray_meta
	|  0
 0	| &CUIntArray::GetRuntimeClass
 1	| &CUIntArray::{dtor}
 2	| &CObject::Serialize

CUIntArray::GetRuntimeClass this adjustor: 0
CUIntArray::{dtor} this adjustor: 0
CUIntArray::__delDtor this adjustor: 0
CUIntArray::__vecDelDtor this adjustor: 0

class CPtrArray	size(20):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pData
 8	| m_nSize
12	| m_nMaxSize
16	| m_nGrowBy
	+---

CPtrArray::$vftable@:
	| &CPtrArray_meta
	|  0
 0	| &CPtrArray::GetRuntimeClass
 1	| &CPtrArray::{dtor}
 2	| &CObject::Serialize

CPtrArray::GetRuntimeClass this adjustor: 0
CPtrArray::{dtor} this adjustor: 0
CPtrArray::__delDtor this adjustor: 0
CPtrArray::__vecDelDtor this adjustor: 0

class CObArray	size(20):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pData
 8	| m_nSize
12	| m_nMaxSize
16	| m_nGrowBy
	+---

CObArray::$vftable@:
	| &CObArray_meta
	|  0
 0	| &CObArray::GetRuntimeClass
 1	| &CObArray::{dtor}
 2	| &CObArray::Serialize

CObArray::GetRuntimeClass this adjustor: 0
CObArray::{dtor} this adjustor: 0
CObArray::Serialize this adjustor: 0
CObArray::__delDtor this adjustor: 0
CObArray::__vecDelDtor this adjustor: 0

class CStringArray	size(20):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pData
 8	| m_nSize
12	| m_nMaxSize
16	| m_nGrowBy
	+---

CStringArray::$vftable@:
	| &CStringArray_meta
	|  0
 0	| &CStringArray::GetRuntimeClass
 1	| &CStringArray::{dtor}
 2	| &CStringArray::Serialize

CStringArray::GetRuntimeClass this adjustor: 0
CStringArray::{dtor} this adjustor: 0
CStringArray::Serialize this adjustor: 0
CStringArray::__delDtor this adjustor: 0
CStringArray::__vecDelDtor this adjustor: 0

class CPtrList::CNode	size(12):
	+---
 0	| pNext
 4	| pPrev
 8	| data
	+---

class CPtrList	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pNodeHead
 8	| m_pNodeTail
12	| m_nCount
16	| m_pNodeFree
20	| m_pBlocks
24	| m_nBlockSize
	+---

CPtrList::$vftable@:
	| &CPtrList_meta
	|  0
 0	| &CPtrList::GetRuntimeClass
 1	| &CPtrList::{dtor}
 2	| &CObject::Serialize

CPtrList::GetRuntimeClass this adjustor: 0
CPtrList::{dtor} this adjustor: 0
CPtrList::__delDtor this adjustor: 0
CPtrList::__vecDelDtor this adjustor: 0

class CObList::CNode	size(12):
	+---
 0	| pNext
 4	| pPrev
 8	| data
	+---

class CObList	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pNodeHead
 8	| m_pNodeTail
12	| m_nCount
16	| m_pNodeFree
20	| m_pBlocks
24	| m_nBlockSize
	+---

CObList::$vftable@:
	| &CObList_meta
	|  0
 0	| &CObList::GetRuntimeClass
 1	| &CObList::{dtor}
 2	| &CObList::Serialize

CObList::GetRuntimeClass this adjustor: 0
CObList::{dtor} this adjustor: 0
CObList::Serialize this adjustor: 0
CObList::__delDtor this adjustor: 0
CObList::__vecDelDtor this adjustor: 0

class CStringList::CNode	size(12):
	+---
 0	| pNext
 4	| pPrev
 8	| CString data
	+---

class CStringList	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pNodeHead
 8	| m_pNodeTail
12	| m_nCount
16	| m_pNodeFree
20	| m_pBlocks
24	| m_nBlockSize
	+---

CStringList::$vftable@:
	| &CStringList_meta
	|  0
 0	| &CStringList::GetRuntimeClass
 1	| &CStringList::{dtor}
 2	| &CStringList::Serialize

CStringList::GetRuntimeClass this adjustor: 0
CStringList::{dtor} this adjustor: 0
CStringList::Serialize this adjustor: 0
CStringList::__delDtor this adjustor: 0
CStringList::__vecDelDtor this adjustor: 0

class CMapWordToPtr::CAssoc	size(12):
	+---
 0	| pNext
 4	| key
  	| <alignment member> (size=2)
 8	| value
	+---

class CMapWordToPtr	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pHashTable
 8	| m_nHashTableSize
12	| m_nCount
16	| m_pFreeList
20	| m_pBlocks
24	| m_nBlockSize
	+---

CMapWordToPtr::$vftable@:
	| &CMapWordToPtr_meta
	|  0
 0	| &CMapWordToPtr::GetRuntimeClass
 1	| &CMapWordToPtr::{dtor}
 2	| &CObject::Serialize

CMapWordToPtr::GetRuntimeClass this adjustor: 0
CMapWordToPtr::{dtor} this adjustor: 0
CMapWordToPtr::__delDtor this adjustor: 0
CMapWordToPtr::__vecDelDtor this adjustor: 0

class CMapPtrToWord::CAssoc	size(12):
	+---
 0	| pNext
 4	| key
 8	| value
  	| <alignment member> (size=2)
	+---

class CMapPtrToWord	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pHashTable
 8	| m_nHashTableSize
12	| m_nCount
16	| m_pFreeList
20	| m_pBlocks
24	| m_nBlockSize
	+---

CMapPtrToWord::$vftable@:
	| &CMapPtrToWord_meta
	|  0
 0	| &CMapPtrToWord::GetRuntimeClass
 1	| &CMapPtrToWord::{dtor}
 2	| &CObject::Serialize

CMapPtrToWord::GetRuntimeClass this adjustor: 0
CMapPtrToWord::{dtor} this adjustor: 0
CMapPtrToWord::__delDtor this adjustor: 0
CMapPtrToWord::__vecDelDtor this adjustor: 0

class CMapPtrToPtr::CAssoc	size(12):
	+---
 0	| pNext
 4	| key
 8	| value
	+---

class CMapPtrToPtr	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pHashTable
 8	| m_nHashTableSize
12	| m_nCount
16	| m_pFreeList
20	| m_pBlocks
24	| m_nBlockSize
	+---

CMapPtrToPtr::$vftable@:
	| &CMapPtrToPtr_meta
	|  0
 0	| &CMapPtrToPtr::GetRuntimeClass
 1	| &CMapPtrToPtr::{dtor}
 2	| &CObject::Serialize

CMapPtrToPtr::GetRuntimeClass this adjustor: 0
CMapPtrToPtr::{dtor} this adjustor: 0
CMapPtrToPtr::__delDtor this adjustor: 0
CMapPtrToPtr::__vecDelDtor this adjustor: 0

class CMapWordToOb::CAssoc	size(12):
	+---
 0	| pNext
 4	| key
  	| <alignment member> (size=2)
 8	| value
	+---

class CMapWordToOb	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pHashTable
 8	| m_nHashTableSize
12	| m_nCount
16	| m_pFreeList
20	| m_pBlocks
24	| m_nBlockSize
	+---

CMapWordToOb::$vftable@:
	| &CMapWordToOb_meta
	|  0
 0	| &CMapWordToOb::GetRuntimeClass
 1	| &CMapWordToOb::{dtor}
 2	| &CMapWordToOb::Serialize

CMapWordToOb::GetRuntimeClass this adjustor: 0
CMapWordToOb::{dtor} this adjustor: 0
CMapWordToOb::Serialize this adjustor: 0
CMapWordToOb::__delDtor this adjustor: 0
CMapWordToOb::__vecDelDtor this adjustor: 0

class CMapStringToPtr::CAssoc	size(16):
	+---
 0	| pNext
 4	| nHashValue
 8	| CString key
12	| value
	+---

class CMapStringToPtr	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pHashTable
 8	| m_nHashTableSize
12	| m_nCount
16	| m_pFreeList
20	| m_pBlocks
24	| m_nBlockSize
	+---

CMapStringToPtr::$vftable@:
	| &CMapStringToPtr_meta
	|  0
 0	| &CMapStringToPtr::GetRuntimeClass
 1	| &CMapStringToPtr::{dtor}
 2	| &CObject::Serialize

CMapStringToPtr::GetRuntimeClass this adjustor: 0
CMapStringToPtr::{dtor} this adjustor: 0
CMapStringToPtr::__delDtor this adjustor: 0
CMapStringToPtr::__vecDelDtor this adjustor: 0

class CMapStringToOb::CAssoc	size(16):
	+---
 0	| pNext
 4	| nHashValue
 8	| CString key
12	| value
	+---

class CMapStringToOb	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pHashTable
 8	| m_nHashTableSize
12	| m_nCount
16	| m_pFreeList
20	| m_pBlocks
24	| m_nBlockSize
	+---

CMapStringToOb::$vftable@:
	| &CMapStringToOb_meta
	|  0
 0	| &CMapStringToOb::GetRuntimeClass
 1	| &CMapStringToOb::{dtor}
 2	| &CMapStringToOb::Serialize

CMapStringToOb::GetRuntimeClass this adjustor: 0
CMapStringToOb::{dtor} this adjustor: 0
CMapStringToOb::Serialize this adjustor: 0
CMapStringToOb::__delDtor this adjustor: 0
CMapStringToOb::__vecDelDtor this adjustor: 0

class CMapStringToString::CAssoc	size(16):
	+---
 0	| pNext
 4	| nHashValue
 8	| CString key
12	| CString value
	+---

class CMapStringToString	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_pHashTable
 8	| m_nHashTableSize
12	| m_nCount
16	| m_pFreeList
20	| m_pBlocks
24	| m_nBlockSize
	+---

CMapStringToString::$vftable@:
	| &CMapStringToString_meta
	|  0
 0	| &CMapStringToString::GetRuntimeClass
 1	| &CMapStringToString::{dtor}
 2	| &CMapStringToString::Serialize

CMapStringToString::GetRuntimeClass this adjustor: 0
CMapStringToString::{dtor} this adjustor: 0
CMapStringToString::Serialize this adjustor: 0
CMapStringToString::__delDtor this adjustor: 0
CMapStringToString::__vecDelDtor this adjustor: 0

class CSimpleList	size(8):
	+---
 0	| m_pHead
 4	| m_nNextOffset
	+---

class CTypedSimpleList<struct CThreadData *>	size(8):
	+---
 0	| +--- (base class CSimpleList)
 0	| | m_pHead
 4	| | m_nNextOffset
	| +---
	+---

class CThreadSlotData	size(52):
	+---
 0	| m_tlsIndex
 4	| m_nAlloc
 8	| m_nRover
12	| m_nMax
16	| m_pSlotData
20	| ?$CTypedSimpleList@PAUCThreadData@@ m_list
28	| _RTL_CRITICAL_SECTION m_sect
	+---

class CNoTrackObject	size(4):
	+---
 0	| {vfptr}
	+---

CNoTrackObject::$vftable@:
	| &CNoTrackObject_meta
	|  0
 0	| &CNoTrackObject::{dtor}

CNoTrackObject::{dtor} this adjustor: 0
CNoTrackObject::__delDtor this adjustor: 0
CNoTrackObject::__vecDelDtor this adjustor: 0

class CThreadLocalObject	size(4):
	+---
 0	| m_nSlot
	+---

class CProcessLocalObject	size(4):
	+---
 0	| m_pObject
	+---

class _AFX_WIN_STATE	size(16):
	+---
 0	| +--- (base class CNoTrackObject)
 0	| | {vfptr}
	| +---
 4	| m_hDlgBkBrush
 8	| m_crDlgTextClr
12	| m_bUserAbort
	+---

_AFX_WIN_STATE::$vftable@:
	| &_AFX_WIN_STATE_meta
	|  0
 0	| &_AFX_WIN_STATE::{dtor}

_AFX_WIN_STATE::{dtor} this adjustor: 0
_AFX_WIN_STATE::__delDtor this adjustor: 0
_AFX_WIN_STATE::__vecDelDtor this adjustor: 0

class CTypeLibCache	size(36):
	+---
 0	| m_pTypeLibID
 4	| m_lcid
 8	| m_ptlib
12	| _GUID m_guidInfo
28	| m_ptinfo
32	| m_cRef
	+---

class CTypedSimpleList<class CFrameWnd *>	size(8):
	+---
 0	| +--- (base class CSimpleList)
 0	| | m_pHead
 4	| | m_nNextOffset
	| +---
	+---

class AFX_MODULE_THREAD_STATE	size(132):
	+---
 0	| +--- (base class CNoTrackObject)
 0	| | {vfptr}
	| +---
 4	| m_pCurrentWinThread
 8	| ?$CTypedSimpleList@PAVCFrameWnd@@ m_frameList
16	| m_nTempMapLock
20	| m_pmapHWND
24	| m_pmapHMENU
28	| m_pmapHDC
32	| m_pmapHGDIOBJ
36	| m_pmapHIMAGELIST
40	| m_pfnNewHandler
44	| m_hSocketWindow
48	| CMapPtrToPtr m_mapSocketHandle
76	| CMapPtrToPtr m_mapDeadSockets
104	| CPtrList m_listSocketNotifications
	+---

AFX_MODULE_THREAD_STATE::$vftable@:
	| &AFX_MODULE_THREAD_STATE_meta
	|  0
 0	| &AFX_MODULE_THREAD_STATE::{dtor}

AFX_MODULE_THREAD_STATE::{dtor} this adjustor: 0
AFX_MODULE_THREAD_STATE::__delDtor this adjustor: 0
AFX_MODULE_THREAD_STATE::__vecDelDtor this adjustor: 0

class CTypedSimpleList<struct CRuntimeClass *>	size(8):
	+---
 0	| +--- (base class CSimpleList)
 0	| | m_pHead
 4	| | m_nNextOffset
	| +---
	+---

class CTypedSimpleList<class COleObjectFactory *>	size(8):
	+---
 0	| +--- (base class CSimpleList)
 0	| | m_pHead
 4	| | m_nNextOffset
	| +---
	+---

class CTypedSimpleList<class COleControlLock *>	size(8):
	+---
 0	| +--- (base class CSimpleList)
 0	| | m_pHead
 4	| | m_nNextOffset
	| +---
	+---

class CThreadLocal<class AFX_MODULE_THREAD_STATE>	size(4):
	+---
 0	| +--- (base class CThreadLocalObject)
 0	| | m_nSlot
	| +---
	+---

class AFX_MODULE_STATE	size(4212):
	+---
 0	| +--- (base class CNoTrackObject)
 0	| | {vfptr}
	| +---
 4	| m_pCurrentWinApp
 8	| m_hCurrentInstanceHandle
12	| m_hCurrentResourceHandle
16	| m_lpszCurrentAppName
20	| m_bDLL
21	| m_bSystem
22	| m_bReserved
24	| m_fRegisteredClasses
  	| <alignment member> (size=2)
28	| ?$CTypedSimpleList@PAUCRuntimeClass@@ m_classList
36	| ?$CTypedSimpleList@PAVCOleObjectFactory@@ m_factoryList
44	| m_nObjectCount
48	| m_bUserCtrl
52	| m_szUnregisterList
4148	| m_pfnFilterToolTipMessage
4152	| m_pOccManager
4156	| ?$CTypedSimpleList@PAVCOleControlLock@@ m_lockList
4164	| m_pDaoState
4168	| CTypeLibCache m_typeLibCache
4204	| m_pTypeLibCacheMap
e:\ares\fa2_ext\reference\mfc42\include\afx.inl(221): warning C4244: return: time_tLONG
e:\ares\fa2_ext\reference\mfc42\include\afx.inl(223): warning C4244: return: time_tLONG
e:\ares\fa2_ext\reference\mfc42\include\afx.inl(227): warning C4244: return: time_tLONG
e:\ares\fa2_ext\reference\mfc42\include\afx.inl(231): warning C4244: return: const time_tLONG
4208	| ?$CThreadLocal@VAFX_MODULE_THREAD_STATE@@ m_thread
	+---

AFX_MODULE_STATE::$vftable@:
	| &AFX_MODULE_STATE_meta
	|  0
 0	| &AFX_MODULE_STATE::{dtor}

AFX_MODULE_STATE::{dtor} this adjustor: 0
AFX_MODULE_STATE::__delDtor this adjustor: 0
AFX_MODULE_STATE::__vecDelDtor this adjustor: 0

class _AFX_THREAD_STATE	size(280):
	+---
 0	| +--- (base class CNoTrackObject)
 0	| | {vfptr}
	| +---
 4	| m_pModuleState
 8	| m_pPrevModuleState
12	| m_pSafetyPoolBuffer
16	| AFX_EXCEPTION_CONTEXT m_exceptionContext
20	| m_pWndInit
24	| m_pAlternateWndInit
28	| m_dwPropStyle
32	| m_dwPropExStyle
36	| m_hWndInit
40	| m_bDlgCreate
44	| m_hHookOldCbtFilter
48	| m_hHookOldMsgFilter
52	| tagMSG m_lastSentMsg
80	| m_hTrackingWindow
84	| m_hTrackingMenu
88	| m_szTempClassName
184	| m_hLockoutNotifyWindow
188	| m_bInMsgFilter
192	| m_pRoutingView
196	| m_pRoutingFrame
200	| m_bWaitForDataSource
204	| m_pToolTip
208	| m_pLastHit
212	| m_nLastHit
216	| tagTOOLINFOA m_lastInfo
260	| m_nLastStatus
264	| m_pLastStatus
268	| m_pWndPark
272	| m_nCtrlRef
276	| m_bNeedTerm
	+---

_AFX_THREAD_STATE::$vftable@:
	| &_AFX_THREAD_STATE_meta
	|  0
 0	| &_AFX_THREAD_STATE::{dtor}

_AFX_THREAD_STATE::{dtor} this adjustor: 0
_AFX_THREAD_STATE::__delDtor this adjustor: 0
_AFX_THREAD_STATE::__vecDelDtor this adjustor: 0

class HDROP__	size(4):
	+---
 0	| unused
	+---

class _DRAGINFOA	size(24):
	+---
 0	| uSize
 4	| tagPOINT pt
12	| fNC
16	| lpFileList
20	| grfKeyState
	+---

class _DRAGINFOW	size(24):
	+---
 0	| uSize
 4	| tagPOINT pt
12	| fNC
16	| lpFileList
20	| grfKeyState
	+---

class _AppBarData	size(36):
	+---
 0	| cbSize
 4	| hWnd
 8	| uCallbackMessage
12	| uEdge
16	| tagRECT rc
32	| lParam
	+---

class _SHFILEOPSTRUCTA	size(30):
	+---
 0	| hwnd
 4	| wFunc
 8	| pFrom
12	| pTo
16	| fFlags
18	| fAnyOperationsAborted
22	| hNameMappings
26	| lpszProgressTitle
	+---

class _SHFILEOPSTRUCTW	size(30):
	+---
 0	| hwnd
 4	| wFunc
 8	| pFrom
12	| pTo
16	| fFlags
18	| fAnyOperationsAborted
22	| hNameMappings
26	| lpszProgressTitle
	+---

class _SHNAMEMAPPINGA	size(16):
	+---
 0	| pszOldPath
 4	| pszNewPath
 8	| cchOldPath
12	| cchNewPath
	+---

class _SHNAMEMAPPINGW	size(16):
	+---
 0	| pszOldPath
 4	| pszNewPath
 8	| cchOldPath
12	| cchNewPath
	+---

class _SHELLEXECUTEINFOA::<anonymous-tag>	size(4):
	+---
 0	| hIcon
	+---

class _SHELLEXECUTEINFOA	size(60):
	+---
 0	| cbSize
 4	| fMask
 8	| hwnd
12	| lpVerb
16	| lpFile
20	| lpParameters
24	| lpDirectory
28	| nShow
32	| hInstApp
36	| lpIDList
40	| lpClass
44	| hkeyClass
48	| dwHotKey
  	| <anonymous-tag> <alignment member> (size=52)
52	| hIcon
56	| hProcess
	+---

class _SHELLEXECUTEINFOW::<anonymous-tag>	size(4):
	+---
 0	| hIcon
	+---

class _SHELLEXECUTEINFOW	size(60):
	+---
 0	| cbSize
 4	| fMask
 8	| hwnd
12	| lpVerb
16	| lpFile
20	| lpParameters
24	| lpDirectory
28	| nShow
32	| hInstApp
36	| lpIDList
40	| lpClass
44	| hkeyClass
48	| dwHotKey
  	| <anonymous-tag> <alignment member> (size=52)
52	| hIcon
56	| hProcess
	+---

class _NOTIFYICONDATAA	size(88):
	+---
 0	| cbSize
 4	| hWnd
 8	| uID
12	| uFlags
16	| uCallbackMessage
20	| hIcon
24	| szTip
	+---

class _NOTIFYICONDATAW	size(152):
	+---
 0	| cbSize
 4	| hWnd
 8	| uID
12	| uFlags
16	| uCallbackMessage
20	| hIcon
24	| szTip
	+---

class _NOTIFYICONIDENTIFIER	size(28):
	+---
 0	| cbSize
 4	| hWnd
 8	| uID
12	| _GUID guidItem
	+---

class _SHFILEINFOA	size(352):
	+---
 0	| hIcon
 4	| iIcon
 8	| dwAttributes
12	| szDisplayName
272	| szTypeName
	+---

class _SHFILEINFOW	size(692):
	+---
 0	| hIcon
 4	| iIcon
 8	| dwAttributes
12	| szDisplayName
532	| szTypeName
	+---

class CSize	size(8):
	+---
 0	| +--- (base class tagSIZE)
 0	| | cx
 4	| | cy
	| +---
	+---

class CPoint	size(8):
	+---
 0	| +--- (base class tagPOINT)
 0	| | x
 4	| | y
	| +---
	+---

class CRect	size(16):
	+---
 0	| +--- (base class tagRECT)
 0	| | left
 4	| | top
 8	| | right
12	| | bottom
	| +---
	+---

class CResourceException	size(152):
	+---
 0	| +--- (base class CSimpleException)
 0	| | +--- (base class CException)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_bAutoDelete
	| | +---
 8	| | m_bAutoDelete
12	| | m_bInitialized
16	| | m_bLoaded
20	| | m_szMessage
148	| | m_nResourceID
	| +---
	+---

CResourceException::$vftable@:
	| &CResourceException_meta
	|  0
 0	| &CResourceException::GetRuntimeClass
 1	| &CResourceException::{dtor}
 2	| &CObject::Serialize
 5	| &CSimpleException::GetErrorMessage
 6	| &CException::ReportError

CResourceException::GetRuntimeClass this adjustor: 0
CResourceException::{dtor} this adjustor: 0
CResourceException::__delDtor this adjustor: 0
CResourceException::__vecDelDtor this adjustor: 0

class CUserException	size(152):
	+---
 0	| +--- (base class CSimpleException)
 0	| | +--- (base class CException)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_bAutoDelete
	| | +---
 8	| | m_bAutoDelete
12	| | m_bInitialized
16	| | m_bLoaded
20	| | m_szMessage
148	| | m_nResourceID
	| +---
	+---

CUserException::$vftable@:
	| &CUserException_meta
	|  0
 0	| &CUserException::GetRuntimeClass
 1	| &CUserException::{dtor}
 2	| &CObject::Serialize
 5	| &CSimpleException::GetErrorMessage
 6	| &CException::ReportError

CUserException::GetRuntimeClass this adjustor: 0
CUserException::{dtor} this adjustor: 0
CUserException::__delDtor this adjustor: 0
CUserException::__vecDelDtor this adjustor: 0

class CGdiObject	size(8):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_hObject
	+---

CGdiObject::$vftable@:
	| &CGdiObject_meta
	|  0
 0	| &CGdiObject::GetRuntimeClass
 1	| &CGdiObject::{dtor}
 2	| &CObject::Serialize

CGdiObject::GetRuntimeClass this adjustor: 0
CGdiObject::{dtor} this adjustor: 0
CGdiObject::__delDtor this adjustor: 0
CGdiObject::__vecDelDtor this adjustor: 0

class CPen	size(8):
	+---
 0	| +--- (base class CGdiObject)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hObject
	| +---
	+---

CPen::$vftable@:
	| &CPen_meta
	|  0
 0	| &CPen::GetRuntimeClass
 1	| &CPen::{dtor}
 2	| &CObject::Serialize

CPen::GetRuntimeClass this adjustor: 0
CPen::{dtor} this adjustor: 0
CPen::__delDtor this adjustor: 0
CPen::__vecDelDtor this adjustor: 0

class CBrush	size(8):
	+---
 0	| +--- (base class CGdiObject)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hObject
	| +---
	+---

CBrush::$vftable@:
	| &CBrush_meta
	|  0
 0	| &CBrush::GetRuntimeClass
 1	| &CBrush::{dtor}
 2	| &CObject::Serialize

CBrush::GetRuntimeClass this adjustor: 0
CBrush::{dtor} this adjustor: 0
CBrush::__delDtor this adjustor: 0
CBrush::__vecDelDtor this adjustor: 0

class CFont	size(8):
	+---
 0	| +--- (base class CGdiObject)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hObject
	| +---
	+---

CFont::$vftable@:
	| &CFont_meta
	|  0
 0	| &CFont::GetRuntimeClass
 1	| &CFont::{dtor}
 2	| &CObject::Serialize

CFont::GetRuntimeClass this adjustor: 0
CFont::{dtor} this adjustor: 0
CFont::__delDtor this adjustor: 0
CFont::__vecDelDtor this adjustor: 0

class CBitmap	size(8):
	+---
 0	| +--- (base class CGdiObject)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hObject
	| +---
	+---

CBitmap::$vftable@:
	| &CBitmap_meta
	|  0
 0	| &CBitmap::GetRuntimeClass
 1	| &CBitmap::{dtor}
 2	| &CObject::Serialize

CBitmap::GetRuntimeClass this adjustor: 0
CBitmap::{dtor} this adjustor: 0
CBitmap::__delDtor this adjustor: 0
CBitmap::__vecDelDtor this adjustor: 0

class CPalette	size(8):
	+---
 0	| +--- (base class CGdiObject)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hObject
	| +---
	+---

CPalette::$vftable@:
	| &CPalette_meta
	|  0
 0	| &CPalette::GetRuntimeClass
 1	| &CPalette::{dtor}
 2	| &CObject::Serialize

CPalette::GetRuntimeClass this adjustor: 0
CPalette::{dtor} this adjustor: 0
CPalette::__delDtor this adjustor: 0
CPalette::__vecDelDtor this adjustor: 0

class CRgn	size(8):
	+---
 0	| +--- (base class CGdiObject)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hObject
	| +---
	+---

CRgn::$vftable@:
	| &CRgn_meta
	|  0
 0	| &CRgn::GetRuntimeClass
 1	| &CRgn::{dtor}
 2	| &CObject::Serialize

CRgn::GetRuntimeClass this adjustor: 0
CRgn::{dtor} this adjustor: 0
CRgn::__delDtor this adjustor: 0
CRgn::__vecDelDtor this adjustor: 0

class CDC	size(16):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_hDC
 8	| m_hAttribDC
12	| m_bPrinting
	+---

CDC::$vftable@:
	| &CDC_meta
	|  0
 0	| &CDC::GetRuntimeClass
 1	| &CDC::{dtor}
 2	| &CObject::Serialize
 5	| &CDC::SetAttribDC
 6	| &CDC::SetOutputDC
 7	| &CDC::ReleaseAttribDC
 8	| &CDC::ReleaseOutputDC
 9	| &CDC::SaveDC
10	| &CDC::RestoreDC
11	| &CDC::SelectStockObject
12	| &CDC::SelectObject
13	| &CDC::SetBkColor
14	| &CDC::SetTextColor
15	| &CDC::SetMapMode
16	| &CDC::SetViewportOrg
17	| &CDC::OffsetViewportOrg
18	| &CDC::SetViewportExt
19	| &CDC::ScaleViewportExt
20	| &CDC::SetWindowExt
21	| &CDC::ScaleWindowExt
22	| &CDC::GetClipBox
23	| &CDC::PtVisible
24	| &CDC::RectVisible
25	| &CDC::TextOutA
26	| &CDC::ExtTextOutA
27	| &CDC::TabbedTextOutA
28	| &CDC::DrawTextA
29	| &CDC::GrayStringA
30	| &CDC::Escape

CDC::GetRuntimeClass this adjustor: 0
CDC::SetAttribDC this adjustor: 0
CDC::SetOutputDC this adjustor: 0
CDC::ReleaseAttribDC this adjustor: 0
CDC::ReleaseOutputDC this adjustor: 0
CDC::SaveDC this adjustor: 0
CDC::RestoreDC this adjustor: 0
CDC::SelectStockObject this adjustor: 0
CDC::SelectObject this adjustor: 0
CDC::SetBkColor this adjustor: 0
CDC::SetTextColor this adjustor: 0
CDC::SetMapMode this adjustor: 0
CDC::SetViewportOrg this adjustor: 0
CDC::OffsetViewportOrg this adjustor: 0
CDC::SetViewportExt this adjustor: 0
CDC::ScaleViewportExt this adjustor: 0
CDC::SetWindowExt this adjustor: 0
CDC::ScaleWindowExt this adjustor: 0
CDC::GetClipBox this adjustor: 0
CDC::PtVisible this adjustor: 0
CDC::RectVisible this adjustor: 0
CDC::TextOutA this adjustor: 0
CDC::ExtTextOutA this adjustor: 0
CDC::TabbedTextOutA this adjustor: 0
CDC::DrawTextA this adjustor: 0
CDC::GrayStringA this adjustor: 0
CDC::Escape this adjustor: 0
CDC::{dtor} this adjustor: 0
CDC::__delDtor this adjustor: 0
CDC::__vecDelDtor this adjustor: 0

class CPaintDC	size(84):
	+---
 0	| +--- (base class CDC)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hDC
 8	| | m_hAttribDC
12	| | m_bPrinting
	| +---
16	| m_hWnd
20	| tagPAINTSTRUCT m_ps
	+---

CPaintDC::$vftable@:
	| &CPaintDC_meta
	|  0
 0	| &CPaintDC::GetRuntimeClass
 1	| &CPaintDC::{dtor}
 2	| &CObject::Serialize
 5	| &CDC::SetAttribDC
 6	| &CDC::SetOutputDC
 7	| &CDC::ReleaseAttribDC
 8	| &CDC::ReleaseOutputDC
 9	| &CDC::SaveDC
10	| &CDC::RestoreDC
11	| &CDC::SelectStockObject
12	| &CDC::SelectObject
13	| &CDC::SetBkColor
14	| &CDC::SetTextColor
15	| &CDC::SetMapMode
16	| &CDC::SetViewportOrg
17	| &CDC::OffsetViewportOrg
18	| &CDC::SetViewportExt
19	| &CDC::ScaleViewportExt
20	| &CDC::SetWindowExt
21	| &CDC::ScaleWindowExt
22	| &CDC::GetClipBox
23	| &CDC::PtVisible
24	| &CDC::RectVisible
25	| &CDC::TextOutA
26	| &CDC::ExtTextOutA
27	| &CDC::TabbedTextOutA
28	| &CDC::DrawTextA
29	| &CDC::GrayStringA
30	| &CDC::Escape

CPaintDC::GetRuntimeClass this adjustor: 0
CPaintDC::{dtor} this adjustor: 0
CPaintDC::__delDtor this adjustor: 0
CPaintDC::__vecDelDtor this adjustor: 0

class CClientDC	size(20):
	+---
 0	| +--- (base class CDC)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hDC
 8	| | m_hAttribDC
12	| | m_bPrinting
	| +---
16	| m_hWnd
	+---

CClientDC::$vftable@:
	| &CClientDC_meta
	|  0
 0	| &CClientDC::GetRuntimeClass
 1	| &CClientDC::{dtor}
 2	| &CObject::Serialize
 5	| &CDC::SetAttribDC
 6	| &CDC::SetOutputDC
 7	| &CDC::ReleaseAttribDC
 8	| &CDC::ReleaseOutputDC
 9	| &CDC::SaveDC
10	| &CDC::RestoreDC
11	| &CDC::SelectStockObject
12	| &CDC::SelectObject
13	| &CDC::SetBkColor
14	| &CDC::SetTextColor
15	| &CDC::SetMapMode
16	| &CDC::SetViewportOrg
17	| &CDC::OffsetViewportOrg
18	| &CDC::SetViewportExt
19	| &CDC::ScaleViewportExt
20	| &CDC::SetWindowExt
21	| &CDC::ScaleWindowExt
22	| &CDC::GetClipBox
23	| &CDC::PtVisible
24	| &CDC::RectVisible
25	| &CDC::TextOutA
26	| &CDC::ExtTextOutA
27	| &CDC::TabbedTextOutA
28	| &CDC::DrawTextA
29	| &CDC::GrayStringA
30	| &CDC::Escape

CClientDC::GetRuntimeClass this adjustor: 0
CClientDC::{dtor} this adjustor: 0
CClientDC::__delDtor this adjustor: 0
CClientDC::__vecDelDtor this adjustor: 0

class CWindowDC	size(20):
	+---
 0	| +--- (base class CDC)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_hDC
 8	| | m_hAttribDC
12	| | m_bPrinting
	| +---
16	| m_hWnd
	+---

CWindowDC::$vftable@:
	| &CWindowDC_meta
	|  0
 0	| &CWindowDC::GetRuntimeClass
 1	| &CWindowDC::{dtor}
 2	| &CObject::Serialize
 5	| &CDC::SetAttribDC
 6	| &CDC::SetOutputDC
 7	| &CDC::ReleaseAttribDC
 8	| &CDC::ReleaseOutputDC
 9	| &CDC::SaveDC
10	| &CDC::RestoreDC
11	| &CDC::SelectStockObject
12	| &CDC::SelectObject
13	| &CDC::SetBkColor
14	| &CDC::SetTextColor
15	| &CDC::SetMapMode
16	| &CDC::SetViewportOrg
17	| &CDC::OffsetViewportOrg
18	| &CDC::SetViewportExt
19	| &CDC::ScaleViewportExt
20	| &CDC::SetWindowExt
21	| &CDC::ScaleWindowExt
22	| &CDC::GetClipBox
23	| &CDC::PtVisible
24	| &CDC::RectVisible
25	| &CDC::TextOutA
26	| &CDC::ExtTextOutA
27	| &CDC::TabbedTextOutA
28	| &CDC::DrawTextA
29	| &CDC::GrayStringA
30	| &CDC::Escape

CWindowDC::GetRuntimeClass this adjustor: 0
CWindowDC::{dtor} this adjustor: 0
CWindowDC::__delDtor this adjustor: 0
CWindowDC::__vecDelDtor this adjustor: 0

class CMenu	size(8):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_hMenu
	+---

CMenu::$vftable@:
	| &CMenu_meta
	|  0
 0	| &CMenu::GetRuntimeClass
 1	| &CMenu::{dtor}
 2	| &CObject::Serialize
 5	| &CMenu::DrawItem
 6	| &CMenu::MeasureItem

CMenu::GetRuntimeClass this adjustor: 0
CMenu::DrawItem this adjustor: 0
CMenu::MeasureItem this adjustor: 0
CMenu::{dtor} this adjustor: 0
CMenu::__delDtor this adjustor: 0
CMenu::__vecDelDtor this adjustor: 0

class AFX_MSGMAP	size(8):
	+---
 0	| pBaseMap
 4	| lpEntries
	+---

class CDataExchange	size(16):
	+---
 0	| m_bSaveAndValidate
 4	| m_pDlgWnd
 8	| m_hWndLastControl
12	| m_bEditLastControl
	+---

class AFX_INTERFACEMAP_ENTRY	size(8):
	+---
 0	| piid
 4	| nOffset
	+---

class AFX_INTERFACEMAP	size(8):
	+---
 0	| pBaseMap
 4	| pEntry
	+---

class AFX_DISPMAP	size(16):
	+---
 0	| pBaseMap
 4	| lpEntries
 8	| lpEntryCount
12	| lpStockPropMask
	+---

class AFX_OLECMDMAP_ENTRY	size(12):
	+---
 0	| pguid
 4	| cmdID
 8	| nID
	+---

class AFX_OLECMDMAP	size(8):
	+---
 0	| pBaseMap
 4	| lpEntries
	+---

class AFX_EVENTSINKMAP	size(12):
	+---
 0	| pBaseMap
 4	| lpEntries
 8	| lpEntryCount
	+---

class AFX_CONNECTIONMAP_ENTRY	size(8):
	+---
 0	| piid
 4	| nOffset
	+---

class AFX_CONNECTIONMAP	size(8):
	+---
 0	| pBaseMap
 4	| pEntry
	+---

class CCmdTarget::XDispatch	size(4):
	+---
 0	| m_vtbl
	+---

class CCmdTarget::XConnPtContainer	size(4):
	+---
 0	| m_vtbl
	+---

class CCmdTarget	size(28):
	+---
 0	| +--- (base class CObject)
 0	| | {vfptr}
	| +---
 4	| m_dwRef
 8	| m_pOuterUnknown
12	| m_xInnerUnknown
16	| XDispatch m_xDispatch
20	| m_bResultExpected
24	| XConnPtContainer m_xConnPtContainer
	+---

CCmdTarget::$vftable@:
	| &CCmdTarget_meta
	|  0
 0	| &CCmdTarget::GetRuntimeClass
 1	| &CCmdTarget::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CCmdTarget::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CCmdTarget::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook

CCmdTarget::GetRuntimeClass this adjustor: 0
CCmdTarget::OnCmdMsg this adjustor: 0
CCmdTarget::OnFinalRelease this adjustor: 0
CCmdTarget::IsInvokeAllowed this adjustor: 0
CCmdTarget::GetDispatchIID this adjustor: 0
CCmdTarget::GetTypeInfoCount this adjustor: 0
CCmdTarget::GetTypeLibCache this adjustor: 0
CCmdTarget::GetTypeLib this adjustor: 0
CCmdTarget::{dtor} this adjustor: 0
CCmdTarget::GetMessageMap this adjustor: 0
CCmdTarget::GetCommandMap this adjustor: 0
CCmdTarget::GetDispatchMap this adjustor: 0
CCmdTarget::GetConnectionMap this adjustor: 0
CCmdTarget::GetInterfaceMap this adjustor: 0
CCmdTarget::GetEventSinkMap this adjustor: 0
CCmdTarget::OnCreateAggregates this adjustor: 0
CCmdTarget::GetInterfaceHook this adjustor: 0
CCmdTarget::GetExtraConnectionPoints this adjustor: 0
CCmdTarget::GetConnectionHook this adjustor: 0
CCmdTarget::__delDtor this adjustor: 0
CCmdTarget::__vecDelDtor this adjustor: 0

class CCmdUI	size(40):
	+---
 0	| {vfptr}
 4	| m_nID
 8	| m_nIndex
12	| m_pMenu
16	| m_pSubMenu
20	| m_pOther
24	| m_bEnableChanged
28	| m_bContinueRouting
32	| m_nIndexMax
36	| m_pParentMenu
	+---

CCmdUI::$vftable@:
	| &CCmdUI_meta
	|  0
 0	| &CCmdUI::Enable
 1	| &CCmdUI::SetCheck
 2	| &CCmdUI::SetRadio
 3	| &CCmdUI::SetText

CCmdUI::Enable this adjustor: 0
CCmdUI::SetCheck this adjustor: 0
CCmdUI::SetRadio this adjustor: 0
CCmdUI::SetText this adjustor: 0

class AFX_DISPMAP_ENTRY	size(32):
	+---
 0	| lpszName
 4	| lDispID
 8	| lpszParams
12	| vt
  	| <alignment member> (size=2)
16	| pfn
20	| pfnSet
24	| nPropOffset
28	| AFX_DISPMAP_FLAGS flags
	+---

class AFX_EVENTSINKMAP_ENTRY	size(40):
	+---
 0	| AFX_DISPMAP_ENTRY dispEntry
32	| nCtrlIDFirst
36	| nCtrlIDLast
	+---

class AFX_MSGMAP_ENTRY	size(24):
	+---
 0	| nMessage
 4	| nCode
 8	| nID
12	| nLastID
16	| nSig
20	| pfn
	+---

class CWnd	size(60):
	+---
 0	| +--- (base class CCmdTarget)
 0	| | +--- (base class CObject)
 0	| | | {vfptr}
	| | +---
 4	| | m_dwRef
 8	| | m_pOuterUnknown
12	| | m_xInnerUnknown
16	| | XDispatch m_xDispatch
20	| | m_bResultExpected
24	| | XConnPtContainer m_xConnPtContainer
	| +---
28	| m_hWnd
32	| m_hWndOwner
36	| m_nFlags
40	| m_pfnSuper
44	| m_nModalResult
48	| m_pDropTarget
52	| m_pCtrlCont
56	| m_pCtrlSite
	+---

CWnd::$vftable@:
	| &CWnd_meta
	|  0
 0	| &CWnd::GetRuntimeClass
 1	| &CWnd::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CWnd::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo

CWnd::GetRuntimeClass this adjustor: 0
CWnd::PreSubclassWindow this adjustor: 0
CWnd::Create this adjustor: 0
CWnd::DestroyWindow this adjustor: 0
CWnd::PreCreateWindow this adjustor: 0
CWnd::CalcWindowRect this adjustor: 0
CWnd::OnToolHitTest this adjustor: 0
CWnd::GetScrollBarCtrl this adjustor: 0
CWnd::WinHelpA this adjustor: 0
CWnd::ContinueModal this adjustor: 0
CWnd::EndModalLoop this adjustor: 0
CWnd::OnCommand this adjustor: 0
CWnd::OnNotify this adjustor: 0
CWnd::GetSuperWndProcAddr this adjustor: 0
CWnd::DoDataExchange this adjustor: 0
CWnd::BeginModalState this adjustor: 0
CWnd::EndModalState this adjustor: 0
CWnd::PreTranslateMessage this adjustor: 0
CWnd::OnAmbientProperty this adjustor: 0
CWnd::WindowProc this adjustor: 0
CWnd::OnWndMsg this adjustor: 0
CWnd::DefWindowProcA this adjustor: 0
CWnd::PostNcDestroy this adjustor: 0
CWnd::OnChildNotify this adjustor: 0
CWnd::{dtor} this adjustor: 0
CWnd::CheckAutoCenter this adjustor: 0
CWnd::IsFrameWnd this adjustor: 0
CWnd::OnFinalRelease this adjustor: 0
CWnd::SetOccDialogInfo this adjustor: 0
CWnd::GetMessageMap this adjustor: 0
CWnd::__delDtor this adjustor: 0
CWnd::__vecDelDtor this adjustor: 0

class CDialog	size(92):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
60	| m_nIDHelp
64	| m_lpszTemplateName
68	| m_hDialogTemplate
72	| m_lpDialogTemplate
76	| m_lpDialogInit
80	| m_pParentWnd
84	| m_hWndTop
88	| m_pOccDialogInfo
	+---

CDialog::$vftable@:
	| &CDialog_meta
	|  0
 0	| &CDialog::GetRuntimeClass
 1	| &CDialog::{dtor}
 2	| &CObject::Serialize
 5	| &CDialog::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CDialog::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CDialog::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CWnd::OnChildNotify
45	| &CDialog::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CDialog::SetOccDialogInfo
48	| &CDialog::DoModal
49	| &CDialog::OnInitDialog
50	| &CDialog::OnSetFont
51	| &CDialog::OnOK
52	| &CDialog::OnCancel
53	| &CDialog::PreInitDialog

CDialog::GetRuntimeClass this adjustor: 0
CDialog::DoModal this adjustor: 0
CDialog::OnInitDialog this adjustor: 0
CDialog::OnSetFont this adjustor: 0
CDialog::OnOK this adjustor: 0
CDialog::OnCancel this adjustor: 0
CDialog::{dtor} this adjustor: 0
CDialog::PreTranslateMessage this adjustor: 0
CDialog::OnCmdMsg this adjustor: 0
CDialog::CheckAutoCenter this adjustor: 0
CDialog::SetOccDialogInfo this adjustor: 0
CDialog::PreInitDialog this adjustor: 0
CDialog::GetMessageMap this adjustor: 0
CDialog::__delDtor this adjustor: 0
CDialog::__vecDelDtor this adjustor: 0

class CStatic	size(60):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
	+---

CStatic::$vftable@:
	| &CStatic_meta
	|  0
 0	| &CStatic::GetRuntimeClass
 1	| &CStatic::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CWnd::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo

CStatic::GetRuntimeClass this adjustor: 0
CStatic::{dtor} this adjustor: 0
CStatic::__delDtor this adjustor: 0
CStatic::__vecDelDtor this adjustor: 0

class CButton	size(60):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
	+---

CButton::$vftable@:
	| &CButton_meta
	|  0
 0	| &CButton::GetRuntimeClass
 1	| &CButton::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CButton::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo
48	| &CButton::DrawItem

CButton::GetRuntimeClass this adjustor: 0
CButton::DrawItem this adjustor: 0
CButton::{dtor} this adjustor: 0
CButton::OnChildNotify this adjustor: 0
CButton::__delDtor this adjustor: 0
CButton::__vecDelDtor this adjustor: 0

class CListBox	size(60):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
	+---

CListBox::$vftable@:
	| &CListBox_meta
	|  0
 0	| &CListBox::GetRuntimeClass
 1	| &CListBox::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CListBox::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo
48	| &CListBox::DrawItem
49	| &CListBox::MeasureItem
50	| &CListBox::CompareItem
51	| &CListBox::DeleteItem
52	| &CListBox::VKeyToItem
53	| &CListBox::CharToItem

CListBox::GetRuntimeClass this adjustor: 0
CListBox::DrawItem this adjustor: 0
CListBox::MeasureItem this adjustor: 0
CListBox::CompareItem this adjustor: 0
CListBox::DeleteItem this adjustor: 0
CListBox::VKeyToItem this adjustor: 0
CListBox::CharToItem this adjustor: 0
CListBox::{dtor} this adjustor: 0
CListBox::OnChildNotify this adjustor: 0
CListBox::__delDtor this adjustor: 0
CListBox::__vecDelDtor this adjustor: 0

class CCheckListBox	size(68):
	+---
 0	| +--- (base class CListBox)
 0	| | +--- (base class CWnd)
 0	| | | +--- (base class CCmdTarget)
 0	| | | | +--- (base class CObject)
 0	| | | | | {vfptr}
	| | | | +---
 4	| | | | m_dwRef
 8	| | | | m_pOuterUnknown
12	| | | | m_xInnerUnknown
16	| | | | XDispatch m_xDispatch
20	| | | | m_bResultExpected
24	| | | | XConnPtContainer m_xConnPtContainer
	| | | +---
28	| | | m_hWnd
32	| | | m_hWndOwner
36	| | | m_nFlags
40	| | | m_pfnSuper
44	| | | m_nModalResult
48	| | | m_pDropTarget
52	| | | m_pCtrlCont
56	| | | m_pCtrlSite
	| | +---
	| +---
60	| m_cyText
64	| m_nStyle
	+---

CCheckListBox::$vftable@:
	| &CCheckListBox_meta
	|  0
 0	| &CCheckListBox::GetRuntimeClass
 1	| &CCheckListBox::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CCheckListBox::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CCheckListBox::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo
48	| &CCheckListBox::DrawItem
49	| &CCheckListBox::MeasureItem
50	| &CListBox::CompareItem
51	| &CListBox::DeleteItem
52	| &CListBox::VKeyToItem
53	| &CListBox::CharToItem
54	| &CCheckListBox::OnGetCheckPosition

CCheckListBox::GetRuntimeClass this adjustor: 0
CCheckListBox::OnGetCheckPosition this adjustor: 0
CCheckListBox::DrawItem this adjustor: 0
CCheckListBox::MeasureItem this adjustor: 0
CCheckListBox::OnChildNotify this adjustor: 0
CCheckListBox::GetMessageMap this adjustor: 0
CCheckListBox::{dtor} this adjustor: 0
CCheckListBox::__delDtor this adjustor: 0
CCheckListBox::__vecDelDtor this adjustor: 0

class CComboBox	size(60):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
	+---

CComboBox::$vftable@:
	| &CComboBox_meta
	|  0
 0	| &CComboBox::GetRuntimeClass
 1	| &CComboBox::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CComboBox::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo
48	| &CComboBox::DrawItem
49	| &CComboBox::MeasureItem
50	| &CComboBox::CompareItem
51	| &CComboBox::DeleteItem

CComboBox::GetRuntimeClass this adjustor: 0
CComboBox::DrawItem this adjustor: 0
CComboBox::MeasureItem this adjustor: 0
CComboBox::CompareItem this adjustor: 0
CComboBox::DeleteItem this adjustor: 0
CComboBox::{dtor} this adjustor: 0
CComboBox::OnChildNotify this adjustor: 0
CComboBox::__delDtor this adjustor: 0
CComboBox::__vecDelDtor this adjustor: 0

class CEdit	size(60):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
	+---

CEdit::$vftable@:
	| &CEdit_meta
	|  0
 0	| &CEdit::GetRuntimeClass
 1	| &CEdit::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CWnd::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo

CEdit::GetRuntimeClass this adjustor: 0
CEdit::{dtor} this adjustor: 0
CEdit::__delDtor this adjustor: 0
CEdit::__vecDelDtor this adjustor: 0

class CScrollBar	size(60):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
	+---

CScrollBar::$vftable@:
	| &CScrollBar_meta
	|  0
 0	| &CScrollBar::GetRuntimeClass
 1	| &CScrollBar::{dtor}
 2	| &CObject::Serialize
 5	| &CCmdTarget::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CWnd::BeginModalState
37	| &CWnd::EndModalState
38	| &CWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CWnd::PostNcDestroy
44	| &CWnd::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo

CScrollBar::GetRuntimeClass this adjustor: 0
CScrollBar::{dtor} this adjustor: 0
CScrollBar::__delDtor this adjustor: 0
CScrollBar::__vecDelDtor this adjustor: 0

class CFrameWnd	size(188):
	+---
 0	| +--- (base class CWnd)
 0	| | +--- (base class CCmdTarget)
 0	| | | +--- (base class CObject)
 0	| | | | {vfptr}
	| | | +---
 4	| | | m_dwRef
 8	| | | m_pOuterUnknown
12	| | | m_xInnerUnknown
16	| | | XDispatch m_xDispatch
20	| | | m_bResultExpected
24	| | | XConnPtContainer m_xConnPtContainer
	| | +---
28	| | m_hWnd
32	| | m_hWndOwner
36	| | m_nFlags
40	| | m_pfnSuper
44	| | m_nModalResult
48	| | m_pDropTarget
52	| | m_pCtrlCont
56	| | m_pCtrlSite
	| +---
60	| m_bAutoMenuEnable
64	| m_nWindow
68	| m_hMenuDefault
72	| m_hAccelTable
76	| m_dwPromptContext
80	| m_bHelpMode
84	| m_pNextFrameWnd
88	| CRect m_rectBorder
104	| m_pNotifyHook
108	| CPtrList m_listControlBars
136	| m_nShowDelay
140	| m_nIDHelp
144	| m_nIDTracking
148	| m_nIDLastMessage
152	| m_pViewActive
156	| m_lpfnCloseProc
160	| m_cModalStack
164	| m_phWndDisable
168	| m_hMenuAlt
172	| CString m_strTitle
176	| m_bInRecalcLayout
180	| m_pFloatingFrameClass
184	| m_nIdleFlags
	+---

CFrameWnd::$vftable@:
	| &CFrameWnd_meta
	|  0
 0	| &CFrameWnd::GetRuntimeClass
 1	| &CFrameWnd::{dtor}
 2	| &CObject::Serialize
 5	| &CFrameWnd::OnCmdMsg
 6	| &CWnd::OnFinalRelease
 7	| &CCmdTarget::IsInvokeAllowed
 8	| &CCmdTarget::GetDispatchIID
 9	| &CCmdTarget::GetTypeInfoCount
10	| &CCmdTarget::GetTypeLibCache
11	| &CCmdTarget::GetTypeLib
12	| &CFrameWnd::GetMessageMap
13	| &CCmdTarget::GetCommandMap
14	| &CCmdTarget::GetDispatchMap
15	| &CCmdTarget::GetConnectionMap
16	| &CCmdTarget::GetInterfaceMap
17	| &CCmdTarget::GetEventSinkMap
18	| &CCmdTarget::OnCreateAggregates
19	| &CCmdTarget::GetInterfaceHook
20	| &CCmdTarget::GetExtraConnectionPoints
21	| &CCmdTarget::GetConnectionHook
22	| &CWnd::PreSubclassWindow
23	| &CWnd::Create
24	| &CWnd::DestroyWindow
25	| &CFrameWnd::PreCreateWindow
26	| &CWnd::CalcWindowRect
27	| &CWnd::OnToolHitTest
28	| &CWnd::GetScrollBarCtrl
29	| &CWnd::WinHelpA
30	| &CWnd::ContinueModal
31	| &CWnd::EndModalLoop
32	| &CFrameWnd::OnCommand
33	| &CWnd::OnNotify
34	| &CWnd::GetSuperWndProcAddr
35	| &CWnd::DoDataExchange
36	| &CFrameWnd::BeginModalState
37	| &CFrameWnd::EndModalState
38	| &CFrameWnd::PreTranslateMessage
39	| &CWnd::OnAmbientProperty
40	| &CWnd::WindowProc
41	| &CWnd::OnWndMsg
42	| &CWnd::DefWindowProcA
43	| &CFrameWnd::PostNcDestroy
44	| &CWnd::OnChildNotify
45	| &CWnd::CheckAutoCenter
46	| &CFrameWnd::IsFrameWnd
47	| &CWnd::SetOccDialogInfo
48	| &CFrameWnd::LoadFrame
49	| &CFrameWnd::GetActiveDocument
50	| &CFrameWnd::GetActiveFrame
51	| &CFrameWnd::GetMessageString
52	| &CFrameWnd::RecalcLayout
53	| &CFrameWnd::ActivateFrame
54	| &CFrameWnd::OnSetPreviewMode
55	| &CFrameWnd::GetMessageBar
56	| &CFrameWnd::NegotiateBorderSpace
57	| &CFrameWnd::OnCreateClient
58	| &CFrameWnd::OnUpdateFrameTitle
59	| &CFrameWnd::OnUpdateFrameMenu
60	| &CFrameWnd::GetDefaultAccelerator
61	| &CFrameWnd::DelayUpdateFrameMenu
62	| &CFrameWnd::ExitHelpMode

CFrameWnd::GetRuntimeClass this adjustor: 0
CFrameWnd::LoadFrame this adjustor: 0
CFrameWnd::GetActiveDocument this adjustor: 0
CFrameWnd::GetActiveFrame this adjustor: 0
CFrameWnd::GetMessageString this adjustor: 0
CFrameWnd::RecalcLayout this adjustor: 0
CFrameWnd::ActivateFrame this adjustor: 0
CFrameWnd::BeginModalState this adjustor: 0
CFrameWnd::EndModalState this adjustor: 0
CFrameWnd::OnSetPreviewMode this adjustor: 0
CFrameWnd::GetMessageBar this adjustor: 0
CFrameWnd::NegotiateBorderSpace this adjustor: 0
CFrameWnd::OnCreateClient this adjustor: 0
CFrameWnd::{dtor} this adjustor: 0
CFrameWnd::IsFrameWnd this adjustor: 0
CFrameWnd::OnCmdMsg this adjustor: 0
CFrameWnd::OnUpdateFrameTitle this adjustor: 0
CFrameWnd::OnUpdateFrameMenu this adjustor: 0
CFrameWnd::GetDefaultAccelerator this adjustor: 0
CFrameWnd::PreTranslateMessage this adjustor: 0
CFrameWnd::DelayUpdateFrameMenu this adjustor: 0
CFrameWnd::ExitHelpMode this adjustor: 0
CFrameWnd::PreCreateWindow this adjustor: 0
CFrameWnd::OnCommand this adjustor: 0
CFrameWnd::PostNcDestroy this adjustor: 0
CFrameWnd::GetMessageMap this adjustor: 0
CFrameWnd::__delDtor this adjustor: 0
CFrameWnd::__vecDelDtor this adjustor: 0

class CMDIFrameWnd	size(192):
	+---
 0	| +--- (base class CFrameWnd)
 0	| | +--- (base class CWnd)
 0	| | | +--- (base class CCmdTarget)
 0	| | | | +--- (base class CObject)
 0	| | | | | {vfptr}
	| | | | +---
 4	| | | | m_dwRef
 8	| | | | m_pOuterUnknown
12	| | | | m_xInnerUnknown
16	| | | | XDispatch m_xDispatch
20	| | | | m_bResultExpected
24	| | | | XConnPtContainer m_xConnPtContainer
	| | | +---
28	| | | m_hWnd
32	| | | m_hWndOwner
36	| | | m_nFlags
40	| | | m_pfnSuper
44	| | | m_nModalResult
48	| | | m_pDropTarget
52	| | | m_pCtrlCont
56	| | | m_pCtrlSite
	| | +---
60	| | m_bAutoMenuEnable
64	| | m_nWindow
68	| | m_hMenuDefault
72	| | m_hAccelTable
76	| | m_dwPromptContext
80	| | m_bHelpMode
84	| | m_pNextFrameWnd
88	| | CRect m_rectBorder
104	| | m_pNotifyHook
108	| | CPtrList m_listControlBars
136	| | m_nShowDelay
140	| | m_nIDHelp
144	| | m_nIDTracking
148	| | m_nIDLastMessage
